Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#ifndef STM32L0X1_PERIPHERALS_H_
#define STM32L0X1_PERIPHERALS_H_

#include <stdint.h>

/* === AES ================================= */
typedef struct {
    volatile uint32_t CR; /* 0x000 */
    volatile uint32_t SR; /* 0x004 */
    volatile uint32_t DINR; /* 0x008 */
    volatile uint32_t DOUTR; /* 0x00C */
    volatile uint32_t KEYR0; /* 0x010 */
    volatile uint32_t KEYR1; /* 0x014 */
    volatile uint32_t KEYR2; /* 0x018 */
    volatile uint32_t KEYR3; /* 0x01C */
    volatile uint32_t IVR0; /* 0x020 */
    volatile uint32_t IVR1; /* 0x024 */
    volatile uint32_t IVR2; /* 0x028 */
    volatile uint32_t IVR3; /* 0x02C */
} AES_Type;

#define AES_BASE 0x40026000u
#define AES ((volatile AES_Type*)AES_BASE)

#define AES_CR_DMAOUTEN (1u << 12)
#define AES_CR_DMAINEN (1u << 11)
#define AES_CR_ERRIE (1u << 10)
#define AES_CR_CCFIE (1u << 9)
#define AES_CR_ERRC (1u << 8)
#define AES_CR_CCFC (1u << 7)
#define AES_CR_CHMOD_LSB   5
#define AES_CR_CHMOD_WIDTH 2
#define AES_CR_CHMOD_MASK  (0x60u)
#define AES_CR_MODE_LSB   3
#define AES_CR_MODE_WIDTH 2
#define AES_CR_MODE_MASK  (0x18u)
#define AES_CR_DATATYPE_LSB   1
#define AES_CR_DATATYPE_WIDTH 2
#define AES_CR_DATATYPE_MASK  (0x6u)
#define AES_CR_EN (1u << 0)
#define AES_SR_WRERR (1u << 2)
#define AES_SR_RDERR (1u << 1)
#define AES_SR_CCF (1u << 0)
#define AES_DINR_AES_DINR_LSB   0
#define AES_DINR_AES_DINR_WIDTH 32
#define AES_DINR_AES_DINR_MASK  (0xFFFFFFFFu)
#define AES_DOUTR_AES_DOUTR_LSB   0
#define AES_DOUTR_AES_DOUTR_WIDTH 32
#define AES_DOUTR_AES_DOUTR_MASK  (0xFFFFFFFFu)
#define AES_KEYR0_AES_KEYR0_LSB   0
#define AES_KEYR0_AES_KEYR0_WIDTH 32
#define AES_KEYR0_AES_KEYR0_MASK  (0xFFFFFFFFu)
#define AES_KEYR1_AES_KEYR1_LSB   0
#define AES_KEYR1_AES_KEYR1_WIDTH 32
#define AES_KEYR1_AES_KEYR1_MASK  (0xFFFFFFFFu)
#define AES_KEYR2_AES_KEYR2_LSB   0
#define AES_KEYR2_AES_KEYR2_WIDTH 32
#define AES_KEYR2_AES_KEYR2_MASK  (0xFFFFFFFFu)
#define AES_KEYR3_AES_KEYR3_LSB   0
#define AES_KEYR3_AES_KEYR3_WIDTH 32
#define AES_KEYR3_AES_KEYR3_MASK  (0xFFFFFFFFu)
#define AES_IVR0_AES_IVR0_LSB   0
#define AES_IVR0_AES_IVR0_WIDTH 32
#define AES_IVR0_AES_IVR0_MASK  (0xFFFFFFFFu)
#define AES_IVR1_AES_IVR1_LSB   0
#define AES_IVR1_AES_IVR1_WIDTH 32
#define AES_IVR1_AES_IVR1_MASK  (0xFFFFFFFFu)
#define AES_IVR2_AES_IVR2_LSB   0
#define AES_IVR2_AES_IVR2_WIDTH 32
#define AES_IVR2_AES_IVR2_MASK  (0xFFFFFFFFu)
#define AES_IVR3_AES_IVR3_LSB   0
#define AES_IVR3_AES_IVR3_WIDTH 32
#define AES_IVR3_AES_IVR3_MASK  (0xFFFFFFFFu)

/* === DMA1 ================================= */
typedef struct {
    volatile uint32_t ISR; /* 0x000 */
    volatile uint32_t IFCR; /* 0x004 */
    volatile uint32_t CCR1; /* 0x008 */
    volatile uint32_t CNDTR1; /* 0x00C */
    volatile uint32_t CPAR1; /* 0x010 */
    volatile uint32_t CMAR1; /* 0x014 */
    uint8_t _res_0018[4];
    volatile uint32_t CCR2; /* 0x01C */
    volatile uint32_t CNDTR2; /* 0x020 */
    volatile uint32_t CPAR2; /* 0x024 */
    volatile uint32_t CMAR2; /* 0x028 */
    uint8_t _res_002C[4];
    volatile uint32_t CCR3; /* 0x030 */
    volatile uint32_t CNDTR3; /* 0x034 */
    volatile uint32_t CPAR3; /* 0x038 */
    volatile uint32_t CMAR3; /* 0x03C */
    uint8_t _res_0040[4];
    volatile uint32_t CCR4; /* 0x044 */
    volatile uint32_t CNDTR4; /* 0x048 */
    volatile uint32_t CPAR4; /* 0x04C */
    volatile uint32_t CMAR4; /* 0x050 */
    uint8_t _res_0054[4];
    volatile uint32_t CCR5; /* 0x058 */
    volatile uint32_t CNDTR5; /* 0x05C */
    volatile uint32_t CPAR5; /* 0x060 */
    volatile uint32_t CMAR5; /* 0x064 */
    uint8_t _res_0068[4];
    volatile uint32_t CCR6; /* 0x06C */
    volatile uint32_t CNDTR6; /* 0x070 */
    volatile uint32_t CPAR6; /* 0x074 */
    volatile uint32_t CMAR6; /* 0x078 */
    uint8_t _res_007C[4];
    volatile uint32_t CCR7; /* 0x080 */
    volatile uint32_t CNDTR7; /* 0x084 */
    volatile uint32_t CPAR7; /* 0x088 */
    volatile uint32_t CMAR7; /* 0x08C */
    uint8_t _res_0090[24];
    volatile uint32_t CSELR; /* 0x0A8 */
} DMA1_Type;

#define DMA1_BASE 0x40020000u
#define DMA1 ((volatile DMA1_Type*)DMA1_BASE)

#define DMA1_ISR_TEIF7 (1u << 27)
#define DMA1_ISR_HTIF7 (1u << 26)
#define DMA1_ISR_TCIF7 (1u << 25)
#define DMA1_ISR_GIF7 (1u << 24)
#define DMA1_ISR_TEIF6 (1u << 23)
#define DMA1_ISR_HTIF6 (1u << 22)
#define DMA1_ISR_TCIF6 (1u << 21)
#define DMA1_ISR_GIF6 (1u << 20)
#define DMA1_ISR_TEIF5 (1u << 19)
#define DMA1_ISR_HTIF5 (1u << 18)
#define DMA1_ISR_TCIF5 (1u << 17)
#define DMA1_ISR_GIF5 (1u << 16)
#define DMA1_ISR_TEIF4 (1u << 15)
#define DMA1_ISR_HTIF4 (1u << 14)
#define DMA1_ISR_TCIF4 (1u << 13)
#define DMA1_ISR_GIF4 (1u << 12)
#define DMA1_ISR_TEIF3 (1u << 11)
#define DMA1_ISR_HTIF3 (1u << 10)
#define DMA1_ISR_TCIF3 (1u << 9)
#define DMA1_ISR_GIF3 (1u << 8)
#define DMA1_ISR_TEIF2 (1u << 7)
#define DMA1_ISR_HTIF2 (1u << 6)
#define DMA1_ISR_TCIF2 (1u << 5)
#define DMA1_ISR_GIF2 (1u << 4)
#define DMA1_ISR_TEIF1 (1u << 3)
#define DMA1_ISR_HTIF1 (1u << 2)
#define DMA1_ISR_TCIF1 (1u << 1)
#define DMA1_ISR_GIF1 (1u << 0)
#define DMA1_IFCR_CTEIF7 (1u << 27)
#define DMA1_IFCR_CHTIF7 (1u << 26)
#define DMA1_IFCR_CTCIF7 (1u << 25)
#define DMA1_IFCR_CGIF7 (1u << 24)
#define DMA1_IFCR_CTEIF6 (1u << 23)
#define DMA1_IFCR_CHTIF6 (1u << 22)
#define DMA1_IFCR_CTCIF6 (1u << 21)
#define DMA1_IFCR_CGIF6 (1u << 20)
#define DMA1_IFCR_CTEIF5 (1u << 19)
#define DMA1_IFCR_CHTIF5 (1u << 18)
#define DMA1_IFCR_CTCIF5 (1u << 17)
#define DMA1_IFCR_CGIF5 (1u << 16)
#define DMA1_IFCR_CTEIF4 (1u << 15)
#define DMA1_IFCR_CHTIF4 (1u << 14)
#define DMA1_IFCR_CTCIF4 (1u << 13)
#define DMA1_IFCR_CGIF4 (1u << 12)
#define DMA1_IFCR_CTEIF3 (1u << 11)
#define DMA1_IFCR_CHTIF3 (1u << 10)
#define DMA1_IFCR_CTCIF3 (1u << 9)
#define DMA1_IFCR_CGIF3 (1u << 8)
#define DMA1_IFCR_CTEIF2 (1u << 7)
#define DMA1_IFCR_CHTIF2 (1u << 6)
#define DMA1_IFCR_CTCIF2 (1u << 5)
#define DMA1_IFCR_CGIF2 (1u << 4)
#define DMA1_IFCR_CTEIF1 (1u << 3)
#define DMA1_IFCR_CHTIF1 (1u << 2)
#define DMA1_IFCR_CTCIF1 (1u << 1)
#define DMA1_IFCR_CGIF1 (1u << 0)
#define DMA1_CCR1_MEM2MEM (1u << 14)
#define DMA1_CCR1_PL_LSB   12
#define DMA1_CCR1_PL_WIDTH 2
#define DMA1_CCR1_PL_MASK  (0x3000u)
#define DMA1_CCR1_MSIZE_LSB   10
#define DMA1_CCR1_MSIZE_WIDTH 2
#define DMA1_CCR1_MSIZE_MASK  (0xC00u)
#define DMA1_CCR1_PSIZE_LSB   8
#define DMA1_CCR1_PSIZE_WIDTH 2
#define DMA1_CCR1_PSIZE_MASK  (0x300u)
#define DMA1_CCR1_MINC (1u << 7)
#define DMA1_CCR1_PINC (1u << 6)
#define DMA1_CCR1_CIRC (1u << 5)
#define DMA1_CCR1_DIR (1u << 4)
#define DMA1_CCR1_TEIE (1u << 3)
#define DMA1_CCR1_HTIE (1u << 2)
#define DMA1_CCR1_TCIE (1u << 1)
#define DMA1_CCR1_EN (1u << 0)
#define DMA1_CNDTR1_NDT_LSB   0
#define DMA1_CNDTR1_NDT_WIDTH 16
#define DMA1_CNDTR1_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR1_PA_LSB   0
#define DMA1_CPAR1_PA_WIDTH 32
#define DMA1_CPAR1_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR1_MA_LSB   0
#define DMA1_CMAR1_MA_WIDTH 32
#define DMA1_CMAR1_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR2_MEM2MEM (1u << 14)
#define DMA1_CCR2_PL_LSB   12
#define DMA1_CCR2_PL_WIDTH 2
#define DMA1_CCR2_PL_MASK  (0x3000u)
#define DMA1_CCR2_MSIZE_LSB   10
#define DMA1_CCR2_MSIZE_WIDTH 2
#define DMA1_CCR2_MSIZE_MASK  (0xC00u)
#define DMA1_CCR2_PSIZE_LSB   8
#define DMA1_CCR2_PSIZE_WIDTH 2
#define DMA1_CCR2_PSIZE_MASK  (0x300u)
#define DMA1_CCR2_MINC (1u << 7)
#define DMA1_CCR2_PINC (1u << 6)
#define DMA1_CCR2_CIRC (1u << 5)
#define DMA1_CCR2_DIR (1u << 4)
#define DMA1_CCR2_TEIE (1u << 3)
#define DMA1_CCR2_HTIE (1u << 2)
#define DMA1_CCR2_TCIE (1u << 1)
#define DMA1_CCR2_EN (1u << 0)
#define DMA1_CNDTR2_NDT_LSB   0
#define DMA1_CNDTR2_NDT_WIDTH 16
#define DMA1_CNDTR2_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR2_PA_LSB   0
#define DMA1_CPAR2_PA_WIDTH 32
#define DMA1_CPAR2_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR2_MA_LSB   0
#define DMA1_CMAR2_MA_WIDTH 32
#define DMA1_CMAR2_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR3_MEM2MEM (1u << 14)
#define DMA1_CCR3_PL_LSB   12
#define DMA1_CCR3_PL_WIDTH 2
#define DMA1_CCR3_PL_MASK  (0x3000u)
#define DMA1_CCR3_MSIZE_LSB   10
#define DMA1_CCR3_MSIZE_WIDTH 2
#define DMA1_CCR3_MSIZE_MASK  (0xC00u)
#define DMA1_CCR3_PSIZE_LSB   8
#define DMA1_CCR3_PSIZE_WIDTH 2
#define DMA1_CCR3_PSIZE_MASK  (0x300u)
#define DMA1_CCR3_MINC (1u << 7)
#define DMA1_CCR3_PINC (1u << 6)
#define DMA1_CCR3_CIRC (1u << 5)
#define DMA1_CCR3_DIR (1u << 4)
#define DMA1_CCR3_TEIE (1u << 3)
#define DMA1_CCR3_HTIE (1u << 2)
#define DMA1_CCR3_TCIE (1u << 1)
#define DMA1_CCR3_EN (1u << 0)
#define DMA1_CNDTR3_NDT_LSB   0
#define DMA1_CNDTR3_NDT_WIDTH 16
#define DMA1_CNDTR3_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR3_PA_LSB   0
#define DMA1_CPAR3_PA_WIDTH 32
#define DMA1_CPAR3_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR3_MA_LSB   0
#define DMA1_CMAR3_MA_WIDTH 32
#define DMA1_CMAR3_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR4_MEM2MEM (1u << 14)
#define DMA1_CCR4_PL_LSB   12
#define DMA1_CCR4_PL_WIDTH 2
#define DMA1_CCR4_PL_MASK  (0x3000u)
#define DMA1_CCR4_MSIZE_LSB   10
#define DMA1_CCR4_MSIZE_WIDTH 2
#define DMA1_CCR4_MSIZE_MASK  (0xC00u)
#define DMA1_CCR4_PSIZE_LSB   8
#define DMA1_CCR4_PSIZE_WIDTH 2
#define DMA1_CCR4_PSIZE_MASK  (0x300u)
#define DMA1_CCR4_MINC (1u << 7)
#define DMA1_CCR4_PINC (1u << 6)
#define DMA1_CCR4_CIRC (1u << 5)
#define DMA1_CCR4_DIR (1u << 4)
#define DMA1_CCR4_TEIE (1u << 3)
#define DMA1_CCR4_HTIE (1u << 2)
#define DMA1_CCR4_TCIE (1u << 1)
#define DMA1_CCR4_EN (1u << 0)
#define DMA1_CNDTR4_NDT_LSB   0
#define DMA1_CNDTR4_NDT_WIDTH 16
#define DMA1_CNDTR4_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR4_PA_LSB   0
#define DMA1_CPAR4_PA_WIDTH 32
#define DMA1_CPAR4_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR4_MA_LSB   0
#define DMA1_CMAR4_MA_WIDTH 32
#define DMA1_CMAR4_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR5_MEM2MEM (1u << 14)
#define DMA1_CCR5_PL_LSB   12
#define DMA1_CCR5_PL_WIDTH 2
#define DMA1_CCR5_PL_MASK  (0x3000u)
#define DMA1_CCR5_MSIZE_LSB   10
#define DMA1_CCR5_MSIZE_WIDTH 2
#define DMA1_CCR5_MSIZE_MASK  (0xC00u)
#define DMA1_CCR5_PSIZE_LSB   8
#define DMA1_CCR5_PSIZE_WIDTH 2
#define DMA1_CCR5_PSIZE_MASK  (0x300u)
#define DMA1_CCR5_MINC (1u << 7)
#define DMA1_CCR5_PINC (1u << 6)
#define DMA1_CCR5_CIRC (1u << 5)
#define DMA1_CCR5_DIR (1u << 4)
#define DMA1_CCR5_TEIE (1u << 3)
#define DMA1_CCR5_HTIE (1u << 2)
#define DMA1_CCR5_TCIE (1u << 1)
#define DMA1_CCR5_EN (1u << 0)
#define DMA1_CNDTR5_NDT_LSB   0
#define DMA1_CNDTR5_NDT_WIDTH 16
#define DMA1_CNDTR5_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR5_PA_LSB   0
#define DMA1_CPAR5_PA_WIDTH 32
#define DMA1_CPAR5_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR5_MA_LSB   0
#define DMA1_CMAR5_MA_WIDTH 32
#define DMA1_CMAR5_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR6_MEM2MEM (1u << 14)
#define DMA1_CCR6_PL_LSB   12
#define DMA1_CCR6_PL_WIDTH 2
#define DMA1_CCR6_PL_MASK  (0x3000u)
#define DMA1_CCR6_MSIZE_LSB   10
#define DMA1_CCR6_MSIZE_WIDTH 2
#define DMA1_CCR6_MSIZE_MASK  (0xC00u)
#define DMA1_CCR6_PSIZE_LSB   8
#define DMA1_CCR6_PSIZE_WIDTH 2
#define DMA1_CCR6_PSIZE_MASK  (0x300u)
#define DMA1_CCR6_MINC (1u << 7)
#define DMA1_CCR6_PINC (1u << 6)
#define DMA1_CCR6_CIRC (1u << 5)
#define DMA1_CCR6_DIR (1u << 4)
#define DMA1_CCR6_TEIE (1u << 3)
#define DMA1_CCR6_HTIE (1u << 2)
#define DMA1_CCR6_TCIE (1u << 1)
#define DMA1_CCR6_EN (1u << 0)
#define DMA1_CNDTR6_NDT_LSB   0
#define DMA1_CNDTR6_NDT_WIDTH 16
#define DMA1_CNDTR6_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR6_PA_LSB   0
#define DMA1_CPAR6_PA_WIDTH 32
#define DMA1_CPAR6_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR6_MA_LSB   0
#define DMA1_CMAR6_MA_WIDTH 32
#define DMA1_CMAR6_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CCR7_MEM2MEM (1u << 14)
#define DMA1_CCR7_PL_LSB   12
#define DMA1_CCR7_PL_WIDTH 2
#define DMA1_CCR7_PL_MASK  (0x3000u)
#define DMA1_CCR7_MSIZE_LSB   10
#define DMA1_CCR7_MSIZE_WIDTH 2
#define DMA1_CCR7_MSIZE_MASK  (0xC00u)
#define DMA1_CCR7_PSIZE_LSB   8
#define DMA1_CCR7_PSIZE_WIDTH 2
#define DMA1_CCR7_PSIZE_MASK  (0x300u)
#define DMA1_CCR7_MINC (1u << 7)
#define DMA1_CCR7_PINC (1u << 6)
#define DMA1_CCR7_CIRC (1u << 5)
#define DMA1_CCR7_DIR (1u << 4)
#define DMA1_CCR7_TEIE (1u << 3)
#define DMA1_CCR7_HTIE (1u << 2)
#define DMA1_CCR7_TCIE (1u << 1)
#define DMA1_CCR7_EN (1u << 0)
#define DMA1_CNDTR7_NDT_LSB   0
#define DMA1_CNDTR7_NDT_WIDTH 16
#define DMA1_CNDTR7_NDT_MASK  (0xFFFFu)
#define DMA1_CPAR7_PA_LSB   0
#define DMA1_CPAR7_PA_WIDTH 32
#define DMA1_CPAR7_PA_MASK  (0xFFFFFFFFu)
#define DMA1_CMAR7_MA_LSB   0
#define DMA1_CMAR7_MA_WIDTH 32
#define DMA1_CMAR7_MA_MASK  (0xFFFFFFFFu)
#define DMA1_CSELR_C7S_LSB   24
#define DMA1_CSELR_C7S_WIDTH 4
#define DMA1_CSELR_C7S_MASK  (0xF000000u)
#define DMA1_CSELR_C6S_LSB   20
#define DMA1_CSELR_C6S_WIDTH 4
#define DMA1_CSELR_C6S_MASK  (0xF00000u)
#define DMA1_CSELR_C5S_LSB   16
#define DMA1_CSELR_C5S_WIDTH 4
#define DMA1_CSELR_C5S_MASK  (0xF0000u)
#define DMA1_CSELR_C4S_LSB   12
#define DMA1_CSELR_C4S_WIDTH 4
#define DMA1_CSELR_C4S_MASK  (0xF000u)
#define DMA1_CSELR_C3S_LSB   8
#define DMA1_CSELR_C3S_WIDTH 4
#define DMA1_CSELR_C3S_MASK  (0xF00u)
#define DMA1_CSELR_C2S_LSB   4
#define DMA1_CSELR_C2S_WIDTH 4
#define DMA1_CSELR_C2S_MASK  (0xF0u)
#define DMA1_CSELR_C1S_LSB   0
#define DMA1_CSELR_C1S_WIDTH 4
#define DMA1_CSELR_C1S_MASK  (0xFu)

/* === CRC ================================= */
typedef struct {
    volatile uint32_t DR; /* 0x000 */
    volatile uint32_t IDR; /* 0x004 */
    volatile uint32_t CR; /* 0x008 */
    uint8_t _res_000C[4];
    volatile uint32_t INIT; /* 0x010 */
    volatile uint32_t POL; /* 0x014 */
} CRC_Type;

#define CRC_BASE 0x40023000u
#define CRC ((volatile CRC_Type*)CRC_BASE)

#define CRC_DR_DR_LSB   0
#define CRC_DR_DR_WIDTH 32
#define CRC_DR_DR_MASK  (0xFFFFFFFFu)
#define CRC_IDR_IDR_LSB   0
#define CRC_IDR_IDR_WIDTH 8
#define CRC_IDR_IDR_MASK  (0xFFu)
#define CRC_CR_REV_OUT (1u << 7)
#define CRC_CR_REV_IN_LSB   5
#define CRC_CR_REV_IN_WIDTH 2
#define CRC_CR_REV_IN_MASK  (0x60u)
#define CRC_CR_POLYSIZE_LSB   3
#define CRC_CR_POLYSIZE_WIDTH 2
#define CRC_CR_POLYSIZE_MASK  (0x18u)
#define CRC_CR_RESET (1u << 0)
#define CRC_INIT_CRC_INIT_LSB   0
#define CRC_INIT_CRC_INIT_WIDTH 32
#define CRC_INIT_CRC_INIT_MASK  (0xFFFFFFFFu)
#define CRC_POL_POLYNOMIALCOEFFICIENTS_LSB   0
#define CRC_POL_POLYNOMIALCOEFFICIENTS_WIDTH 32
#define CRC_POL_POLYNOMIALCOEFFICIENTS_MASK  (0xFFFFFFFFu)

/* === GPIOA ================================= */
typedef struct {
    volatile uint32_t MODER; /* 0x000 */
    volatile uint32_t OTYPER; /* 0x004 */
    volatile uint32_t OSPEEDR; /* 0x008 */
    volatile uint32_t PUPDR; /* 0x00C */
    volatile uint32_t IDR; /* 0x010 */
    volatile uint32_t ODR; /* 0x014 */
    volatile uint32_t BSRR; /* 0x018 */
    volatile uint32_t LCKR; /* 0x01C */
    volatile uint32_t AFRL; /* 0x020 */
    volatile uint32_t AFRH; /* 0x024 */
    volatile uint32_t BRR; /* 0x028 */
} GPIOA_Type;

#define GPIOA_BASE 0x50000000u
#define GPIOA ((volatile GPIOA_Type*)GPIOA_BASE)

