Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
/* === GPIOC ================================= */
typedef struct {
    volatile uint32_t MODER; /* 0x000 */
    volatile uint32_t OTYPER; /* 0x004 */
    volatile uint32_t OSPEEDR; /* 0x008 */
    volatile uint32_t PUPDR; /* 0x00C */
    volatile uint32_t IDR; /* 0x010 */
    volatile uint32_t ODR; /* 0x014 */
    volatile uint32_t BSRR; /* 0x018 */
    volatile uint32_t LCKR; /* 0x01C */
    volatile uint32_t AFRL; /* 0x020 */
    volatile uint32_t AFRH; /* 0x024 */
    volatile uint32_t BRR; /* 0x028 */
} GPIOC_Type;

#define GPIOC_BASE 0x50000800u
#define GPIOC ((volatile GPIOC_Type*)GPIOC_BASE)

#define GPIOC_MODER_MODE15_LSB   30
#define GPIOC_MODER_MODE15_WIDTH 2
#define GPIOC_MODER_MODE15_MASK  (0xC0000000u)
#define GPIOC_MODER_MODE14_LSB   28
#define GPIOC_MODER_MODE14_WIDTH 2
#define GPIOC_MODER_MODE14_MASK  (0x30000000u)
#define GPIOC_MODER_MODE13_LSB   26
#define GPIOC_MODER_MODE13_WIDTH 2
#define GPIOC_MODER_MODE13_MASK  (0xC000000u)
#define GPIOC_MODER_MODE12_LSB   24
#define GPIOC_MODER_MODE12_WIDTH 2
#define GPIOC_MODER_MODE12_MASK  (0x3000000u)
#define GPIOC_MODER_MODE11_LSB   22
#define GPIOC_MODER_MODE11_WIDTH 2
#define GPIOC_MODER_MODE11_MASK  (0xC00000u)
#define GPIOC_MODER_MODE10_LSB   20
#define GPIOC_MODER_MODE10_WIDTH 2
#define GPIOC_MODER_MODE10_MASK  (0x300000u)
#define GPIOC_MODER_MODE9_LSB   18
#define GPIOC_MODER_MODE9_WIDTH 2
#define GPIOC_MODER_MODE9_MASK  (0xC0000u)
#define GPIOC_MODER_MODE8_LSB   16
#define GPIOC_MODER_MODE8_WIDTH 2
#define GPIOC_MODER_MODE8_MASK  (0x30000u)
#define GPIOC_MODER_MODE7_LSB   14
#define GPIOC_MODER_MODE7_WIDTH 2
#define GPIOC_MODER_MODE7_MASK  (0xC000u)
#define GPIOC_MODER_MODE6_LSB   12
#define GPIOC_MODER_MODE6_WIDTH 2
#define GPIOC_MODER_MODE6_MASK  (0x3000u)
#define GPIOC_MODER_MODE5_LSB   10
#define GPIOC_MODER_MODE5_WIDTH 2
#define GPIOC_MODER_MODE5_MASK  (0xC00u)
#define GPIOC_MODER_MODE4_LSB   8
#define GPIOC_MODER_MODE4_WIDTH 2
#define GPIOC_MODER_MODE4_MASK  (0x300u)
#define GPIOC_MODER_MODE3_LSB   6
#define GPIOC_MODER_MODE3_WIDTH 2
#define GPIOC_MODER_MODE3_MASK  (0xC0u)
#define GPIOC_MODER_MODE2_LSB   4
#define GPIOC_MODER_MODE2_WIDTH 2
#define GPIOC_MODER_MODE2_MASK  (0x30u)
#define GPIOC_MODER_MODE1_LSB   2
#define GPIOC_MODER_MODE1_WIDTH 2
#define GPIOC_MODER_MODE1_MASK  (0xCu)
#define GPIOC_MODER_MODE0_LSB   0
#define GPIOC_MODER_MODE0_WIDTH 2
#define GPIOC_MODER_MODE0_MASK  (0x3u)
#define GPIOC_OTYPER_OT15 (1u << 15)
#define GPIOC_OTYPER_OT14 (1u << 14)
#define GPIOC_OTYPER_OT13 (1u << 13)
#define GPIOC_OTYPER_OT12 (1u << 12)
#define GPIOC_OTYPER_OT11 (1u << 11)
#define GPIOC_OTYPER_OT10 (1u << 10)
#define GPIOC_OTYPER_OT9 (1u << 9)
#define GPIOC_OTYPER_OT8 (1u << 8)
#define GPIOC_OTYPER_OT7 (1u << 7)
#define GPIOC_OTYPER_OT6 (1u << 6)
#define GPIOC_OTYPER_OT5 (1u << 5)
#define GPIOC_OTYPER_OT4 (1u << 4)
#define GPIOC_OTYPER_OT3 (1u << 3)
#define GPIOC_OTYPER_OT2 (1u << 2)
#define GPIOC_OTYPER_OT1 (1u << 1)
#define GPIOC_OTYPER_OT0 (1u << 0)
#define GPIOC_OSPEEDR_OSPEED15_LSB   30
#define GPIOC_OSPEEDR_OSPEED15_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED15_MASK  (0xC0000000u)
#define GPIOC_OSPEEDR_OSPEED14_LSB   28
#define GPIOC_OSPEEDR_OSPEED14_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED14_MASK  (0x30000000u)
#define GPIOC_OSPEEDR_OSPEED13_LSB   26
#define GPIOC_OSPEEDR_OSPEED13_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED13_MASK  (0xC000000u)
#define GPIOC_OSPEEDR_OSPEED12_LSB   24
#define GPIOC_OSPEEDR_OSPEED12_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED12_MASK  (0x3000000u)
#define GPIOC_OSPEEDR_OSPEED11_LSB   22
#define GPIOC_OSPEEDR_OSPEED11_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED11_MASK  (0xC00000u)
#define GPIOC_OSPEEDR_OSPEED10_LSB   20
#define GPIOC_OSPEEDR_OSPEED10_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED10_MASK  (0x300000u)
#define GPIOC_OSPEEDR_OSPEED9_LSB   18
#define GPIOC_OSPEEDR_OSPEED9_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED9_MASK  (0xC0000u)
#define GPIOC_OSPEEDR_OSPEED8_LSB   16
#define GPIOC_OSPEEDR_OSPEED8_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED8_MASK  (0x30000u)
#define GPIOC_OSPEEDR_OSPEED7_LSB   14
#define GPIOC_OSPEEDR_OSPEED7_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED7_MASK  (0xC000u)
#define GPIOC_OSPEEDR_OSPEED6_LSB   12
#define GPIOC_OSPEEDR_OSPEED6_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED6_MASK  (0x3000u)
#define GPIOC_OSPEEDR_OSPEED5_LSB   10
#define GPIOC_OSPEEDR_OSPEED5_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED5_MASK  (0xC00u)
#define GPIOC_OSPEEDR_OSPEED4_LSB   8
#define GPIOC_OSPEEDR_OSPEED4_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED4_MASK  (0x300u)
#define GPIOC_OSPEEDR_OSPEED3_LSB   6
#define GPIOC_OSPEEDR_OSPEED3_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED3_MASK  (0xC0u)
#define GPIOC_OSPEEDR_OSPEED2_LSB   4
#define GPIOC_OSPEEDR_OSPEED2_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED2_MASK  (0x30u)
#define GPIOC_OSPEEDR_OSPEED1_LSB   2
#define GPIOC_OSPEEDR_OSPEED1_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED1_MASK  (0xCu)
#define GPIOC_OSPEEDR_OSPEED0_LSB   0
#define GPIOC_OSPEEDR_OSPEED0_WIDTH 2
#define GPIOC_OSPEEDR_OSPEED0_MASK  (0x3u)
#define GPIOC_PUPDR_PUPD15_LSB   30
#define GPIOC_PUPDR_PUPD15_WIDTH 2
#define GPIOC_PUPDR_PUPD15_MASK  (0xC0000000u)
#define GPIOC_PUPDR_PUPD14_LSB   28
#define GPIOC_PUPDR_PUPD14_WIDTH 2
#define GPIOC_PUPDR_PUPD14_MASK  (0x30000000u)
#define GPIOC_PUPDR_PUPD13_LSB   26
#define GPIOC_PUPDR_PUPD13_WIDTH 2
#define GPIOC_PUPDR_PUPD13_MASK  (0xC000000u)
#define GPIOC_PUPDR_PUPD12_LSB   24
#define GPIOC_PUPDR_PUPD12_WIDTH 2
#define GPIOC_PUPDR_PUPD12_MASK  (0x3000000u)
#define GPIOC_PUPDR_PUPD11_LSB   22
#define GPIOC_PUPDR_PUPD11_WIDTH 2
#define GPIOC_PUPDR_PUPD11_MASK  (0xC00000u)
#define GPIOC_PUPDR_PUPD10_LSB   20
#define GPIOC_PUPDR_PUPD10_WIDTH 2
#define GPIOC_PUPDR_PUPD10_MASK  (0x300000u)
#define GPIOC_PUPDR_PUPD9_LSB   18
#define GPIOC_PUPDR_PUPD9_WIDTH 2
#define GPIOC_PUPDR_PUPD9_MASK  (0xC0000u)
#define GPIOC_PUPDR_PUPD8_LSB   16
#define GPIOC_PUPDR_PUPD8_WIDTH 2
#define GPIOC_PUPDR_PUPD8_MASK  (0x30000u)
#define GPIOC_PUPDR_PUPD7_LSB   14
#define GPIOC_PUPDR_PUPD7_WIDTH 2
#define GPIOC_PUPDR_PUPD7_MASK  (0xC000u)
#define GPIOC_PUPDR_PUPD6_LSB   12
#define GPIOC_PUPDR_PUPD6_WIDTH 2
#define GPIOC_PUPDR_PUPD6_MASK  (0x3000u)
#define GPIOC_PUPDR_PUPD5_LSB   10
#define GPIOC_PUPDR_PUPD5_WIDTH 2
#define GPIOC_PUPDR_PUPD5_MASK  (0xC00u)
#define GPIOC_PUPDR_PUPD4_LSB   8
#define GPIOC_PUPDR_PUPD4_WIDTH 2
#define GPIOC_PUPDR_PUPD4_MASK  (0x300u)
#define GPIOC_PUPDR_PUPD3_LSB   6
#define GPIOC_PUPDR_PUPD3_WIDTH 2
#define GPIOC_PUPDR_PUPD3_MASK  (0xC0u)
#define GPIOC_PUPDR_PUPD2_LSB   4
#define GPIOC_PUPDR_PUPD2_WIDTH 2
#define GPIOC_PUPDR_PUPD2_MASK  (0x30u)
#define GPIOC_PUPDR_PUPD1_LSB   2
#define GPIOC_PUPDR_PUPD1_WIDTH 2
#define GPIOC_PUPDR_PUPD1_MASK  (0xCu)
#define GPIOC_PUPDR_PUPD0_LSB   0
#define GPIOC_PUPDR_PUPD0_WIDTH 2
#define GPIOC_PUPDR_PUPD0_MASK  (0x3u)
#define GPIOC_IDR_ID15 (1u << 15)
#define GPIOC_IDR_ID14 (1u << 14)
#define GPIOC_IDR_ID13 (1u << 13)
#define GPIOC_IDR_ID12 (1u << 12)
#define GPIOC_IDR_ID11 (1u << 11)
#define GPIOC_IDR_ID10 (1u << 10)
#define GPIOC_IDR_ID9 (1u << 9)
#define GPIOC_IDR_ID8 (1u << 8)
#define GPIOC_IDR_ID7 (1u << 7)
#define GPIOC_IDR_ID6 (1u << 6)
#define GPIOC_IDR_ID5 (1u << 5)
#define GPIOC_IDR_ID4 (1u << 4)
#define GPIOC_IDR_ID3 (1u << 3)
#define GPIOC_IDR_ID2 (1u << 2)
#define GPIOC_IDR_ID1 (1u << 1)
#define GPIOC_IDR_ID0 (1u << 0)
#define GPIOC_ODR_OD15 (1u << 15)
#define GPIOC_ODR_OD14 (1u << 14)
#define GPIOC_ODR_OD13 (1u << 13)
#define GPIOC_ODR_OD12 (1u << 12)
#define GPIOC_ODR_OD11 (1u << 11)
#define GPIOC_ODR_OD10 (1u << 10)
#define GPIOC_ODR_OD9 (1u << 9)
#define GPIOC_ODR_OD8 (1u << 8)
#define GPIOC_ODR_OD7 (1u << 7)
#define GPIOC_ODR_OD6 (1u << 6)
#define GPIOC_ODR_OD5 (1u << 5)
#define GPIOC_ODR_OD4 (1u << 4)
#define GPIOC_ODR_OD3 (1u << 3)
#define GPIOC_ODR_OD2 (1u << 2)
#define GPIOC_ODR_OD1 (1u << 1)
#define GPIOC_ODR_OD0 (1u << 0)
#define GPIOC_BSRR_BR15 (1u << 31)
#define GPIOC_BSRR_BR14 (1u << 30)
#define GPIOC_BSRR_BR13 (1u << 29)
#define GPIOC_BSRR_BR12 (1u << 28)
#define GPIOC_BSRR_BR11 (1u << 27)
#define GPIOC_BSRR_BR10 (1u << 26)
#define GPIOC_BSRR_BR9 (1u << 25)
#define GPIOC_BSRR_BR8 (1u << 24)
#define GPIOC_BSRR_BR7 (1u << 23)
#define GPIOC_BSRR_BR6 (1u << 22)
#define GPIOC_BSRR_BR5 (1u << 21)
#define GPIOC_BSRR_BR4 (1u << 20)
#define GPIOC_BSRR_BR3 (1u << 19)
#define GPIOC_BSRR_BR2 (1u << 18)
#define GPIOC_BSRR_BR1 (1u << 17)
#define GPIOC_BSRR_BR0 (1u << 16)
#define GPIOC_BSRR_BS15 (1u << 15)
#define GPIOC_BSRR_BS14 (1u << 14)
#define GPIOC_BSRR_BS13 (1u << 13)
#define GPIOC_BSRR_BS12 (1u << 12)
#define GPIOC_BSRR_BS11 (1u << 11)
#define GPIOC_BSRR_BS10 (1u << 10)
#define GPIOC_BSRR_BS9 (1u << 9)
#define GPIOC_BSRR_BS8 (1u << 8)
#define GPIOC_BSRR_BS7 (1u << 7)
#define GPIOC_BSRR_BS6 (1u << 6)
#define GPIOC_BSRR_BS5 (1u << 5)
#define GPIOC_BSRR_BS4 (1u << 4)
#define GPIOC_BSRR_BS3 (1u << 3)
#define GPIOC_BSRR_BS2 (1u << 2)
#define GPIOC_BSRR_BS1 (1u << 1)
#define GPIOC_BSRR_BS0 (1u << 0)
#define GPIOC_LCKR_LCKK (1u << 16)
#define GPIOC_LCKR_LCK15 (1u << 15)
#define GPIOC_LCKR_LCK14 (1u << 14)
#define GPIOC_LCKR_LCK13 (1u << 13)
#define GPIOC_LCKR_LCK12 (1u << 12)
#define GPIOC_LCKR_LCK11 (1u << 11)
#define GPIOC_LCKR_LCK10 (1u << 10)
#define GPIOC_LCKR_LCK9 (1u << 9)
#define GPIOC_LCKR_LCK8 (1u << 8)
#define GPIOC_LCKR_LCK7 (1u << 7)
#define GPIOC_LCKR_LCK6 (1u << 6)
#define GPIOC_LCKR_LCK5 (1u << 5)
#define GPIOC_LCKR_LCK4 (1u << 4)
#define GPIOC_LCKR_LCK3 (1u << 3)
#define GPIOC_LCKR_LCK2 (1u << 2)
#define GPIOC_LCKR_LCK1 (1u << 1)
#define GPIOC_LCKR_LCK0 (1u << 0)
#define GPIOC_AFRL_AFSEL7_LSB   28
#define GPIOC_AFRL_AFSEL7_WIDTH 4
#define GPIOC_AFRL_AFSEL7_MASK  (0xF0000000u)
#define GPIOC_AFRL_AFSEL6_LSB   24
#define GPIOC_AFRL_AFSEL6_WIDTH 4
#define GPIOC_AFRL_AFSEL6_MASK  (0xF000000u)
#define GPIOC_AFRL_AFSEL5_LSB   20
#define GPIOC_AFRL_AFSEL5_WIDTH 4
#define GPIOC_AFRL_AFSEL5_MASK  (0xF00000u)
#define GPIOC_AFRL_AFSEL4_LSB   16
#define GPIOC_AFRL_AFSEL4_WIDTH 4
#define GPIOC_AFRL_AFSEL4_MASK  (0xF0000u)
#define GPIOC_AFRL_AFSEL3_LSB   12
#define GPIOC_AFRL_AFSEL3_WIDTH 4
#define GPIOC_AFRL_AFSEL3_MASK  (0xF000u)
#define GPIOC_AFRL_AFSEL2_LSB   8
#define GPIOC_AFRL_AFSEL2_WIDTH 4
#define GPIOC_AFRL_AFSEL2_MASK  (0xF00u)
#define GPIOC_AFRL_AFSEL1_LSB   4
#define GPIOC_AFRL_AFSEL1_WIDTH 4
#define GPIOC_AFRL_AFSEL1_MASK  (0xF0u)
#define GPIOC_AFRL_AFSEL0_LSB   0
#define GPIOC_AFRL_AFSEL0_WIDTH 4
#define GPIOC_AFRL_AFSEL0_MASK  (0xFu)
#define GPIOC_AFRH_AFSEL15_LSB   28
#define GPIOC_AFRH_AFSEL15_WIDTH 4
#define GPIOC_AFRH_AFSEL15_MASK  (0xF0000000u)
#define GPIOC_AFRH_AFSEL14_LSB   24
#define GPIOC_AFRH_AFSEL14_WIDTH 4
#define GPIOC_AFRH_AFSEL14_MASK  (0xF000000u)
#define GPIOC_AFRH_AFSEL13_LSB   20
#define GPIOC_AFRH_AFSEL13_WIDTH 4
#define GPIOC_AFRH_AFSEL13_MASK  (0xF00000u)
#define GPIOC_AFRH_AFSEL12_LSB   16
#define GPIOC_AFRH_AFSEL12_WIDTH 4
#define GPIOC_AFRH_AFSEL12_MASK  (0xF0000u)
#define GPIOC_AFRH_AFSEL11_LSB   12
#define GPIOC_AFRH_AFSEL11_WIDTH 4
#define GPIOC_AFRH_AFSEL11_MASK  (0xF000u)
#define GPIOC_AFRH_AFSEL10_LSB   8
#define GPIOC_AFRH_AFSEL10_WIDTH 4
#define GPIOC_AFRH_AFSEL10_MASK  (0xF00u)
#define GPIOC_AFRH_AFSEL9_LSB   4
#define GPIOC_AFRH_AFSEL9_WIDTH 4
#define GPIOC_AFRH_AFSEL9_MASK  (0xF0u)
#define GPIOC_AFRH_AFSEL8_LSB   0
#define GPIOC_AFRH_AFSEL8_WIDTH 4
#define GPIOC_AFRH_AFSEL8_MASK  (0xFu)
#define GPIOC_BRR_BR15 (1u << 15)
#define GPIOC_BRR_BR14 (1u << 14)
#define GPIOC_BRR_BR13 (1u << 13)
#define GPIOC_BRR_BR12 (1u << 12)
#define GPIOC_BRR_BR11 (1u << 11)
#define GPIOC_BRR_BR10 (1u << 10)
#define GPIOC_BRR_BR9 (1u << 9)
#define GPIOC_BRR_BR8 (1u << 8)
#define GPIOC_BRR_BR7 (1u << 7)
#define GPIOC_BRR_BR6 (1u << 6)
#define GPIOC_BRR_BR5 (1u << 5)
#define GPIOC_BRR_BR4 (1u << 4)
#define GPIOC_BRR_BR3 (1u << 3)
#define GPIOC_BRR_BR2 (1u << 2)
#define GPIOC_BRR_BR1 (1u << 1)
#define GPIOC_BRR_BR0 (1u << 0)

/* === GPIOD ================================= */
typedef struct {
    volatile uint32_t MODER; /* 0x000 */
    volatile uint32_t OTYPER; /* 0x004 */
    volatile uint32_t OSPEEDR; /* 0x008 */
    volatile uint32_t PUPDR; /* 0x00C */
    volatile uint32_t IDR; /* 0x010 */
    volatile uint32_t ODR; /* 0x014 */
    volatile uint32_t BSRR; /* 0x018 */
    volatile uint32_t LCKR; /* 0x01C */
    volatile uint32_t AFRL; /* 0x020 */
    volatile uint32_t AFRH; /* 0x024 */
    volatile uint32_t BRR; /* 0x028 */
} GPIOD_Type;

#define GPIOD_BASE 0x50000C00u
#define GPIOD ((volatile GPIOD_Type*)GPIOD_BASE)

