Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define LPTIM_ISR_DOWN (1u << 6)
#define LPTIM_ISR_UP (1u << 5)
#define LPTIM_ISR_ARROK (1u << 4)
#define LPTIM_ISR_CMPOK (1u << 3)
#define LPTIM_ISR_EXTTRIG (1u << 2)
#define LPTIM_ISR_ARRM (1u << 1)
#define LPTIM_ISR_CMPM (1u << 0)
#define LPTIM_ICR_DOWNCF (1u << 6)
#define LPTIM_ICR_UPCF (1u << 5)
#define LPTIM_ICR_ARROKCF (1u << 4)
#define LPTIM_ICR_CMPOKCF (1u << 3)
#define LPTIM_ICR_EXTTRIGCF (1u << 2)
#define LPTIM_ICR_ARRMCF (1u << 1)
#define LPTIM_ICR_CMPMCF (1u << 0)
#define LPTIM_IER_DOWNIE (1u << 6)
#define LPTIM_IER_UPIE (1u << 5)
#define LPTIM_IER_ARROKIE (1u << 4)
#define LPTIM_IER_CMPOKIE (1u << 3)
#define LPTIM_IER_EXTTRIGIE (1u << 2)
#define LPTIM_IER_ARRMIE (1u << 1)
#define LPTIM_IER_CMPMIE (1u << 0)
#define LPTIM_CFGR_ENC (1u << 24)
#define LPTIM_CFGR_COUNTMODE (1u << 23)
#define LPTIM_CFGR_PRELOAD (1u << 22)
#define LPTIM_CFGR_WAVPOL (1u << 21)
#define LPTIM_CFGR_WAVE (1u << 20)
#define LPTIM_CFGR_TIMOUT (1u << 19)
#define LPTIM_CFGR_TRIGEN_LSB   17
#define LPTIM_CFGR_TRIGEN_WIDTH 2
#define LPTIM_CFGR_TRIGEN_MASK  (0x60000u)
#define LPTIM_CFGR_TRIGSEL_LSB   13
#define LPTIM_CFGR_TRIGSEL_WIDTH 3
#define LPTIM_CFGR_TRIGSEL_MASK  (0xE000u)
#define LPTIM_CFGR_PRESC_LSB   9
#define LPTIM_CFGR_PRESC_WIDTH 3
#define LPTIM_CFGR_PRESC_MASK  (0xE00u)
#define LPTIM_CFGR_TRGFLT_LSB   6
#define LPTIM_CFGR_TRGFLT_WIDTH 2
#define LPTIM_CFGR_TRGFLT_MASK  (0xC0u)
#define LPTIM_CFGR_CKFLT_LSB   3
#define LPTIM_CFGR_CKFLT_WIDTH 2
#define LPTIM_CFGR_CKFLT_MASK  (0x18u)
#define LPTIM_CFGR_CKPOL_LSB   1
#define LPTIM_CFGR_CKPOL_WIDTH 2
#define LPTIM_CFGR_CKPOL_MASK  (0x6u)
#define LPTIM_CFGR_CKSEL (1u << 0)
#define LPTIM_CR_CNTSTRT (1u << 2)
#define LPTIM_CR_SNGSTRT (1u << 1)
#define LPTIM_CR_ENABLE (1u << 0)
#define LPTIM_CMP_CMP_LSB   0
#define LPTIM_CMP_CMP_WIDTH 16
#define LPTIM_CMP_CMP_MASK  (0xFFFFu)
#define LPTIM_ARR_ARR_LSB   0
#define LPTIM_ARR_ARR_WIDTH 16
#define LPTIM_ARR_ARR_MASK  (0xFFFFu)
#define LPTIM_CNT_CNT_LSB   0
#define LPTIM_CNT_CNT_WIDTH 16
#define LPTIM_CNT_CNT_MASK  (0xFFFFu)

/* === RTC ================================= */
typedef struct {
    volatile uint32_t TR; /* 0x000 */
    volatile uint32_t DR; /* 0x004 */
    volatile uint32_t CR; /* 0x008 */
    volatile uint32_t ISR; /* 0x00C */
    volatile uint32_t PRER; /* 0x010 */
    volatile uint32_t WUTR; /* 0x014 */
    uint8_t _res_0018[4];
    volatile uint32_t ALRMAR; /* 0x01C */
    volatile uint32_t ALRMBR; /* 0x020 */
    volatile uint32_t WPR; /* 0x024 */
    volatile uint32_t SSR; /* 0x028 */
    volatile uint32_t SHIFTR; /* 0x02C */
    volatile uint32_t TSTR; /* 0x030 */
    volatile uint32_t TSDR; /* 0x034 */
    volatile uint32_t TSSSR; /* 0x038 */
    volatile uint32_t CALR; /* 0x03C */
    volatile uint32_t TAMPCR; /* 0x040 */
    volatile uint32_t ALRMASSR; /* 0x044 */
    volatile uint32_t ALRMBSSR; /* 0x048 */
    volatile uint32_t OR; /* 0x04C */
    volatile uint32_t BKP0R; /* 0x050 */
    volatile uint32_t BKP1R; /* 0x054 */
    volatile uint32_t BKP2R; /* 0x058 */
    volatile uint32_t BKP3R; /* 0x05C */
    volatile uint32_t BKP4R; /* 0x060 */
} RTC_Type;

#define RTC_BASE 0x40002800u
#define RTC ((volatile RTC_Type*)RTC_BASE)

#define RTC_TR_PM (1u << 22)
#define RTC_TR_HT_LSB   20
#define RTC_TR_HT_WIDTH 2
#define RTC_TR_HT_MASK  (0x300000u)
#define RTC_TR_HU_LSB   16
#define RTC_TR_HU_WIDTH 4
#define RTC_TR_HU_MASK  (0xF0000u)
#define RTC_TR_MNT_LSB   12
#define RTC_TR_MNT_WIDTH 3
#define RTC_TR_MNT_MASK  (0x7000u)
#define RTC_TR_MNU_LSB   8
#define RTC_TR_MNU_WIDTH 4
#define RTC_TR_MNU_MASK  (0xF00u)
#define RTC_TR_ST_LSB   4
#define RTC_TR_ST_WIDTH 3
#define RTC_TR_ST_MASK  (0x70u)
#define RTC_TR_SU_LSB   0
#define RTC_TR_SU_WIDTH 4
#define RTC_TR_SU_MASK  (0xFu)
#define RTC_DR_YT_LSB   20
#define RTC_DR_YT_WIDTH 4
#define RTC_DR_YT_MASK  (0xF00000u)
#define RTC_DR_YU_LSB   16
#define RTC_DR_YU_WIDTH 4
#define RTC_DR_YU_MASK  (0xF0000u)
#define RTC_DR_WDU_LSB   13
#define RTC_DR_WDU_WIDTH 3
#define RTC_DR_WDU_MASK  (0xE000u)
#define RTC_DR_MT (1u << 12)
#define RTC_DR_MU_LSB   8
#define RTC_DR_MU_WIDTH 4
#define RTC_DR_MU_MASK  (0xF00u)
#define RTC_DR_DT_LSB   4
#define RTC_DR_DT_WIDTH 2
#define RTC_DR_DT_MASK  (0x30u)
#define RTC_DR_DU_LSB   0
#define RTC_DR_DU_WIDTH 4
#define RTC_DR_DU_MASK  (0xFu)
#define RTC_CR_COE (1u << 23)
#define RTC_CR_OSEL_LSB   21
#define RTC_CR_OSEL_WIDTH 2
#define RTC_CR_OSEL_MASK  (0x600000u)
#define RTC_CR_POL (1u << 20)
#define RTC_CR_COSEL (1u << 19)
#define RTC_CR_BKP (1u << 18)
#define RTC_CR_SUB1H (1u << 17)
#define RTC_CR_ADD1H (1u << 16)
#define RTC_CR_TSIE (1u << 15)
#define RTC_CR_WUTIE (1u << 14)
#define RTC_CR_ALRBIE (1u << 13)
#define RTC_CR_ALRAIE (1u << 12)
#define RTC_CR_TSE (1u << 11)
#define RTC_CR_WUTE (1u << 10)
#define RTC_CR_ALRBE (1u << 9)
#define RTC_CR_ALRAE (1u << 8)
#define RTC_CR_FMT (1u << 6)
#define RTC_CR_BYPSHAD (1u << 5)
#define RTC_CR_REFCKON (1u << 4)
#define RTC_CR_TSEDGE (1u << 3)
#define RTC_CR_WUCKSEL_LSB   0
#define RTC_CR_WUCKSEL_WIDTH 3
#define RTC_CR_WUCKSEL_MASK  (0x7u)
#define RTC_ISR_TAMP2F (1u << 14)
#define RTC_ISR_TAMP1F (1u << 13)
#define RTC_ISR_TSOVF (1u << 12)
#define RTC_ISR_TSF (1u << 11)
#define RTC_ISR_WUTF (1u << 10)
#define RTC_ISR_ALRBF (1u << 9)
#define RTC_ISR_ALRAF (1u << 8)
#define RTC_ISR_INIT (1u << 7)
#define RTC_ISR_INITF (1u << 6)
#define RTC_ISR_RSF (1u << 5)
#define RTC_ISR_INITS (1u << 4)
#define RTC_ISR_SHPF (1u << 3)
#define RTC_ISR_WUTWF (1u << 2)
#define RTC_ISR_ALRBWF (1u << 1)
#define RTC_ISR_ALRAWF (1u << 0)
#define RTC_PRER_PREDIV_A_LSB   16
#define RTC_PRER_PREDIV_A_WIDTH 7
#define RTC_PRER_PREDIV_A_MASK  (0x7F0000u)
#define RTC_PRER_PREDIV_S_LSB   0
#define RTC_PRER_PREDIV_S_WIDTH 16
#define RTC_PRER_PREDIV_S_MASK  (0xFFFFu)
#define RTC_WUTR_WUT_LSB   0
#define RTC_WUTR_WUT_WIDTH 16
#define RTC_WUTR_WUT_MASK  (0xFFFFu)
#define RTC_ALRMAR_MSK4 (1u << 31)
#define RTC_ALRMAR_WDSEL (1u << 30)
#define RTC_ALRMAR_DT_LSB   28
#define RTC_ALRMAR_DT_WIDTH 2
#define RTC_ALRMAR_DT_MASK  (0x30000000u)
#define RTC_ALRMAR_DU_LSB   24
#define RTC_ALRMAR_DU_WIDTH 4
#define RTC_ALRMAR_DU_MASK  (0xF000000u)
#define RTC_ALRMAR_MSK3 (1u << 23)
#define RTC_ALRMAR_PM (1u << 22)
#define RTC_ALRMAR_HT_LSB   20
#define RTC_ALRMAR_HT_WIDTH 2
#define RTC_ALRMAR_HT_MASK  (0x300000u)
#define RTC_ALRMAR_HU_LSB   16
#define RTC_ALRMAR_HU_WIDTH 4
#define RTC_ALRMAR_HU_MASK  (0xF0000u)
#define RTC_ALRMAR_MSK2 (1u << 15)
#define RTC_ALRMAR_MNT_LSB   12
#define RTC_ALRMAR_MNT_WIDTH 3
#define RTC_ALRMAR_MNT_MASK  (0x7000u)
#define RTC_ALRMAR_MNU_LSB   8
#define RTC_ALRMAR_MNU_WIDTH 4
#define RTC_ALRMAR_MNU_MASK  (0xF00u)
#define RTC_ALRMAR_MSK1 (1u << 7)
#define RTC_ALRMAR_ST_LSB   4
#define RTC_ALRMAR_ST_WIDTH 3
#define RTC_ALRMAR_ST_MASK  (0x70u)
#define RTC_ALRMAR_SU_LSB   0
#define RTC_ALRMAR_SU_WIDTH 4
#define RTC_ALRMAR_SU_MASK  (0xFu)
#define RTC_ALRMBR_MSK4 (1u << 31)
#define RTC_ALRMBR_WDSEL (1u << 30)
#define RTC_ALRMBR_DT_LSB   28
#define RTC_ALRMBR_DT_WIDTH 2
#define RTC_ALRMBR_DT_MASK  (0x30000000u)
#define RTC_ALRMBR_DU_LSB   24
#define RTC_ALRMBR_DU_WIDTH 4
#define RTC_ALRMBR_DU_MASK  (0xF000000u)
#define RTC_ALRMBR_MSK3 (1u << 23)
#define RTC_ALRMBR_PM (1u << 22)
#define RTC_ALRMBR_HT_LSB   20
#define RTC_ALRMBR_HT_WIDTH 2
#define RTC_ALRMBR_HT_MASK  (0x300000u)
#define RTC_ALRMBR_HU_LSB   16
#define RTC_ALRMBR_HU_WIDTH 4
#define RTC_ALRMBR_HU_MASK  (0xF0000u)
#define RTC_ALRMBR_MSK2 (1u << 15)
#define RTC_ALRMBR_MNT_LSB   12
#define RTC_ALRMBR_MNT_WIDTH 3
#define RTC_ALRMBR_MNT_MASK  (0x7000u)
#define RTC_ALRMBR_MNU_LSB   8
#define RTC_ALRMBR_MNU_WIDTH 4
#define RTC_ALRMBR_MNU_MASK  (0xF00u)
#define RTC_ALRMBR_MSK1 (1u << 7)
#define RTC_ALRMBR_ST_LSB   4
#define RTC_ALRMBR_ST_WIDTH 3
#define RTC_ALRMBR_ST_MASK  (0x70u)
#define RTC_ALRMBR_SU_LSB   0
#define RTC_ALRMBR_SU_WIDTH 4
#define RTC_ALRMBR_SU_MASK  (0xFu)
#define RTC_WPR_KEY_LSB   0
#define RTC_WPR_KEY_WIDTH 8
#define RTC_WPR_KEY_MASK  (0xFFu)
#define RTC_SSR_SS_LSB   0
#define RTC_SSR_SS_WIDTH 16
#define RTC_SSR_SS_MASK  (0xFFFFu)
#define RTC_SHIFTR_ADD1S (1u << 31)
#define RTC_SHIFTR_SUBFS_LSB   0
#define RTC_SHIFTR_SUBFS_WIDTH 15
#define RTC_SHIFTR_SUBFS_MASK  (0x7FFFu)
#define RTC_TSTR_PM (1u << 22)
#define RTC_TSTR_HT_LSB   20
#define RTC_TSTR_HT_WIDTH 2
#define RTC_TSTR_HT_MASK  (0x300000u)
#define RTC_TSTR_HU_LSB   16
#define RTC_TSTR_HU_WIDTH 4
#define RTC_TSTR_HU_MASK  (0xF0000u)
#define RTC_TSTR_MNT_LSB   12
#define RTC_TSTR_MNT_WIDTH 3
#define RTC_TSTR_MNT_MASK  (0x7000u)
#define RTC_TSTR_MNU_LSB   8
#define RTC_TSTR_MNU_WIDTH 4
#define RTC_TSTR_MNU_MASK  (0xF00u)
#define RTC_TSTR_ST_LSB   4
#define RTC_TSTR_ST_WIDTH 3
#define RTC_TSTR_ST_MASK  (0x70u)
#define RTC_TSTR_SU_LSB   0
#define RTC_TSTR_SU_WIDTH 4
#define RTC_TSTR_SU_MASK  (0xFu)
#define RTC_TSDR_WDU_LSB   13
#define RTC_TSDR_WDU_WIDTH 3
#define RTC_TSDR_WDU_MASK  (0xE000u)
#define RTC_TSDR_MT (1u << 12)
#define RTC_TSDR_MU_LSB   8
#define RTC_TSDR_MU_WIDTH 4
#define RTC_TSDR_MU_MASK  (0xF00u)
#define RTC_TSDR_DT_LSB   4
#define RTC_TSDR_DT_WIDTH 2
#define RTC_TSDR_DT_MASK  (0x30u)
#define RTC_TSDR_DU_LSB   0
#define RTC_TSDR_DU_WIDTH 4
#define RTC_TSDR_DU_MASK  (0xFu)
#define RTC_TSSSR_SS_LSB   0
#define RTC_TSSSR_SS_WIDTH 16
#define RTC_TSSSR_SS_MASK  (0xFFFFu)
#define RTC_CALR_CALP (1u << 15)
#define RTC_CALR_CALW8 (1u << 14)
#define RTC_CALR_CALW16 (1u << 13)
#define RTC_CALR_CALM_LSB   0
#define RTC_CALR_CALM_WIDTH 9
#define RTC_CALR_CALM_MASK  (0x1FFu)
#define RTC_TAMPCR_TAMP2MF (1u << 21)
#define RTC_TAMPCR_TAMP2NOERASE (1u << 20)
#define RTC_TAMPCR_TAMP2IE (1u << 19)
#define RTC_TAMPCR_TAMP1MF (1u << 18)
#define RTC_TAMPCR_TAMP1NOERASE (1u << 17)
#define RTC_TAMPCR_TAMP1IE (1u << 16)
#define RTC_TAMPCR_TAMPPUDIS (1u << 15)
#define RTC_TAMPCR_TAMPPRCH_LSB   13
#define RTC_TAMPCR_TAMPPRCH_WIDTH 2
#define RTC_TAMPCR_TAMPPRCH_MASK  (0x6000u)
#define RTC_TAMPCR_TAMPFLT_LSB   11
#define RTC_TAMPCR_TAMPFLT_WIDTH 2
#define RTC_TAMPCR_TAMPFLT_MASK  (0x1800u)
#define RTC_TAMPCR_TAMPFREQ_LSB   8
#define RTC_TAMPCR_TAMPFREQ_WIDTH 3
#define RTC_TAMPCR_TAMPFREQ_MASK  (0x700u)
#define RTC_TAMPCR_TAMPTS (1u << 7)
#define RTC_TAMPCR_TAMP2_TRG (1u << 4)
#define RTC_TAMPCR_TAMP2E (1u << 3)
#define RTC_TAMPCR_TAMPIE (1u << 2)
#define RTC_TAMPCR_TAMP1TRG (1u << 1)
#define RTC_TAMPCR_TAMP1E (1u << 0)
#define RTC_ALRMASSR_MASKSS_LSB   24
#define RTC_ALRMASSR_MASKSS_WIDTH 4
#define RTC_ALRMASSR_MASKSS_MASK  (0xF000000u)
#define RTC_ALRMASSR_SS_LSB   0
#define RTC_ALRMASSR_SS_WIDTH 15
#define RTC_ALRMASSR_SS_MASK  (0x7FFFu)
#define RTC_ALRMBSSR_MASKSS_LSB   24
#define RTC_ALRMBSSR_MASKSS_WIDTH 4
#define RTC_ALRMBSSR_MASKSS_MASK  (0xF000000u)
#define RTC_ALRMBSSR_SS_LSB   0
#define RTC_ALRMBSSR_SS_WIDTH 15
#define RTC_ALRMBSSR_SS_MASK  (0x7FFFu)
#define RTC_OR_RTC_OUT_RMP (1u << 1)
#define RTC_OR_RTC_ALARM_TYPE (1u << 0)
#define RTC_BKP0R_BKP_LSB   0
#define RTC_BKP0R_BKP_WIDTH 32
#define RTC_BKP0R_BKP_MASK  (0xFFFFFFFFu)
#define RTC_BKP1R_BKP_LSB   0
#define RTC_BKP1R_BKP_WIDTH 32
#define RTC_BKP1R_BKP_MASK  (0xFFFFFFFFu)
#define RTC_BKP2R_BKP_LSB   0
#define RTC_BKP2R_BKP_WIDTH 32
#define RTC_BKP2R_BKP_MASK  (0xFFFFFFFFu)
#define RTC_BKP3R_BKP_LSB   0
#define RTC_BKP3R_BKP_WIDTH 32
#define RTC_BKP3R_BKP_MASK  (0xFFFFFFFFu)
#define RTC_BKP4R_BKP_LSB   0
#define RTC_BKP4R_BKP_WIDTH 32
#define RTC_BKP4R_BKP_MASK  (0xFFFFFFFFu)

/* === USART1 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t CR3; /* 0x008 */
    volatile uint32_t BRR; /* 0x00C */
    volatile uint32_t GTPR; /* 0x010 */
    volatile uint32_t RTOR; /* 0x014 */
    volatile uint32_t RQR; /* 0x018 */
    volatile uint32_t ISR; /* 0x01C */
    volatile uint32_t ICR; /* 0x020 */
    volatile uint32_t RDR; /* 0x024 */
    volatile uint32_t TDR; /* 0x028 */
} USART1_Type;

#define USART1_BASE 0x40013800u
#define USART1 ((volatile USART1_Type*)USART1_BASE)

#define USART1_CR1_M1 (1u << 28)
#define USART1_CR1_EOBIE (1u << 27)
#define USART1_CR1_RTOIE (1u << 26)
#define USART1_CR1_DEAT4 (1u << 25)
#define USART1_CR1_DEAT3 (1u << 24)
#define USART1_CR1_DEAT2 (1u << 23)
#define USART1_CR1_DEAT1 (1u << 22)
#define USART1_CR1_DEAT0 (1u << 21)
#define USART1_CR1_DEDT4 (1u << 20)
#define USART1_CR1_DEDT3 (1u << 19)
#define USART1_CR1_DEDT2 (1u << 18)
#define USART1_CR1_DEDT1 (1u << 17)
#define USART1_CR1_DEDT0 (1u << 16)
#define USART1_CR1_OVER8 (1u << 15)
#define USART1_CR1_CMIE (1u << 14)
#define USART1_CR1_MME (1u << 13)
#define USART1_CR1_M0 (1u << 12)
#define USART1_CR1_WAKE (1u << 11)
#define USART1_CR1_PCE (1u << 10)
#define USART1_CR1_PS (1u << 9)
#define USART1_CR1_PEIE (1u << 8)
#define USART1_CR1_TXEIE (1u << 7)
#define USART1_CR1_TCIE (1u << 6)
#define USART1_CR1_RXNEIE (1u << 5)
#define USART1_CR1_IDLEIE (1u << 4)
#define USART1_CR1_TE (1u << 3)
#define USART1_CR1_RE (1u << 2)
#define USART1_CR1_UESM (1u << 1)
#define USART1_CR1_UE (1u << 0)
#define USART1_CR2_ADD4_7_LSB   28
#define USART1_CR2_ADD4_7_WIDTH 4
#define USART1_CR2_ADD4_7_MASK  (0xF0000000u)
#define USART1_CR2_ADD0_3_LSB   24
#define USART1_CR2_ADD0_3_WIDTH 4
#define USART1_CR2_ADD0_3_MASK  (0xF000000u)
#define USART1_CR2_RTOEN (1u << 23)
#define USART1_CR2_ABRMOD1 (1u << 22)
#define USART1_CR2_ABRMOD0 (1u << 21)
#define USART1_CR2_ABREN (1u << 20)
#define USART1_CR2_MSBFIRST (1u << 19)
#define USART1_CR2_TAINV (1u << 18)
#define USART1_CR2_TXINV (1u << 17)
#define USART1_CR2_RXINV (1u << 16)
#define USART1_CR2_SWAP (1u << 15)
#define USART1_CR2_LINEN (1u << 14)
#define USART1_CR2_STOP_LSB   12
#define USART1_CR2_STOP_WIDTH 2
#define USART1_CR2_STOP_MASK  (0x3000u)
#define USART1_CR2_CLKEN (1u << 11)
#define USART1_CR2_CPOL (1u << 10)
#define USART1_CR2_CPHA (1u << 9)
#define USART1_CR2_LBCL (1u << 8)
#define USART1_CR2_LBDIE (1u << 6)
#define USART1_CR2_LBDL (1u << 5)
#define USART1_CR2_ADDM7 (1u << 4)
#define USART1_CR3_WUFIE (1u << 22)
#define USART1_CR3_WUS_LSB   20
#define USART1_CR3_WUS_WIDTH 2
#define USART1_CR3_WUS_MASK  (0x300000u)
#define USART1_CR3_SCARCNT_LSB   17
#define USART1_CR3_SCARCNT_WIDTH 3
#define USART1_CR3_SCARCNT_MASK  (0xE0000u)
#define USART1_CR3_DEP (1u << 15)
#define USART1_CR3_DEM (1u << 14)
#define USART1_CR3_DDRE (1u << 13)
#define USART1_CR3_OVRDIS (1u << 12)
#define USART1_CR3_ONEBIT (1u << 11)
#define USART1_CR3_CTSIE (1u << 10)
#define USART1_CR3_CTSE (1u << 9)
#define USART1_CR3_RTSE (1u << 8)
#define USART1_CR3_DMAT (1u << 7)
#define USART1_CR3_DMAR (1u << 6)
#define USART1_CR3_SCEN (1u << 5)
#define USART1_CR3_NACK (1u << 4)
#define USART1_CR3_HDSEL (1u << 3)
#define USART1_CR3_IRLP (1u << 2)
#define USART1_CR3_IREN (1u << 1)
#define USART1_CR3_EIE (1u << 0)
#define USART1_BRR_DIV_MANTISSA_LSB   4
#define USART1_BRR_DIV_MANTISSA_WIDTH 12
#define USART1_BRR_DIV_MANTISSA_MASK  (0xFFF0u)
#define USART1_BRR_DIV_FRACTION_LSB   0
#define USART1_BRR_DIV_FRACTION_WIDTH 4
#define USART1_BRR_DIV_FRACTION_MASK  (0xFu)
#define USART1_GTPR_GT_LSB   8
#define USART1_GTPR_GT_WIDTH 8
#define USART1_GTPR_GT_MASK  (0xFF00u)
#define USART1_GTPR_PSC_LSB   0
#define USART1_GTPR_PSC_WIDTH 8
#define USART1_GTPR_PSC_MASK  (0xFFu)
#define USART1_RTOR_BLEN_LSB   24
#define USART1_RTOR_BLEN_WIDTH 8
#define USART1_RTOR_BLEN_MASK  (0xFF000000u)
#define USART1_RTOR_RTO_LSB   0
#define USART1_RTOR_RTO_WIDTH 24
#define USART1_RTOR_RTO_MASK  (0xFFFFFFu)
#define USART1_RQR_TXFRQ (1u << 4)
#define USART1_RQR_RXFRQ (1u << 3)
#define USART1_RQR_MMRQ (1u << 2)
#define USART1_RQR_SBKRQ (1u << 1)
#define USART1_RQR_ABRRQ (1u << 0)
#define USART1_ISR_REACK (1u << 22)
#define USART1_ISR_TEACK (1u << 21)
#define USART1_ISR_WUF (1u << 20)
#define USART1_ISR_RWU (1u << 19)
#define USART1_ISR_SBKF (1u << 18)
#define USART1_ISR_CMF (1u << 17)
#define USART1_ISR_BUSY (1u << 16)
#define USART1_ISR_ABRF (1u << 15)
#define USART1_ISR_ABRE (1u << 14)
#define USART1_ISR_EOBF (1u << 12)
#define USART1_ISR_RTOF (1u << 11)
#define USART1_ISR_CTS (1u << 10)
#define USART1_ISR_CTSIF (1u << 9)
#define USART1_ISR_LBDF (1u << 8)
#define USART1_ISR_TXE (1u << 7)
#define USART1_ISR_TC (1u << 6)
#define USART1_ISR_RXNE (1u << 5)
#define USART1_ISR_IDLE (1u << 4)
#define USART1_ISR_ORE (1u << 3)
#define USART1_ISR_NF (1u << 2)
#define USART1_ISR_FE (1u << 1)
#define USART1_ISR_PE (1u << 0)
#define USART1_ICR_WUCF (1u << 20)
#define USART1_ICR_CMCF (1u << 17)
#define USART1_ICR_EOBCF (1u << 12)
#define USART1_ICR_RTOCF (1u << 11)
#define USART1_ICR_CTSCF (1u << 9)
#define USART1_ICR_LBDCF (1u << 8)
#define USART1_ICR_TCCF (1u << 6)
#define USART1_ICR_IDLECF (1u << 4)
#define USART1_ICR_ORECF (1u << 3)
#define USART1_ICR_NCF (1u << 2)
#define USART1_ICR_FECF (1u << 1)
#define USART1_ICR_PECF (1u << 0)
#define USART1_RDR_RDR_LSB   0
#define USART1_RDR_RDR_WIDTH 9
#define USART1_RDR_RDR_MASK  (0x1FFu)
#define USART1_TDR_TDR_LSB   0
#define USART1_TDR_TDR_WIDTH 9
#define USART1_TDR_TDR_MASK  (0x1FFu)

/* === USART2 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t CR3; /* 0x008 */
    volatile uint32_t BRR; /* 0x00C */
    volatile uint32_t GTPR; /* 0x010 */
    volatile uint32_t RTOR; /* 0x014 */
    volatile uint32_t RQR; /* 0x018 */
    volatile uint32_t ISR; /* 0x01C */
    volatile uint32_t ICR; /* 0x020 */
    volatile uint32_t RDR; /* 0x024 */
    volatile uint32_t TDR; /* 0x028 */
} USART2_Type;

#define USART2_BASE 0x40004400u
#define USART2 ((volatile USART2_Type*)USART2_BASE)

#define USART2_CR1_M1 (1u << 28)
#define USART2_CR1_EOBIE (1u << 27)
#define USART2_CR1_RTOIE (1u << 26)
#define USART2_CR1_DEAT4 (1u << 25)
#define USART2_CR1_DEAT3 (1u << 24)
#define USART2_CR1_DEAT2 (1u << 23)
#define USART2_CR1_DEAT1 (1u << 22)
#define USART2_CR1_DEAT0 (1u << 21)
#define USART2_CR1_DEDT4 (1u << 20)
#define USART2_CR1_DEDT3 (1u << 19)
#define USART2_CR1_DEDT2 (1u << 18)
#define USART2_CR1_DEDT1 (1u << 17)
#define USART2_CR1_DEDT0 (1u << 16)
#define USART2_CR1_OVER8 (1u << 15)
#define USART2_CR1_CMIE (1u << 14)
#define USART2_CR1_MME (1u << 13)
#define USART2_CR1_M0 (1u << 12)
#define USART2_CR1_WAKE (1u << 11)
#define USART2_CR1_PCE (1u << 10)
#define USART2_CR1_PS (1u << 9)
#define USART2_CR1_PEIE (1u << 8)
#define USART2_CR1_TXEIE (1u << 7)
#define USART2_CR1_TCIE (1u << 6)
#define USART2_CR1_RXNEIE (1u << 5)
#define USART2_CR1_IDLEIE (1u << 4)
#define USART2_CR1_TE (1u << 3)
#define USART2_CR1_RE (1u << 2)
#define USART2_CR1_UESM (1u << 1)
#define USART2_CR1_UE (1u << 0)
#define USART2_CR2_ADD4_7_LSB   28
#define USART2_CR2_ADD4_7_WIDTH 4
#define USART2_CR2_ADD4_7_MASK  (0xF0000000u)
#define USART2_CR2_ADD0_3_LSB   24
#define USART2_CR2_ADD0_3_WIDTH 4
#define USART2_CR2_ADD0_3_MASK  (0xF000000u)
#define USART2_CR2_RTOEN (1u << 23)
#define USART2_CR2_ABRMOD1 (1u << 22)
#define USART2_CR2_ABRMOD0 (1u << 21)
#define USART2_CR2_ABREN (1u << 20)
#define USART2_CR2_MSBFIRST (1u << 19)
#define USART2_CR2_TAINV (1u << 18)
#define USART2_CR2_TXINV (1u << 17)
#define USART2_CR2_RXINV (1u << 16)
#define USART2_CR2_SWAP (1u << 15)
#define USART2_CR2_LINEN (1u << 14)
#define USART2_CR2_STOP_LSB   12
#define USART2_CR2_STOP_WIDTH 2
#define USART2_CR2_STOP_MASK  (0x3000u)
#define USART2_CR2_CLKEN (1u << 11)
#define USART2_CR2_CPOL (1u << 10)
#define USART2_CR2_CPHA (1u << 9)
#define USART2_CR2_LBCL (1u << 8)
#define USART2_CR2_LBDIE (1u << 6)
#define USART2_CR2_LBDL (1u << 5)
#define USART2_CR2_ADDM7 (1u << 4)
#define USART2_CR3_WUFIE (1u << 22)
#define USART2_CR3_WUS_LSB   20
#define USART2_CR3_WUS_WIDTH 2
#define USART2_CR3_WUS_MASK  (0x300000u)
#define USART2_CR3_SCARCNT_LSB   17
#define USART2_CR3_SCARCNT_WIDTH 3
#define USART2_CR3_SCARCNT_MASK  (0xE0000u)
#define USART2_CR3_DEP (1u << 15)
#define USART2_CR3_DEM (1u << 14)
#define USART2_CR3_DDRE (1u << 13)
#define USART2_CR3_OVRDIS (1u << 12)
#define USART2_CR3_ONEBIT (1u << 11)
#define USART2_CR3_CTSIE (1u << 10)
#define USART2_CR3_CTSE (1u << 9)
#define USART2_CR3_RTSE (1u << 8)
#define USART2_CR3_DMAT (1u << 7)
#define USART2_CR3_DMAR (1u << 6)
#define USART2_CR3_SCEN (1u << 5)
#define USART2_CR3_NACK (1u << 4)
#define USART2_CR3_HDSEL (1u << 3)
#define USART2_CR3_IRLP (1u << 2)
#define USART2_CR3_IREN (1u << 1)
#define USART2_CR3_EIE (1u << 0)
#define USART2_BRR_DIV_MANTISSA_LSB   4
#define USART2_BRR_DIV_MANTISSA_WIDTH 12
#define USART2_BRR_DIV_MANTISSA_MASK  (0xFFF0u)
#define USART2_BRR_DIV_FRACTION_LSB   0
#define USART2_BRR_DIV_FRACTION_WIDTH 4
#define USART2_BRR_DIV_FRACTION_MASK  (0xFu)
#define USART2_GTPR_GT_LSB   8
#define USART2_GTPR_GT_WIDTH 8
#define USART2_GTPR_GT_MASK  (0xFF00u)
#define USART2_GTPR_PSC_LSB   0
#define USART2_GTPR_PSC_WIDTH 8
#define USART2_GTPR_PSC_MASK  (0xFFu)
#define USART2_RTOR_BLEN_LSB   24
#define USART2_RTOR_BLEN_WIDTH 8
#define USART2_RTOR_BLEN_MASK  (0xFF000000u)
#define USART2_RTOR_RTO_LSB   0
#define USART2_RTOR_RTO_WIDTH 24
#define USART2_RTOR_RTO_MASK  (0xFFFFFFu)
#define USART2_RQR_TXFRQ (1u << 4)
#define USART2_RQR_RXFRQ (1u << 3)
#define USART2_RQR_MMRQ (1u << 2)
#define USART2_RQR_SBKRQ (1u << 1)
#define USART2_RQR_ABRRQ (1u << 0)
#define USART2_ISR_REACK (1u << 22)
#define USART2_ISR_TEACK (1u << 21)
#define USART2_ISR_WUF (1u << 20)
#define USART2_ISR_RWU (1u << 19)
#define USART2_ISR_SBKF (1u << 18)
#define USART2_ISR_CMF (1u << 17)
#define USART2_ISR_BUSY (1u << 16)
#define USART2_ISR_ABRF (1u << 15)
#define USART2_ISR_ABRE (1u << 14)
#define USART2_ISR_EOBF (1u << 12)
#define USART2_ISR_RTOF (1u << 11)
#define USART2_ISR_CTS (1u << 10)
#define USART2_ISR_CTSIF (1u << 9)
#define USART2_ISR_LBDF (1u << 8)
#define USART2_ISR_TXE (1u << 7)
#define USART2_ISR_TC (1u << 6)
#define USART2_ISR_RXNE (1u << 5)
#define USART2_ISR_IDLE (1u << 4)
#define USART2_ISR_ORE (1u << 3)
#define USART2_ISR_NF (1u << 2)
#define USART2_ISR_FE (1u << 1)
#define USART2_ISR_PE (1u << 0)
#define USART2_ICR_WUCF (1u << 20)
#define USART2_ICR_CMCF (1u << 17)
#define USART2_ICR_EOBCF (1u << 12)
#define USART2_ICR_RTOCF (1u << 11)
#define USART2_ICR_CTSCF (1u << 9)
#define USART2_ICR_LBDCF (1u << 8)
#define USART2_ICR_TCCF (1u << 6)
#define USART2_ICR_IDLECF (1u << 4)
#define USART2_ICR_ORECF (1u << 3)
#define USART2_ICR_NCF (1u << 2)
#define USART2_ICR_FECF (1u << 1)
#define USART2_ICR_PECF (1u << 0)
#define USART2_RDR_RDR_LSB   0
#define USART2_RDR_RDR_WIDTH 9
#define USART2_RDR_RDR_MASK  (0x1FFu)
#define USART2_TDR_TDR_LSB   0
#define USART2_TDR_TDR_WIDTH 9
#define USART2_TDR_TDR_MASK  (0x1FFu)

/* === USART4 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t CR3; /* 0x008 */
    volatile uint32_t BRR; /* 0x00C */
    volatile uint32_t GTPR; /* 0x010 */
    volatile uint32_t RTOR; /* 0x014 */
    volatile uint32_t RQR; /* 0x018 */
    volatile uint32_t ISR; /* 0x01C */
    volatile uint32_t ICR; /* 0x020 */
    volatile uint32_t RDR; /* 0x024 */
    volatile uint32_t TDR; /* 0x028 */
} USART4_Type;

#define USART4_BASE 0x40004C00u
#define USART4 ((volatile USART4_Type*)USART4_BASE)

