Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define USART4_CR1_M1 (1u << 28)
#define USART4_CR1_EOBIE (1u << 27)
#define USART4_CR1_RTOIE (1u << 26)
#define USART4_CR1_DEAT4 (1u << 25)
#define USART4_CR1_DEAT3 (1u << 24)
#define USART4_CR1_DEAT2 (1u << 23)
#define USART4_CR1_DEAT1 (1u << 22)
#define USART4_CR1_DEAT0 (1u << 21)
#define USART4_CR1_DEDT4 (1u << 20)
#define USART4_CR1_DEDT3 (1u << 19)
#define USART4_CR1_DEDT2 (1u << 18)
#define USART4_CR1_DEDT1 (1u << 17)
#define USART4_CR1_DEDT0 (1u << 16)
#define USART4_CR1_OVER8 (1u << 15)
#define USART4_CR1_CMIE (1u << 14)
#define USART4_CR1_MME (1u << 13)
#define USART4_CR1_M0 (1u << 12)
#define USART4_CR1_WAKE (1u << 11)
#define USART4_CR1_PCE (1u << 10)
#define USART4_CR1_PS (1u << 9)
#define USART4_CR1_PEIE (1u << 8)
#define USART4_CR1_TXEIE (1u << 7)
#define USART4_CR1_TCIE (1u << 6)
#define USART4_CR1_RXNEIE (1u << 5)
#define USART4_CR1_IDLEIE (1u << 4)
#define USART4_CR1_TE (1u << 3)
#define USART4_CR1_RE (1u << 2)
#define USART4_CR1_UESM (1u << 1)
#define USART4_CR1_UE (1u << 0)
#define USART4_CR2_ADD4_7_LSB   28
#define USART4_CR2_ADD4_7_WIDTH 4
#define USART4_CR2_ADD4_7_MASK  (0xF0000000u)
#define USART4_CR2_ADD0_3_LSB   24
#define USART4_CR2_ADD0_3_WIDTH 4
#define USART4_CR2_ADD0_3_MASK  (0xF000000u)
#define USART4_CR2_RTOEN (1u << 23)
#define USART4_CR2_ABRMOD1 (1u << 22)
#define USART4_CR2_ABRMOD0 (1u << 21)
#define USART4_CR2_ABREN (1u << 20)
#define USART4_CR2_MSBFIRST (1u << 19)
#define USART4_CR2_TAINV (1u << 18)
#define USART4_CR2_TXINV (1u << 17)
#define USART4_CR2_RXINV (1u << 16)
#define USART4_CR2_SWAP (1u << 15)
#define USART4_CR2_LINEN (1u << 14)
#define USART4_CR2_STOP_LSB   12
#define USART4_CR2_STOP_WIDTH 2
#define USART4_CR2_STOP_MASK  (0x3000u)
#define USART4_CR2_CLKEN (1u << 11)
#define USART4_CR2_CPOL (1u << 10)
#define USART4_CR2_CPHA (1u << 9)
#define USART4_CR2_LBCL (1u << 8)
#define USART4_CR2_LBDIE (1u << 6)
#define USART4_CR2_LBDL (1u << 5)
#define USART4_CR2_ADDM7 (1u << 4)
#define USART4_CR3_WUFIE (1u << 22)
#define USART4_CR3_WUS_LSB   20
#define USART4_CR3_WUS_WIDTH 2
#define USART4_CR3_WUS_MASK  (0x300000u)
#define USART4_CR3_SCARCNT_LSB   17
#define USART4_CR3_SCARCNT_WIDTH 3
#define USART4_CR3_SCARCNT_MASK  (0xE0000u)
#define USART4_CR3_DEP (1u << 15)
#define USART4_CR3_DEM (1u << 14)
#define USART4_CR3_DDRE (1u << 13)
#define USART4_CR3_OVRDIS (1u << 12)
#define USART4_CR3_ONEBIT (1u << 11)
#define USART4_CR3_CTSIE (1u << 10)
#define USART4_CR3_CTSE (1u << 9)
#define USART4_CR3_RTSE (1u << 8)
#define USART4_CR3_DMAT (1u << 7)
#define USART4_CR3_DMAR (1u << 6)
#define USART4_CR3_SCEN (1u << 5)
#define USART4_CR3_NACK (1u << 4)
#define USART4_CR3_HDSEL (1u << 3)
#define USART4_CR3_IRLP (1u << 2)
#define USART4_CR3_IREN (1u << 1)
#define USART4_CR3_EIE (1u << 0)
#define USART4_BRR_DIV_MANTISSA_LSB   4
#define USART4_BRR_DIV_MANTISSA_WIDTH 12
#define USART4_BRR_DIV_MANTISSA_MASK  (0xFFF0u)
#define USART4_BRR_DIV_FRACTION_LSB   0
#define USART4_BRR_DIV_FRACTION_WIDTH 4
#define USART4_BRR_DIV_FRACTION_MASK  (0xFu)
#define USART4_GTPR_GT_LSB   8
#define USART4_GTPR_GT_WIDTH 8
#define USART4_GTPR_GT_MASK  (0xFF00u)
#define USART4_GTPR_PSC_LSB   0
#define USART4_GTPR_PSC_WIDTH 8
#define USART4_GTPR_PSC_MASK  (0xFFu)
#define USART4_RTOR_BLEN_LSB   24
#define USART4_RTOR_BLEN_WIDTH 8
#define USART4_RTOR_BLEN_MASK  (0xFF000000u)
#define USART4_RTOR_RTO_LSB   0
#define USART4_RTOR_RTO_WIDTH 24
#define USART4_RTOR_RTO_MASK  (0xFFFFFFu)
#define USART4_RQR_TXFRQ (1u << 4)
#define USART4_RQR_RXFRQ (1u << 3)
#define USART4_RQR_MMRQ (1u << 2)
#define USART4_RQR_SBKRQ (1u << 1)
#define USART4_RQR_ABRRQ (1u << 0)
#define USART4_ISR_REACK (1u << 22)
#define USART4_ISR_TEACK (1u << 21)
#define USART4_ISR_WUF (1u << 20)
#define USART4_ISR_RWU (1u << 19)
#define USART4_ISR_SBKF (1u << 18)
#define USART4_ISR_CMF (1u << 17)
#define USART4_ISR_BUSY (1u << 16)
#define USART4_ISR_ABRF (1u << 15)
#define USART4_ISR_ABRE (1u << 14)
#define USART4_ISR_EOBF (1u << 12)
#define USART4_ISR_RTOF (1u << 11)
#define USART4_ISR_CTS (1u << 10)
#define USART4_ISR_CTSIF (1u << 9)
#define USART4_ISR_LBDF (1u << 8)
#define USART4_ISR_TXE (1u << 7)
#define USART4_ISR_TC (1u << 6)
#define USART4_ISR_RXNE (1u << 5)
#define USART4_ISR_IDLE (1u << 4)
#define USART4_ISR_ORE (1u << 3)
#define USART4_ISR_NF (1u << 2)
#define USART4_ISR_FE (1u << 1)
#define USART4_ISR_PE (1u << 0)
#define USART4_ICR_WUCF (1u << 20)
#define USART4_ICR_CMCF (1u << 17)
#define USART4_ICR_EOBCF (1u << 12)
#define USART4_ICR_RTOCF (1u << 11)
#define USART4_ICR_CTSCF (1u << 9)
#define USART4_ICR_LBDCF (1u << 8)
#define USART4_ICR_TCCF (1u << 6)
#define USART4_ICR_IDLECF (1u << 4)
#define USART4_ICR_ORECF (1u << 3)
#define USART4_ICR_NCF (1u << 2)
#define USART4_ICR_FECF (1u << 1)
#define USART4_ICR_PECF (1u << 0)
#define USART4_RDR_RDR_LSB   0
#define USART4_RDR_RDR_WIDTH 9
#define USART4_RDR_RDR_MASK  (0x1FFu)
#define USART4_TDR_TDR_LSB   0
#define USART4_TDR_TDR_WIDTH 9
#define USART4_TDR_TDR_MASK  (0x1FFu)

/* === USART5 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t CR3; /* 0x008 */
    volatile uint32_t BRR; /* 0x00C */
    volatile uint32_t GTPR; /* 0x010 */
    volatile uint32_t RTOR; /* 0x014 */
    volatile uint32_t RQR; /* 0x018 */
    volatile uint32_t ISR; /* 0x01C */
    volatile uint32_t ICR; /* 0x020 */
    volatile uint32_t RDR; /* 0x024 */
    volatile uint32_t TDR; /* 0x028 */
} USART5_Type;

#define USART5_BASE 0x40005000u
#define USART5 ((volatile USART5_Type*)USART5_BASE)

#define USART5_CR1_M1 (1u << 28)
#define USART5_CR1_EOBIE (1u << 27)
#define USART5_CR1_RTOIE (1u << 26)
#define USART5_CR1_DEAT4 (1u << 25)
#define USART5_CR1_DEAT3 (1u << 24)
#define USART5_CR1_DEAT2 (1u << 23)
#define USART5_CR1_DEAT1 (1u << 22)
#define USART5_CR1_DEAT0 (1u << 21)
#define USART5_CR1_DEDT4 (1u << 20)
#define USART5_CR1_DEDT3 (1u << 19)
#define USART5_CR1_DEDT2 (1u << 18)
#define USART5_CR1_DEDT1 (1u << 17)
#define USART5_CR1_DEDT0 (1u << 16)
#define USART5_CR1_OVER8 (1u << 15)
#define USART5_CR1_CMIE (1u << 14)
#define USART5_CR1_MME (1u << 13)
#define USART5_CR1_M0 (1u << 12)
#define USART5_CR1_WAKE (1u << 11)
#define USART5_CR1_PCE (1u << 10)
#define USART5_CR1_PS (1u << 9)
#define USART5_CR1_PEIE (1u << 8)
#define USART5_CR1_TXEIE (1u << 7)
#define USART5_CR1_TCIE (1u << 6)
#define USART5_CR1_RXNEIE (1u << 5)
#define USART5_CR1_IDLEIE (1u << 4)
#define USART5_CR1_TE (1u << 3)
#define USART5_CR1_RE (1u << 2)
#define USART5_CR1_UESM (1u << 1)
#define USART5_CR1_UE (1u << 0)
#define USART5_CR2_ADD4_7_LSB   28
#define USART5_CR2_ADD4_7_WIDTH 4
#define USART5_CR2_ADD4_7_MASK  (0xF0000000u)
#define USART5_CR2_ADD0_3_LSB   24
#define USART5_CR2_ADD0_3_WIDTH 4
#define USART5_CR2_ADD0_3_MASK  (0xF000000u)
#define USART5_CR2_RTOEN (1u << 23)
#define USART5_CR2_ABRMOD1 (1u << 22)
#define USART5_CR2_ABRMOD0 (1u << 21)
#define USART5_CR2_ABREN (1u << 20)
#define USART5_CR2_MSBFIRST (1u << 19)
#define USART5_CR2_TAINV (1u << 18)
#define USART5_CR2_TXINV (1u << 17)
#define USART5_CR2_RXINV (1u << 16)
#define USART5_CR2_SWAP (1u << 15)
#define USART5_CR2_LINEN (1u << 14)
#define USART5_CR2_STOP_LSB   12
#define USART5_CR2_STOP_WIDTH 2
#define USART5_CR2_STOP_MASK  (0x3000u)
#define USART5_CR2_CLKEN (1u << 11)
#define USART5_CR2_CPOL (1u << 10)
#define USART5_CR2_CPHA (1u << 9)
#define USART5_CR2_LBCL (1u << 8)
#define USART5_CR2_LBDIE (1u << 6)
#define USART5_CR2_LBDL (1u << 5)
#define USART5_CR2_ADDM7 (1u << 4)
#define USART5_CR3_WUFIE (1u << 22)
#define USART5_CR3_WUS_LSB   20
#define USART5_CR3_WUS_WIDTH 2
#define USART5_CR3_WUS_MASK  (0x300000u)
#define USART5_CR3_SCARCNT_LSB   17
#define USART5_CR3_SCARCNT_WIDTH 3
#define USART5_CR3_SCARCNT_MASK  (0xE0000u)
#define USART5_CR3_DEP (1u << 15)
#define USART5_CR3_DEM (1u << 14)
#define USART5_CR3_DDRE (1u << 13)
#define USART5_CR3_OVRDIS (1u << 12)
#define USART5_CR3_ONEBIT (1u << 11)
#define USART5_CR3_CTSIE (1u << 10)
#define USART5_CR3_CTSE (1u << 9)
#define USART5_CR3_RTSE (1u << 8)
#define USART5_CR3_DMAT (1u << 7)
#define USART5_CR3_DMAR (1u << 6)
#define USART5_CR3_SCEN (1u << 5)
#define USART5_CR3_NACK (1u << 4)
#define USART5_CR3_HDSEL (1u << 3)
#define USART5_CR3_IRLP (1u << 2)
#define USART5_CR3_IREN (1u << 1)
#define USART5_CR3_EIE (1u << 0)
#define USART5_BRR_DIV_MANTISSA_LSB   4
#define USART5_BRR_DIV_MANTISSA_WIDTH 12
#define USART5_BRR_DIV_MANTISSA_MASK  (0xFFF0u)
#define USART5_BRR_DIV_FRACTION_LSB   0
#define USART5_BRR_DIV_FRACTION_WIDTH 4
#define USART5_BRR_DIV_FRACTION_MASK  (0xFu)
#define USART5_GTPR_GT_LSB   8
#define USART5_GTPR_GT_WIDTH 8
#define USART5_GTPR_GT_MASK  (0xFF00u)
#define USART5_GTPR_PSC_LSB   0
#define USART5_GTPR_PSC_WIDTH 8
#define USART5_GTPR_PSC_MASK  (0xFFu)
#define USART5_RTOR_BLEN_LSB   24
#define USART5_RTOR_BLEN_WIDTH 8
#define USART5_RTOR_BLEN_MASK  (0xFF000000u)
#define USART5_RTOR_RTO_LSB   0
#define USART5_RTOR_RTO_WIDTH 24
#define USART5_RTOR_RTO_MASK  (0xFFFFFFu)
#define USART5_RQR_TXFRQ (1u << 4)
#define USART5_RQR_RXFRQ (1u << 3)
#define USART5_RQR_MMRQ (1u << 2)
#define USART5_RQR_SBKRQ (1u << 1)
#define USART5_RQR_ABRRQ (1u << 0)
#define USART5_ISR_REACK (1u << 22)
#define USART5_ISR_TEACK (1u << 21)
#define USART5_ISR_WUF (1u << 20)
#define USART5_ISR_RWU (1u << 19)
#define USART5_ISR_SBKF (1u << 18)
#define USART5_ISR_CMF (1u << 17)
#define USART5_ISR_BUSY (1u << 16)
#define USART5_ISR_ABRF (1u << 15)
#define USART5_ISR_ABRE (1u << 14)
#define USART5_ISR_EOBF (1u << 12)
#define USART5_ISR_RTOF (1u << 11)
#define USART5_ISR_CTS (1u << 10)
#define USART5_ISR_CTSIF (1u << 9)
#define USART5_ISR_LBDF (1u << 8)
#define USART5_ISR_TXE (1u << 7)
#define USART5_ISR_TC (1u << 6)
#define USART5_ISR_RXNE (1u << 5)
#define USART5_ISR_IDLE (1u << 4)
#define USART5_ISR_ORE (1u << 3)
#define USART5_ISR_NF (1u << 2)
#define USART5_ISR_FE (1u << 1)
#define USART5_ISR_PE (1u << 0)
#define USART5_ICR_WUCF (1u << 20)
#define USART5_ICR_CMCF (1u << 17)
#define USART5_ICR_EOBCF (1u << 12)
#define USART5_ICR_RTOCF (1u << 11)
#define USART5_ICR_CTSCF (1u << 9)
#define USART5_ICR_LBDCF (1u << 8)
#define USART5_ICR_TCCF (1u << 6)
#define USART5_ICR_IDLECF (1u << 4)
#define USART5_ICR_ORECF (1u << 3)
#define USART5_ICR_NCF (1u << 2)
#define USART5_ICR_FECF (1u << 1)
#define USART5_ICR_PECF (1u << 0)
#define USART5_RDR_RDR_LSB   0
#define USART5_RDR_RDR_WIDTH 9
#define USART5_RDR_RDR_MASK  (0x1FFu)
#define USART5_TDR_TDR_LSB   0
#define USART5_TDR_TDR_WIDTH 9
#define USART5_TDR_TDR_MASK  (0x1FFu)

/* === IWDG ================================= */
typedef struct {
    volatile uint32_t KR; /* 0x000 */
    volatile uint32_t PR; /* 0x004 */
    volatile uint32_t RLR; /* 0x008 */
    volatile uint32_t SR; /* 0x00C */
    volatile uint32_t WINR; /* 0x010 */
} IWDG_Type;

#define IWDG_BASE 0x40003000u
#define IWDG ((volatile IWDG_Type*)IWDG_BASE)

