Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define IWDG_KR_KEY_LSB   0
#define IWDG_KR_KEY_WIDTH 16
#define IWDG_KR_KEY_MASK  (0xFFFFu)
#define IWDG_PR_PR_LSB   0
#define IWDG_PR_PR_WIDTH 3
#define IWDG_PR_PR_MASK  (0x7u)
#define IWDG_RLR_RL_LSB   0
#define IWDG_RLR_RL_WIDTH 12
#define IWDG_RLR_RL_MASK  (0xFFFu)
#define IWDG_SR_WVU (1u << 2)
#define IWDG_SR_RVU (1u << 1)
#define IWDG_SR_PVU (1u << 0)
#define IWDG_WINR_WIN_LSB   0
#define IWDG_WINR_WIN_WIDTH 12
#define IWDG_WINR_WIN_MASK  (0xFFFu)

/* === WWDG ================================= */
typedef struct {
    volatile uint32_t CR; /* 0x000 */
    volatile uint32_t CFR; /* 0x004 */
    volatile uint32_t SR; /* 0x008 */
} WWDG_Type;

#define WWDG_BASE 0x40002C00u
#define WWDG ((volatile WWDG_Type*)WWDG_BASE)

#define WWDG_CR_WDGA (1u << 7)
#define WWDG_CR_T_LSB   0
#define WWDG_CR_T_WIDTH 7
#define WWDG_CR_T_MASK  (0x7Fu)
#define WWDG_CFR_EWI (1u << 9)
#define WWDG_CFR_WDGTB1 (1u << 8)
#define WWDG_CFR_WDGTB0 (1u << 7)
#define WWDG_CFR_W_LSB   0
#define WWDG_CFR_W_WIDTH 7
#define WWDG_CFR_W_MASK  (0x7Fu)
#define WWDG_SR_EWIF (1u << 0)

/* === Firewall ================================= */
typedef struct {
    volatile uint32_t FIREWALL_CSSA; /* 0x000 */
    volatile uint32_t FIREWALL_CSL; /* 0x004 */
    volatile uint32_t FIREWALL_NVDSSA; /* 0x008 */
    volatile uint32_t FIREWALL_NVDSL; /* 0x00C */
    volatile uint32_t FIREWALL_VDSSA; /* 0x010 */
    volatile uint32_t FIREWALL_VDSL; /* 0x014 */
    uint8_t _res_0018[8];
    volatile uint32_t FIREWALL_CR; /* 0x020 */
} Firewall_Type;

#define FIREWALL_BASE 0x40011C00u
#define FIREWALL ((volatile Firewall_Type*)FIREWALL_BASE)

#define FIREWALL_FIREWALL_CSSA_ADD_LSB   8
#define FIREWALL_FIREWALL_CSSA_ADD_WIDTH 16
#define FIREWALL_FIREWALL_CSSA_ADD_MASK  (0xFFFF00u)
#define FIREWALL_FIREWALL_CSL_LENG_LSB   8
#define FIREWALL_FIREWALL_CSL_LENG_WIDTH 14
#define FIREWALL_FIREWALL_CSL_LENG_MASK  (0x3FFF00u)
#define FIREWALL_FIREWALL_NVDSSA_ADD_LSB   8
#define FIREWALL_FIREWALL_NVDSSA_ADD_WIDTH 16
#define FIREWALL_FIREWALL_NVDSSA_ADD_MASK  (0xFFFF00u)
#define FIREWALL_FIREWALL_NVDSL_LENG_LSB   8
#define FIREWALL_FIREWALL_NVDSL_LENG_WIDTH 14
#define FIREWALL_FIREWALL_NVDSL_LENG_MASK  (0x3FFF00u)
#define FIREWALL_FIREWALL_VDSSA_ADD_LSB   6
#define FIREWALL_FIREWALL_VDSSA_ADD_WIDTH 10
#define FIREWALL_FIREWALL_VDSSA_ADD_MASK  (0xFFC0u)
#define FIREWALL_FIREWALL_VDSL_LENG_LSB   6
#define FIREWALL_FIREWALL_VDSL_LENG_WIDTH 10
#define FIREWALL_FIREWALL_VDSL_LENG_MASK  (0xFFC0u)
#define FIREWALL_FIREWALL_CR_VDE (1u << 2)
#define FIREWALL_FIREWALL_CR_VDS (1u << 1)
#define FIREWALL_FIREWALL_CR_FPA (1u << 0)

/* === RCC ================================= */
typedef struct {
    volatile uint32_t CR; /* 0x000 */
    volatile uint32_t ICSCR; /* 0x004 */
    uint8_t _res_0008[4];
    volatile uint32_t CFGR; /* 0x00C */
    volatile uint32_t CIER; /* 0x010 */
    volatile uint32_t CIFR; /* 0x014 */
    volatile uint32_t CICR; /* 0x018 */
    volatile uint32_t IOPRSTR; /* 0x01C */
    volatile uint32_t AHBRSTR; /* 0x020 */
    volatile uint32_t APB2RSTR; /* 0x024 */
    volatile uint32_t APB1RSTR; /* 0x028 */
    volatile uint32_t IOPENR; /* 0x02C */
    volatile uint32_t AHBENR; /* 0x030 */
    volatile uint32_t APB2ENR; /* 0x034 */
    volatile uint32_t APB1ENR; /* 0x038 */
    volatile uint32_t IOPSMEN; /* 0x03C */
    volatile uint32_t AHBSMENR; /* 0x040 */
    volatile uint32_t APB2SMENR; /* 0x044 */
    volatile uint32_t APB1SMENR; /* 0x048 */
    volatile uint32_t CCIPR; /* 0x04C */
    volatile uint32_t CSR; /* 0x050 */
} RCC_Type;

#define RCC_BASE 0x40021000u
#define RCC ((volatile RCC_Type*)RCC_BASE)

#define RCC_CR_PLLRDY (1u << 25)
#define RCC_CR_PLLON (1u << 24)
#define RCC_CR_RTCPRE_LSB   20
#define RCC_CR_RTCPRE_WIDTH 2
#define RCC_CR_RTCPRE_MASK  (0x300000u)
#define RCC_CR_CSSLSEON (1u << 19)
#define RCC_CR_HSEBYP (1u << 18)
#define RCC_CR_HSERDY (1u << 17)
#define RCC_CR_HSEON (1u << 16)
#define RCC_CR_MSIRDY (1u << 9)
#define RCC_CR_MSION (1u << 8)
#define RCC_CR_HSI16DIVF (1u << 4)
#define RCC_CR_HSI16DIVEN (1u << 3)
#define RCC_CR_HSI16RDYF (1u << 2)
#define RCC_CR_HSI16KERON (1u << 1)
#define RCC_CR_HSI16ON (1u << 0)
#define RCC_CR_HSI16OUTEN (1u << 5)
#define RCC_ICSCR_MSITRIM_LSB   24
#define RCC_ICSCR_MSITRIM_WIDTH 8
#define RCC_ICSCR_MSITRIM_MASK  (0xFF000000u)
#define RCC_ICSCR_MSICAL_LSB   16
#define RCC_ICSCR_MSICAL_WIDTH 8
#define RCC_ICSCR_MSICAL_MASK  (0xFF0000u)
#define RCC_ICSCR_MSIRANGE_LSB   13
#define RCC_ICSCR_MSIRANGE_WIDTH 3
#define RCC_ICSCR_MSIRANGE_MASK  (0xE000u)
#define RCC_ICSCR_HSI16TRIM_LSB   8
#define RCC_ICSCR_HSI16TRIM_WIDTH 5
#define RCC_ICSCR_HSI16TRIM_MASK  (0x1F00u)
#define RCC_ICSCR_HSI16CAL_LSB   0
#define RCC_ICSCR_HSI16CAL_WIDTH 8
#define RCC_ICSCR_HSI16CAL_MASK  (0xFFu)
#define RCC_CFGR_MCOPRE_LSB   28
#define RCC_CFGR_MCOPRE_WIDTH 3
#define RCC_CFGR_MCOPRE_MASK  (0x70000000u)
#define RCC_CFGR_MCOSEL_LSB   24
#define RCC_CFGR_MCOSEL_WIDTH 3
#define RCC_CFGR_MCOSEL_MASK  (0x7000000u)
#define RCC_CFGR_PLLDIV_LSB   22
#define RCC_CFGR_PLLDIV_WIDTH 2
#define RCC_CFGR_PLLDIV_MASK  (0xC00000u)
#define RCC_CFGR_PLLMUL_LSB   18
#define RCC_CFGR_PLLMUL_WIDTH 4
#define RCC_CFGR_PLLMUL_MASK  (0x3C0000u)
#define RCC_CFGR_PLLSRC (1u << 16)
#define RCC_CFGR_STOPWUCK (1u << 15)
#define RCC_CFGR_PPRE2_LSB   11
#define RCC_CFGR_PPRE2_WIDTH 3
#define RCC_CFGR_PPRE2_MASK  (0x3800u)
#define RCC_CFGR_PPRE1_LSB   8
#define RCC_CFGR_PPRE1_WIDTH 3
#define RCC_CFGR_PPRE1_MASK  (0x700u)
#define RCC_CFGR_HPRE_LSB   4
#define RCC_CFGR_HPRE_WIDTH 4
#define RCC_CFGR_HPRE_MASK  (0xF0u)
#define RCC_CFGR_SWS_LSB   2
#define RCC_CFGR_SWS_WIDTH 2
#define RCC_CFGR_SWS_MASK  (0xCu)
#define RCC_CFGR_SW_LSB   0
#define RCC_CFGR_SW_WIDTH 2
#define RCC_CFGR_SW_MASK  (0x3u)
#define RCC_CIER_CSSLSE (1u << 7)
#define RCC_CIER_MSIRDYIE (1u << 5)
#define RCC_CIER_PLLRDYIE (1u << 4)
#define RCC_CIER_HSERDYIE (1u << 3)
#define RCC_CIER_HSI16RDYIE (1u << 2)
#define RCC_CIER_LSERDYIE (1u << 1)
#define RCC_CIER_LSIRDYIE (1u << 0)
#define RCC_CIFR_CSSHSEF (1u << 8)
#define RCC_CIFR_CSSLSEF (1u << 7)
#define RCC_CIFR_MSIRDYF (1u << 5)
#define RCC_CIFR_PLLRDYF (1u << 4)
#define RCC_CIFR_HSERDYF (1u << 3)
#define RCC_CIFR_HSI16RDYF (1u << 2)
#define RCC_CIFR_LSERDYF (1u << 1)
#define RCC_CIFR_LSIRDYF (1u << 0)
#define RCC_CICR_CSSHSEC (1u << 8)
#define RCC_CICR_CSSLSEC (1u << 7)
#define RCC_CICR_MSIRDYC (1u << 5)
#define RCC_CICR_PLLRDYC (1u << 4)
#define RCC_CICR_HSERDYC (1u << 3)
#define RCC_CICR_HSI16RDYC (1u << 2)
#define RCC_CICR_LSERDYC (1u << 1)
#define RCC_CICR_LSIRDYC (1u << 0)
#define RCC_IOPRSTR_IOPHRST (1u << 7)
#define RCC_IOPRSTR_IOPDRST (1u << 3)
#define RCC_IOPRSTR_IOPCRST (1u << 2)
#define RCC_IOPRSTR_IOPBRST (1u << 1)
#define RCC_IOPRSTR_IOPARST (1u << 0)
#define RCC_IOPRSTR_IOPERST (1u << 4)
#define RCC_AHBRSTR_CRYPRST (1u << 24)
#define RCC_AHBRSTR_CRCRST (1u << 12)
#define RCC_AHBRSTR_MIFRST (1u << 8)
#define RCC_AHBRSTR_DMARST (1u << 0)
#define RCC_APB2RSTR_DBGRST (1u << 22)
#define RCC_APB2RSTR_USART1RST (1u << 14)
#define RCC_APB2RSTR_SPI1RST (1u << 12)
#define RCC_APB2RSTR_ADCRST (1u << 9)
#define RCC_APB2RSTR_TIM22RST (1u << 5)
#define RCC_APB2RSTR_TIM21RST (1u << 2)
#define RCC_APB2RSTR_SYSCFGRST (1u << 0)
#define RCC_APB1RSTR_LPTIM1RST (1u << 31)
#define RCC_APB1RSTR_PWRRST (1u << 28)
#define RCC_APB1RSTR_I2C2RST (1u << 22)
#define RCC_APB1RSTR_I2C1RST (1u << 21)
#define RCC_APB1RSTR_LPUART1RST (1u << 18)
#define RCC_APB1RSTR_USART2RST (1u << 17)
#define RCC_APB1RSTR_SPI2RST (1u << 14)
#define RCC_APB1RSTR_WWDGRST (1u << 11)
#define RCC_APB1RSTR_TIM6RST (1u << 4)
#define RCC_APB1RSTR_TIM2RST (1u << 0)
#define RCC_APB1RSTR_TIM3RST (1u << 1)
#define RCC_APB1RSTR_TIM7RST (1u << 5)
#define RCC_APB1RSTR_USART4RST (1u << 19)
#define RCC_APB1RSTR_USART5RST (1u << 20)
#define RCC_APB1RSTR_CRCRST (1u << 27)
#define RCC_APB1RSTR_I2C3 (1u << 30)
#define RCC_IOPENR_IOPHEN (1u << 7)
#define RCC_IOPENR_IOPDEN (1u << 3)
#define RCC_IOPENR_IOPCEN (1u << 2)
#define RCC_IOPENR_IOPBEN (1u << 1)
#define RCC_IOPENR_IOPAEN (1u << 0)
#define RCC_IOPENR_IOPEEN (1u << 4)
#define RCC_AHBENR_CRYPEN (1u << 24)
#define RCC_AHBENR_CRCEN (1u << 12)
#define RCC_AHBENR_MIFEN (1u << 8)
#define RCC_AHBENR_DMAEN (1u << 0)
#define RCC_APB2ENR_DBGEN (1u << 22)
#define RCC_APB2ENR_USART1EN (1u << 14)
#define RCC_APB2ENR_SPI1EN (1u << 12)
#define RCC_APB2ENR_ADCEN (1u << 9)
#define RCC_APB2ENR_FWEN (1u << 7)
#define RCC_APB2ENR_TIM22EN (1u << 5)
#define RCC_APB2ENR_TIM21EN (1u << 2)
#define RCC_APB2ENR_SYSCFGEN (1u << 0)
#define RCC_APB1ENR_LPTIM1EN (1u << 31)
#define RCC_APB1ENR_PWREN (1u << 28)
#define RCC_APB1ENR_I2C2EN (1u << 22)
#define RCC_APB1ENR_I2C1EN (1u << 21)
#define RCC_APB1ENR_LPUART1EN (1u << 18)
#define RCC_APB1ENR_USART2EN (1u << 17)
#define RCC_APB1ENR_SPI2EN (1u << 14)
#define RCC_APB1ENR_WWDGEN (1u << 11)
#define RCC_APB1ENR_TIM6EN (1u << 4)
#define RCC_APB1ENR_TIM2EN (1u << 0)
#define RCC_APB1ENR_TIM3EN (1u << 2)
#define RCC_APB1ENR_TIM7EN (1u << 5)
#define RCC_APB1ENR_USART4EN (1u << 19)
#define RCC_APB1ENR_USART5EN (1u << 20)
#define RCC_APB1ENR_I2C3EN (1u << 30)
#define RCC_IOPSMEN_IOPHSMEN (1u << 7)
#define RCC_IOPSMEN_IOPDSMEN (1u << 3)
#define RCC_IOPSMEN_IOPCSMEN (1u << 2)
#define RCC_IOPSMEN_IOPBSMEN (1u << 1)
#define RCC_IOPSMEN_IOPASMEN (1u << 0)
#define RCC_IOPSMEN_IOPESMEN (1u << 4)
#define RCC_AHBSMENR_CRYPTSMEN (1u << 24)
#define RCC_AHBSMENR_CRCSMEN (1u << 12)
#define RCC_AHBSMENR_SRAMSMEN (1u << 9)
#define RCC_AHBSMENR_MIFSMEN (1u << 8)
#define RCC_AHBSMENR_DMASMEN (1u << 0)
#define RCC_APB2SMENR_DBGSMEN (1u << 22)
#define RCC_APB2SMENR_USART1SMEN (1u << 14)
#define RCC_APB2SMENR_SPI1SMEN (1u << 12)
#define RCC_APB2SMENR_ADCSMEN (1u << 9)
#define RCC_APB2SMENR_TIM22SMEN (1u << 5)
#define RCC_APB2SMENR_TIM21SMEN (1u << 2)
#define RCC_APB2SMENR_SYSCFGSMEN (1u << 0)
#define RCC_APB1SMENR_LPTIM1SMEN (1u << 31)
#define RCC_APB1SMENR_PWRSMEN (1u << 28)
#define RCC_APB1SMENR_CRSSMEN (1u << 27)
#define RCC_APB1SMENR_I2C2SMEN (1u << 22)
#define RCC_APB1SMENR_I2C1SMEN (1u << 21)
#define RCC_APB1SMENR_LPUART1SMEN (1u << 18)
#define RCC_APB1SMENR_USART2SMEN (1u << 17)
#define RCC_APB1SMENR_SPI2SMEN (1u << 14)
#define RCC_APB1SMENR_WWDGSMEN (1u << 11)
#define RCC_APB1SMENR_TIM6SMEN (1u << 4)
#define RCC_APB1SMENR_TIM2SMEN (1u << 0)
#define RCC_APB1SMENR_TIM3SMEN (1u << 1)
#define RCC_APB1SMENR_TIM7SMEN (1u << 5)
#define RCC_APB1SMENR_USART4SMEN (1u << 19)
#define RCC_APB1SMENR_USART5SMEN (1u << 20)
#define RCC_APB1SMENR_I2C3SMEN (1u << 30)
#define RCC_CCIPR_LPTIM1SEL1 (1u << 19)
#define RCC_CCIPR_LPTIM1SEL0 (1u << 18)
#define RCC_CCIPR_I2C1SEL1 (1u << 13)
#define RCC_CCIPR_I2C1SEL0 (1u << 12)
#define RCC_CCIPR_LPUART1SEL1 (1u << 11)
#define RCC_CCIPR_LPUART1SEL0 (1u << 10)
#define RCC_CCIPR_USART2SEL1 (1u << 3)
#define RCC_CCIPR_USART2SEL0 (1u << 2)
#define RCC_CCIPR_USART1SEL1 (1u << 1)
#define RCC_CCIPR_USART1SEL0 (1u << 0)
#define RCC_CCIPR_I2C3SEL0 (1u << 16)
#define RCC_CCIPR_I2C3SEL1 (1u << 17)
#define RCC_CSR_LPWRSTF (1u << 31)
#define RCC_CSR_WWDGRSTF (1u << 30)
#define RCC_CSR_IWDGRSTF (1u << 29)
#define RCC_CSR_SFTRSTF (1u << 28)
#define RCC_CSR_PORRSTF (1u << 27)
#define RCC_CSR_PINRSTF (1u << 26)
#define RCC_CSR_OBLRSTF (1u << 25)
#define RCC_CSR_FWRSTF (1u << 24)
#define RCC_CSR_RTCRST (1u << 19)
#define RCC_CSR_RTCEN (1u << 18)
#define RCC_CSR_RTCSEL_LSB   16
#define RCC_CSR_RTCSEL_WIDTH 2
#define RCC_CSR_RTCSEL_MASK  (0x30000u)
#define RCC_CSR_CSSLSED (1u << 14)
#define RCC_CSR_CSSLSEON (1u << 13)
#define RCC_CSR_LSEDRV_LSB   11
#define RCC_CSR_LSEDRV_WIDTH 2
#define RCC_CSR_LSEDRV_MASK  (0x1800u)
#define RCC_CSR_LSEBYP (1u << 10)
#define RCC_CSR_LSERDY (1u << 9)
#define RCC_CSR_LSEON (1u << 8)
#define RCC_CSR_LSIRDY (1u << 1)
#define RCC_CSR_LSION (1u << 0)
#define RCC_CSR_LSIIWDGLP (1u << 2)
#define RCC_CSR_RMVF (1u << 23)

/* === SYSCFG_COMP ================================= */
typedef struct {
    volatile uint32_t CFGR1; /* 0x000 */
    volatile uint32_t CFGR2; /* 0x004 */
    volatile uint32_t EXTICR1; /* 0x008 */
    volatile uint32_t EXTICR2; /* 0x00C */
    volatile uint32_t EXTICR3; /* 0x010 */
    volatile uint32_t EXTICR4; /* 0x014 */
    volatile uint32_t COMP1_CSR; /* 0x018 */
    volatile uint32_t COMP2_CSR; /* 0x01C */
    volatile uint32_t CFGR3; /* 0x020 */
} SYSCFG_COMP_Type;

#define SYSCFG_COMP_BASE 0x40010000u
#define SYSCFG_COMP ((volatile SYSCFG_COMP_Type*)SYSCFG_COMP_BASE)

#define SYSCFG_COMP_CFGR1_BOOT_MODE_LSB   8
#define SYSCFG_COMP_CFGR1_BOOT_MODE_WIDTH 2
#define SYSCFG_COMP_CFGR1_BOOT_MODE_MASK  (0x300u)
#define SYSCFG_COMP_CFGR1_MEM_MODE_LSB   0
#define SYSCFG_COMP_CFGR1_MEM_MODE_WIDTH 2
#define SYSCFG_COMP_CFGR1_MEM_MODE_MASK  (0x3u)
#define SYSCFG_COMP_CFGR2_I2C2_FMP (1u << 13)
#define SYSCFG_COMP_CFGR2_I2C1_FMP (1u << 12)
#define SYSCFG_COMP_CFGR2_I2C_PB9_FMP (1u << 11)
#define SYSCFG_COMP_CFGR2_I2C_PB8_FMP (1u << 10)
#define SYSCFG_COMP_CFGR2_I2C_PB7_FMP (1u << 9)
#define SYSCFG_COMP_CFGR2_I2C_PB6_FMP (1u << 8)
#define SYSCFG_COMP_CFGR2_CAPA_LSB   1
#define SYSCFG_COMP_CFGR2_CAPA_WIDTH 3
#define SYSCFG_COMP_CFGR2_CAPA_MASK  (0xEu)
#define SYSCFG_COMP_CFGR2_FWDISEN (1u << 0)
#define SYSCFG_COMP_EXTICR1_EXTI3_LSB   12
#define SYSCFG_COMP_EXTICR1_EXTI3_WIDTH 4
#define SYSCFG_COMP_EXTICR1_EXTI3_MASK  (0xF000u)
#define SYSCFG_COMP_EXTICR1_EXTI2_LSB   8
#define SYSCFG_COMP_EXTICR1_EXTI2_WIDTH 4
#define SYSCFG_COMP_EXTICR1_EXTI2_MASK  (0xF00u)
#define SYSCFG_COMP_EXTICR1_EXTI1_LSB   4
#define SYSCFG_COMP_EXTICR1_EXTI1_WIDTH 4
#define SYSCFG_COMP_EXTICR1_EXTI1_MASK  (0xF0u)
#define SYSCFG_COMP_EXTICR1_EXTI0_LSB   0
#define SYSCFG_COMP_EXTICR1_EXTI0_WIDTH 4
#define SYSCFG_COMP_EXTICR1_EXTI0_MASK  (0xFu)
#define SYSCFG_COMP_EXTICR2_EXTI7_LSB   12
#define SYSCFG_COMP_EXTICR2_EXTI7_WIDTH 4
#define SYSCFG_COMP_EXTICR2_EXTI7_MASK  (0xF000u)
#define SYSCFG_COMP_EXTICR2_EXTI6_LSB   8
#define SYSCFG_COMP_EXTICR2_EXTI6_WIDTH 4
#define SYSCFG_COMP_EXTICR2_EXTI6_MASK  (0xF00u)
#define SYSCFG_COMP_EXTICR2_EXTI5_LSB   4
#define SYSCFG_COMP_EXTICR2_EXTI5_WIDTH 4
#define SYSCFG_COMP_EXTICR2_EXTI5_MASK  (0xF0u)
#define SYSCFG_COMP_EXTICR2_EXTI4_LSB   0
#define SYSCFG_COMP_EXTICR2_EXTI4_WIDTH 4
#define SYSCFG_COMP_EXTICR2_EXTI4_MASK  (0xFu)
#define SYSCFG_COMP_EXTICR3_EXTI11_LSB   12
#define SYSCFG_COMP_EXTICR3_EXTI11_WIDTH 4
#define SYSCFG_COMP_EXTICR3_EXTI11_MASK  (0xF000u)
#define SYSCFG_COMP_EXTICR3_EXTI10_LSB   8
#define SYSCFG_COMP_EXTICR3_EXTI10_WIDTH 4
#define SYSCFG_COMP_EXTICR3_EXTI10_MASK  (0xF00u)
#define SYSCFG_COMP_EXTICR3_EXTI9_LSB   4
#define SYSCFG_COMP_EXTICR3_EXTI9_WIDTH 4
#define SYSCFG_COMP_EXTICR3_EXTI9_MASK  (0xF0u)
#define SYSCFG_COMP_EXTICR3_EXTI8_LSB   0
#define SYSCFG_COMP_EXTICR3_EXTI8_WIDTH 4
#define SYSCFG_COMP_EXTICR3_EXTI8_MASK  (0xFu)
#define SYSCFG_COMP_EXTICR4_EXTI15_LSB   12
#define SYSCFG_COMP_EXTICR4_EXTI15_WIDTH 4
#define SYSCFG_COMP_EXTICR4_EXTI15_MASK  (0xF000u)
#define SYSCFG_COMP_EXTICR4_EXTI14_LSB   8
#define SYSCFG_COMP_EXTICR4_EXTI14_WIDTH 4
#define SYSCFG_COMP_EXTICR4_EXTI14_MASK  (0xF00u)
#define SYSCFG_COMP_EXTICR4_EXTI13_LSB   4
#define SYSCFG_COMP_EXTICR4_EXTI13_WIDTH 4
#define SYSCFG_COMP_EXTICR4_EXTI13_MASK  (0xF0u)
#define SYSCFG_COMP_EXTICR4_EXTI12_LSB   0
#define SYSCFG_COMP_EXTICR4_EXTI12_WIDTH 4
#define SYSCFG_COMP_EXTICR4_EXTI12_MASK  (0xFu)
#define SYSCFG_COMP_CFGR3_REF_LOCK (1u << 31)
#define SYSCFG_COMP_CFGR3_VREFINT_RDYF (1u << 30)
#define SYSCFG_COMP_CFGR3_VREFINT_COMP_RDYF (1u << 29)
#define SYSCFG_COMP_CFGR3_VREFINT_ADC_RDYF (1u << 28)
#define SYSCFG_COMP_CFGR3_SENSOR_ADC_RDYF (1u << 27)
#define SYSCFG_COMP_CFGR3_REF_RC48MHZ_RDYF (1u << 26)
#define SYSCFG_COMP_CFGR3_ENREF_RC48MHZ (1u << 13)
#define SYSCFG_COMP_CFGR3_ENBUF_VREFINT_COMP (1u << 12)
#define SYSCFG_COMP_CFGR3_ENBUF_SENSOR_ADC (1u << 9)
#define SYSCFG_COMP_CFGR3_ENBUF_BGAP_ADC (1u << 8)
#define SYSCFG_COMP_CFGR3_SEL_VREF_OUT_LSB   4
#define SYSCFG_COMP_CFGR3_SEL_VREF_OUT_WIDTH 2
#define SYSCFG_COMP_CFGR3_SEL_VREF_OUT_MASK  (0x30u)
#define SYSCFG_COMP_CFGR3_EN_BGAP (1u << 0)
#define SYSCFG_COMP_COMP1_CSR_COMP1EN (1u << 0)
#define SYSCFG_COMP_COMP1_CSR_COMP1INNSEL_LSB   4
#define SYSCFG_COMP_COMP1_CSR_COMP1INNSEL_WIDTH 2
#define SYSCFG_COMP_COMP1_CSR_COMP1INNSEL_MASK  (0x30u)
#define SYSCFG_COMP_COMP1_CSR_COMP1WM (1u << 8)
#define SYSCFG_COMP_COMP1_CSR_COMP1LPTIMIN1 (1u << 12)
#define SYSCFG_COMP_COMP1_CSR_COMP1POLARITY (1u << 15)
#define SYSCFG_COMP_COMP1_CSR_COMP1VALUE (1u << 30)
#define SYSCFG_COMP_COMP1_CSR_COMP1LOCK (1u << 31)
#define SYSCFG_COMP_COMP2_CSR_COMP2EN (1u << 0)
#define SYSCFG_COMP_COMP2_CSR_COMP2SPEED (1u << 3)
#define SYSCFG_COMP_COMP2_CSR_COMP2INNSEL_LSB   4
#define SYSCFG_COMP_COMP2_CSR_COMP2INNSEL_WIDTH 3
#define SYSCFG_COMP_COMP2_CSR_COMP2INNSEL_MASK  (0x70u)
#define SYSCFG_COMP_COMP2_CSR_COMP2INPSEL_LSB   8
#define SYSCFG_COMP_COMP2_CSR_COMP2INPSEL_WIDTH 3
#define SYSCFG_COMP_COMP2_CSR_COMP2INPSEL_MASK  (0x700u)
#define SYSCFG_COMP_COMP2_CSR_COMP2LPTIMIN2 (1u << 12)
#define SYSCFG_COMP_COMP2_CSR_COMP2LPTIMIN1 (1u << 13)
#define SYSCFG_COMP_COMP2_CSR_COMP2POLARITY (1u << 15)
#define SYSCFG_COMP_COMP2_CSR_COMP2VALUE (1u << 30)
#define SYSCFG_COMP_COMP2_CSR_COMP2LOCK (1u << 31)

/* === SPI1 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SR; /* 0x008 */
    volatile uint32_t DR; /* 0x00C */
    volatile uint32_t CRCPR; /* 0x010 */
    volatile uint32_t RXCRCR; /* 0x014 */
    volatile uint32_t TXCRCR; /* 0x018 */
    volatile uint32_t I2SCFGR; /* 0x01C */
    volatile uint32_t I2SPR; /* 0x020 */
} SPI1_Type;

#define SPI1_BASE 0x40013000u
#define SPI1 ((volatile SPI1_Type*)SPI1_BASE)

