Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define SPI1_CR1_BIDIMODE (1u << 15)
#define SPI1_CR1_BIDIOE (1u << 14)
#define SPI1_CR1_CRCEN (1u << 13)
#define SPI1_CR1_CRCNEXT (1u << 12)
#define SPI1_CR1_DFF (1u << 11)
#define SPI1_CR1_RXONLY (1u << 10)
#define SPI1_CR1_SSM (1u << 9)
#define SPI1_CR1_SSI (1u << 8)
#define SPI1_CR1_LSBFIRST (1u << 7)
#define SPI1_CR1_SPE (1u << 6)
#define SPI1_CR1_BR_LSB   3
#define SPI1_CR1_BR_WIDTH 3
#define SPI1_CR1_BR_MASK  (0x38u)
#define SPI1_CR1_MSTR (1u << 2)
#define SPI1_CR1_CPOL (1u << 1)
#define SPI1_CR1_CPHA (1u << 0)
#define SPI1_CR2_RXDMAEN (1u << 0)
#define SPI1_CR2_TXDMAEN (1u << 1)
#define SPI1_CR2_SSOE (1u << 2)
#define SPI1_CR2_FRF (1u << 4)
#define SPI1_CR2_ERRIE (1u << 5)
#define SPI1_CR2_RXNEIE (1u << 6)
#define SPI1_CR2_TXEIE (1u << 7)
#define SPI1_SR_RXNE (1u << 0)
#define SPI1_SR_TXE (1u << 1)
#define SPI1_SR_CHSIDE (1u << 2)
#define SPI1_SR_UDR (1u << 3)
#define SPI1_SR_CRCERR (1u << 4)
#define SPI1_SR_MODF (1u << 5)
#define SPI1_SR_OVR (1u << 6)
#define SPI1_SR_BSY (1u << 7)
#define SPI1_SR_TIFRFE (1u << 8)
#define SPI1_DR_DR_LSB   0
#define SPI1_DR_DR_WIDTH 16
#define SPI1_DR_DR_MASK  (0xFFFFu)
#define SPI1_CRCPR_CRCPOLY_LSB   0
#define SPI1_CRCPR_CRCPOLY_WIDTH 16
#define SPI1_CRCPR_CRCPOLY_MASK  (0xFFFFu)
#define SPI1_RXCRCR_RXCRC_LSB   0
#define SPI1_RXCRCR_RXCRC_WIDTH 16
#define SPI1_RXCRCR_RXCRC_MASK  (0xFFFFu)
#define SPI1_TXCRCR_TXCRC_LSB   0
#define SPI1_TXCRCR_TXCRC_WIDTH 16
#define SPI1_TXCRCR_TXCRC_MASK  (0xFFFFu)
#define SPI1_I2SCFGR_I2SMOD (1u << 11)
#define SPI1_I2SCFGR_I2SE (1u << 10)
#define SPI1_I2SCFGR_I2SCFG_LSB   8
#define SPI1_I2SCFGR_I2SCFG_WIDTH 2
#define SPI1_I2SCFGR_I2SCFG_MASK  (0x300u)
#define SPI1_I2SCFGR_PCMSYNC (1u << 7)
#define SPI1_I2SCFGR_I2SSTD_LSB   4
#define SPI1_I2SCFGR_I2SSTD_WIDTH 2
#define SPI1_I2SCFGR_I2SSTD_MASK  (0x30u)
#define SPI1_I2SCFGR_CKPOL (1u << 3)
#define SPI1_I2SCFGR_DATLEN_LSB   1
#define SPI1_I2SCFGR_DATLEN_WIDTH 2
#define SPI1_I2SCFGR_DATLEN_MASK  (0x6u)
#define SPI1_I2SCFGR_CHLEN (1u << 0)
#define SPI1_I2SPR_MCKOE (1u << 9)
#define SPI1_I2SPR_ODD (1u << 8)
#define SPI1_I2SPR_I2SDIV_LSB   0
#define SPI1_I2SPR_I2SDIV_WIDTH 8
#define SPI1_I2SPR_I2SDIV_MASK  (0xFFu)

/* === SPI2 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SR; /* 0x008 */
    volatile uint32_t DR; /* 0x00C */
    volatile uint32_t CRCPR; /* 0x010 */
    volatile uint32_t RXCRCR; /* 0x014 */
    volatile uint32_t TXCRCR; /* 0x018 */
    volatile uint32_t I2SCFGR; /* 0x01C */
    volatile uint32_t I2SPR; /* 0x020 */
} SPI2_Type;

#define SPI2_BASE 0x40003800u
#define SPI2 ((volatile SPI2_Type*)SPI2_BASE)

#define SPI2_CR1_BIDIMODE (1u << 15)
#define SPI2_CR1_BIDIOE (1u << 14)
#define SPI2_CR1_CRCEN (1u << 13)
#define SPI2_CR1_CRCNEXT (1u << 12)
#define SPI2_CR1_DFF (1u << 11)
#define SPI2_CR1_RXONLY (1u << 10)
#define SPI2_CR1_SSM (1u << 9)
#define SPI2_CR1_SSI (1u << 8)
#define SPI2_CR1_LSBFIRST (1u << 7)
#define SPI2_CR1_SPE (1u << 6)
#define SPI2_CR1_BR_LSB   3
#define SPI2_CR1_BR_WIDTH 3
#define SPI2_CR1_BR_MASK  (0x38u)
#define SPI2_CR1_MSTR (1u << 2)
#define SPI2_CR1_CPOL (1u << 1)
#define SPI2_CR1_CPHA (1u << 0)
#define SPI2_CR2_RXDMAEN (1u << 0)
#define SPI2_CR2_TXDMAEN (1u << 1)
#define SPI2_CR2_SSOE (1u << 2)
#define SPI2_CR2_FRF (1u << 4)
#define SPI2_CR2_ERRIE (1u << 5)
#define SPI2_CR2_RXNEIE (1u << 6)
#define SPI2_CR2_TXEIE (1u << 7)
#define SPI2_SR_RXNE (1u << 0)
#define SPI2_SR_TXE (1u << 1)
#define SPI2_SR_CHSIDE (1u << 2)
#define SPI2_SR_UDR (1u << 3)
#define SPI2_SR_CRCERR (1u << 4)
#define SPI2_SR_MODF (1u << 5)
#define SPI2_SR_OVR (1u << 6)
#define SPI2_SR_BSY (1u << 7)
#define SPI2_SR_TIFRFE (1u << 8)
#define SPI2_DR_DR_LSB   0
#define SPI2_DR_DR_WIDTH 16
#define SPI2_DR_DR_MASK  (0xFFFFu)
#define SPI2_CRCPR_CRCPOLY_LSB   0
#define SPI2_CRCPR_CRCPOLY_WIDTH 16
#define SPI2_CRCPR_CRCPOLY_MASK  (0xFFFFu)
#define SPI2_RXCRCR_RXCRC_LSB   0
#define SPI2_RXCRCR_RXCRC_WIDTH 16
#define SPI2_RXCRCR_RXCRC_MASK  (0xFFFFu)
#define SPI2_TXCRCR_TXCRC_LSB   0
#define SPI2_TXCRCR_TXCRC_WIDTH 16
#define SPI2_TXCRCR_TXCRC_MASK  (0xFFFFu)
#define SPI2_I2SCFGR_I2SMOD (1u << 11)
#define SPI2_I2SCFGR_I2SE (1u << 10)
#define SPI2_I2SCFGR_I2SCFG_LSB   8
#define SPI2_I2SCFGR_I2SCFG_WIDTH 2
#define SPI2_I2SCFGR_I2SCFG_MASK  (0x300u)
#define SPI2_I2SCFGR_PCMSYNC (1u << 7)
#define SPI2_I2SCFGR_I2SSTD_LSB   4
#define SPI2_I2SCFGR_I2SSTD_WIDTH 2
#define SPI2_I2SCFGR_I2SSTD_MASK  (0x30u)
#define SPI2_I2SCFGR_CKPOL (1u << 3)
#define SPI2_I2SCFGR_DATLEN_LSB   1
#define SPI2_I2SCFGR_DATLEN_WIDTH 2
#define SPI2_I2SCFGR_DATLEN_MASK  (0x6u)
#define SPI2_I2SCFGR_CHLEN (1u << 0)
#define SPI2_I2SPR_MCKOE (1u << 9)
#define SPI2_I2SPR_ODD (1u << 8)
#define SPI2_I2SPR_I2SDIV_LSB   0
#define SPI2_I2SPR_I2SDIV_WIDTH 8
#define SPI2_I2SPR_I2SDIV_MASK  (0xFFu)

/* === I2C1 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t OAR1; /* 0x008 */
    volatile uint32_t OAR2; /* 0x00C */
    volatile uint32_t TIMINGR; /* 0x010 */
    volatile uint32_t TIMEOUTR; /* 0x014 */
    volatile uint32_t ISR; /* 0x018 */
    volatile uint32_t ICR; /* 0x01C */
    volatile uint32_t PECR; /* 0x020 */
    volatile uint32_t RXDR; /* 0x024 */
    volatile uint32_t TXDR; /* 0x028 */
} I2C1_Type;

#define I2C1_BASE 0x40005400u
#define I2C1 ((volatile I2C1_Type*)I2C1_BASE)

#define I2C1_CR1_PE (1u << 0)
#define I2C1_CR1_TXIE (1u << 1)
#define I2C1_CR1_RXIE (1u << 2)
#define I2C1_CR1_ADDRIE (1u << 3)
#define I2C1_CR1_NACKIE (1u << 4)
#define I2C1_CR1_STOPIE (1u << 5)
#define I2C1_CR1_TCIE (1u << 6)
#define I2C1_CR1_ERRIE (1u << 7)
#define I2C1_CR1_DNF_LSB   8
#define I2C1_CR1_DNF_WIDTH 4
#define I2C1_CR1_DNF_MASK  (0xF00u)
#define I2C1_CR1_ANFOFF (1u << 12)
#define I2C1_CR1_TXDMAEN (1u << 14)
#define I2C1_CR1_RXDMAEN (1u << 15)
#define I2C1_CR1_SBC (1u << 16)
#define I2C1_CR1_NOSTRETCH (1u << 17)
#define I2C1_CR1_WUPEN (1u << 18)
#define I2C1_CR1_GCEN (1u << 19)
#define I2C1_CR1_SMBHEN (1u << 20)
#define I2C1_CR1_SMBDEN (1u << 21)
#define I2C1_CR1_ALERTEN (1u << 22)
#define I2C1_CR1_PECEN (1u << 23)
#define I2C1_CR2_PECBYTE (1u << 26)
#define I2C1_CR2_AUTOEND (1u << 25)
#define I2C1_CR2_RELOAD (1u << 24)
#define I2C1_CR2_NBYTES_LSB   16
#define I2C1_CR2_NBYTES_WIDTH 8
#define I2C1_CR2_NBYTES_MASK  (0xFF0000u)
#define I2C1_CR2_NACK (1u << 15)
#define I2C1_CR2_STOP (1u << 14)
#define I2C1_CR2_START (1u << 13)
#define I2C1_CR2_HEAD10R (1u << 12)
#define I2C1_CR2_ADD10 (1u << 11)
#define I2C1_CR2_RD_WRN (1u << 10)
#define I2C1_CR2_SADD_LSB   0
#define I2C1_CR2_SADD_WIDTH 10
#define I2C1_CR2_SADD_MASK  (0x3FFu)
#define I2C1_OAR1_OA1_LSB   0
#define I2C1_OAR1_OA1_WIDTH 10
#define I2C1_OAR1_OA1_MASK  (0x3FFu)
#define I2C1_OAR1_OA1MODE (1u << 10)
#define I2C1_OAR1_OA1EN (1u << 15)
#define I2C1_OAR2_OA2_LSB   1
#define I2C1_OAR2_OA2_WIDTH 7
#define I2C1_OAR2_OA2_MASK  (0xFEu)
#define I2C1_OAR2_OA2MSK_LSB   8
#define I2C1_OAR2_OA2MSK_WIDTH 3
#define I2C1_OAR2_OA2MSK_MASK  (0x700u)
#define I2C1_OAR2_OA2EN (1u << 15)
#define I2C1_TIMINGR_SCLL_LSB   0
#define I2C1_TIMINGR_SCLL_WIDTH 8
#define I2C1_TIMINGR_SCLL_MASK  (0xFFu)
#define I2C1_TIMINGR_SCLH_LSB   8
#define I2C1_TIMINGR_SCLH_WIDTH 8
#define I2C1_TIMINGR_SCLH_MASK  (0xFF00u)
#define I2C1_TIMINGR_SDADEL_LSB   16
#define I2C1_TIMINGR_SDADEL_WIDTH 4
#define I2C1_TIMINGR_SDADEL_MASK  (0xF0000u)
#define I2C1_TIMINGR_SCLDEL_LSB   20
#define I2C1_TIMINGR_SCLDEL_WIDTH 4
#define I2C1_TIMINGR_SCLDEL_MASK  (0xF00000u)
#define I2C1_TIMINGR_PRESC_LSB   28
#define I2C1_TIMINGR_PRESC_WIDTH 4
#define I2C1_TIMINGR_PRESC_MASK  (0xF0000000u)
#define I2C1_TIMEOUTR_TIMEOUTA_LSB   0
#define I2C1_TIMEOUTR_TIMEOUTA_WIDTH 12
#define I2C1_TIMEOUTR_TIMEOUTA_MASK  (0xFFFu)
#define I2C1_TIMEOUTR_TIDLE (1u << 12)
#define I2C1_TIMEOUTR_TIMOUTEN (1u << 15)
#define I2C1_TIMEOUTR_TIMEOUTB_LSB   16
#define I2C1_TIMEOUTR_TIMEOUTB_WIDTH 12
#define I2C1_TIMEOUTR_TIMEOUTB_MASK  (0xFFF0000u)
#define I2C1_TIMEOUTR_TEXTEN (1u << 31)
#define I2C1_ISR_ADDCODE_LSB   17
#define I2C1_ISR_ADDCODE_WIDTH 7
#define I2C1_ISR_ADDCODE_MASK  (0xFE0000u)
#define I2C1_ISR_DIR (1u << 16)
#define I2C1_ISR_BUSY (1u << 15)
#define I2C1_ISR_ALERT (1u << 13)
#define I2C1_ISR_TIMEOUT (1u << 12)
#define I2C1_ISR_PECERR (1u << 11)
#define I2C1_ISR_OVR (1u << 10)
#define I2C1_ISR_ARLO (1u << 9)
#define I2C1_ISR_BERR (1u << 8)
#define I2C1_ISR_TCR (1u << 7)
#define I2C1_ISR_TC (1u << 6)
#define I2C1_ISR_STOPF (1u << 5)
#define I2C1_ISR_NACKF (1u << 4)
#define I2C1_ISR_ADDR (1u << 3)
#define I2C1_ISR_RXNE (1u << 2)
#define I2C1_ISR_TXIS (1u << 1)
#define I2C1_ISR_TXE (1u << 0)
#define I2C1_ICR_ALERTCF (1u << 13)
#define I2C1_ICR_TIMOUTCF (1u << 12)
#define I2C1_ICR_PECCF (1u << 11)
#define I2C1_ICR_OVRCF (1u << 10)
#define I2C1_ICR_ARLOCF (1u << 9)
#define I2C1_ICR_BERRCF (1u << 8)
#define I2C1_ICR_STOPCF (1u << 5)
#define I2C1_ICR_NACKCF (1u << 4)
#define I2C1_ICR_ADDRCF (1u << 3)
#define I2C1_PECR_PEC_LSB   0
#define I2C1_PECR_PEC_WIDTH 8
#define I2C1_PECR_PEC_MASK  (0xFFu)
#define I2C1_RXDR_RXDATA_LSB   0
#define I2C1_RXDR_RXDATA_WIDTH 8
#define I2C1_RXDR_RXDATA_MASK  (0xFFu)
#define I2C1_TXDR_TXDATA_LSB   0
#define I2C1_TXDR_TXDATA_WIDTH 8
#define I2C1_TXDR_TXDATA_MASK  (0xFFu)

