Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
/* === I2C2 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t OAR1; /* 0x008 */
    volatile uint32_t OAR2; /* 0x00C */
    volatile uint32_t TIMINGR; /* 0x010 */
    volatile uint32_t TIMEOUTR; /* 0x014 */
    volatile uint32_t ISR; /* 0x018 */
    volatile uint32_t ICR; /* 0x01C */
    volatile uint32_t PECR; /* 0x020 */
    volatile uint32_t RXDR; /* 0x024 */
    volatile uint32_t TXDR; /* 0x028 */
} I2C2_Type;

#define I2C2_BASE 0x40005800u
#define I2C2 ((volatile I2C2_Type*)I2C2_BASE)

#define I2C2_CR1_PE (1u << 0)
#define I2C2_CR1_TXIE (1u << 1)
#define I2C2_CR1_RXIE (1u << 2)
#define I2C2_CR1_ADDRIE (1u << 3)
#define I2C2_CR1_NACKIE (1u << 4)
#define I2C2_CR1_STOPIE (1u << 5)
#define I2C2_CR1_TCIE (1u << 6)
#define I2C2_CR1_ERRIE (1u << 7)
#define I2C2_CR1_DNF_LSB   8
#define I2C2_CR1_DNF_WIDTH 4
#define I2C2_CR1_DNF_MASK  (0xF00u)
#define I2C2_CR1_ANFOFF (1u << 12)
#define I2C2_CR1_TXDMAEN (1u << 14)
#define I2C2_CR1_RXDMAEN (1u << 15)
#define I2C2_CR1_SBC (1u << 16)
#define I2C2_CR1_NOSTRETCH (1u << 17)
#define I2C2_CR1_WUPEN (1u << 18)
#define I2C2_CR1_GCEN (1u << 19)
#define I2C2_CR1_SMBHEN (1u << 20)
#define I2C2_CR1_SMBDEN (1u << 21)
#define I2C2_CR1_ALERTEN (1u << 22)
#define I2C2_CR1_PECEN (1u << 23)
#define I2C2_CR2_PECBYTE (1u << 26)
#define I2C2_CR2_AUTOEND (1u << 25)
#define I2C2_CR2_RELOAD (1u << 24)
#define I2C2_CR2_NBYTES_LSB   16
#define I2C2_CR2_NBYTES_WIDTH 8
#define I2C2_CR2_NBYTES_MASK  (0xFF0000u)
#define I2C2_CR2_NACK (1u << 15)
#define I2C2_CR2_STOP (1u << 14)
#define I2C2_CR2_START (1u << 13)
#define I2C2_CR2_HEAD10R (1u << 12)
#define I2C2_CR2_ADD10 (1u << 11)
#define I2C2_CR2_RD_WRN (1u << 10)
#define I2C2_CR2_SADD_LSB   0
#define I2C2_CR2_SADD_WIDTH 10
#define I2C2_CR2_SADD_MASK  (0x3FFu)
#define I2C2_OAR1_OA1_LSB   0
#define I2C2_OAR1_OA1_WIDTH 10
#define I2C2_OAR1_OA1_MASK  (0x3FFu)
#define I2C2_OAR1_OA1MODE (1u << 10)
#define I2C2_OAR1_OA1EN (1u << 15)
#define I2C2_OAR2_OA2_LSB   1
#define I2C2_OAR2_OA2_WIDTH 7
#define I2C2_OAR2_OA2_MASK  (0xFEu)
#define I2C2_OAR2_OA2MSK_LSB   8
#define I2C2_OAR2_OA2MSK_WIDTH 3
#define I2C2_OAR2_OA2MSK_MASK  (0x700u)
#define I2C2_OAR2_OA2EN (1u << 15)
#define I2C2_TIMINGR_SCLL_LSB   0
#define I2C2_TIMINGR_SCLL_WIDTH 8
#define I2C2_TIMINGR_SCLL_MASK  (0xFFu)
#define I2C2_TIMINGR_SCLH_LSB   8
#define I2C2_TIMINGR_SCLH_WIDTH 8
#define I2C2_TIMINGR_SCLH_MASK  (0xFF00u)
#define I2C2_TIMINGR_SDADEL_LSB   16
#define I2C2_TIMINGR_SDADEL_WIDTH 4
#define I2C2_TIMINGR_SDADEL_MASK  (0xF0000u)
#define I2C2_TIMINGR_SCLDEL_LSB   20
#define I2C2_TIMINGR_SCLDEL_WIDTH 4
#define I2C2_TIMINGR_SCLDEL_MASK  (0xF00000u)
#define I2C2_TIMINGR_PRESC_LSB   28
#define I2C2_TIMINGR_PRESC_WIDTH 4
#define I2C2_TIMINGR_PRESC_MASK  (0xF0000000u)
#define I2C2_TIMEOUTR_TIMEOUTA_LSB   0
#define I2C2_TIMEOUTR_TIMEOUTA_WIDTH 12
#define I2C2_TIMEOUTR_TIMEOUTA_MASK  (0xFFFu)
#define I2C2_TIMEOUTR_TIDLE (1u << 12)
#define I2C2_TIMEOUTR_TIMOUTEN (1u << 15)
#define I2C2_TIMEOUTR_TIMEOUTB_LSB   16
#define I2C2_TIMEOUTR_TIMEOUTB_WIDTH 12
#define I2C2_TIMEOUTR_TIMEOUTB_MASK  (0xFFF0000u)
#define I2C2_TIMEOUTR_TEXTEN (1u << 31)
#define I2C2_ISR_ADDCODE_LSB   17
#define I2C2_ISR_ADDCODE_WIDTH 7
#define I2C2_ISR_ADDCODE_MASK  (0xFE0000u)
#define I2C2_ISR_DIR (1u << 16)
#define I2C2_ISR_BUSY (1u << 15)
#define I2C2_ISR_ALERT (1u << 13)
#define I2C2_ISR_TIMEOUT (1u << 12)
#define I2C2_ISR_PECERR (1u << 11)
#define I2C2_ISR_OVR (1u << 10)
#define I2C2_ISR_ARLO (1u << 9)
#define I2C2_ISR_BERR (1u << 8)
#define I2C2_ISR_TCR (1u << 7)
#define I2C2_ISR_TC (1u << 6)
#define I2C2_ISR_STOPF (1u << 5)
#define I2C2_ISR_NACKF (1u << 4)
#define I2C2_ISR_ADDR (1u << 3)
#define I2C2_ISR_RXNE (1u << 2)
#define I2C2_ISR_TXIS (1u << 1)
#define I2C2_ISR_TXE (1u << 0)
#define I2C2_ICR_ALERTCF (1u << 13)
#define I2C2_ICR_TIMOUTCF (1u << 12)
#define I2C2_ICR_PECCF (1u << 11)
#define I2C2_ICR_OVRCF (1u << 10)
#define I2C2_ICR_ARLOCF (1u << 9)
#define I2C2_ICR_BERRCF (1u << 8)
#define I2C2_ICR_STOPCF (1u << 5)
#define I2C2_ICR_NACKCF (1u << 4)
#define I2C2_ICR_ADDRCF (1u << 3)
#define I2C2_PECR_PEC_LSB   0
#define I2C2_PECR_PEC_WIDTH 8
#define I2C2_PECR_PEC_MASK  (0xFFu)
#define I2C2_RXDR_RXDATA_LSB   0
#define I2C2_RXDR_RXDATA_WIDTH 8
#define I2C2_RXDR_RXDATA_MASK  (0xFFu)
#define I2C2_TXDR_TXDATA_LSB   0
#define I2C2_TXDR_TXDATA_WIDTH 8
#define I2C2_TXDR_TXDATA_MASK  (0xFFu)

/* === I2C3 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t OAR1; /* 0x008 */
    volatile uint32_t OAR2; /* 0x00C */
    volatile uint32_t TIMINGR; /* 0x010 */
    volatile uint32_t TIMEOUTR; /* 0x014 */
    volatile uint32_t ISR; /* 0x018 */
    volatile uint32_t ICR; /* 0x01C */
    volatile uint32_t PECR; /* 0x020 */
    volatile uint32_t RXDR; /* 0x024 */
    volatile uint32_t TXDR; /* 0x028 */
} I2C3_Type;

#define I2C3_BASE 0x40007800u
#define I2C3 ((volatile I2C3_Type*)I2C3_BASE)

#define I2C3_CR1_PE (1u << 0)
#define I2C3_CR1_TXIE (1u << 1)
#define I2C3_CR1_RXIE (1u << 2)
#define I2C3_CR1_ADDRIE (1u << 3)
#define I2C3_CR1_NACKIE (1u << 4)
#define I2C3_CR1_STOPIE (1u << 5)
#define I2C3_CR1_TCIE (1u << 6)
#define I2C3_CR1_ERRIE (1u << 7)
#define I2C3_CR1_DNF_LSB   8
#define I2C3_CR1_DNF_WIDTH 4
#define I2C3_CR1_DNF_MASK  (0xF00u)
#define I2C3_CR1_ANFOFF (1u << 12)
#define I2C3_CR1_TXDMAEN (1u << 14)
#define I2C3_CR1_RXDMAEN (1u << 15)
#define I2C3_CR1_SBC (1u << 16)
#define I2C3_CR1_NOSTRETCH (1u << 17)
#define I2C3_CR1_WUPEN (1u << 18)
#define I2C3_CR1_GCEN (1u << 19)
#define I2C3_CR1_SMBHEN (1u << 20)
#define I2C3_CR1_SMBDEN (1u << 21)
#define I2C3_CR1_ALERTEN (1u << 22)
#define I2C3_CR1_PECEN (1u << 23)
#define I2C3_CR2_PECBYTE (1u << 26)
#define I2C3_CR2_AUTOEND (1u << 25)
#define I2C3_CR2_RELOAD (1u << 24)
#define I2C3_CR2_NBYTES_LSB   16
#define I2C3_CR2_NBYTES_WIDTH 8
#define I2C3_CR2_NBYTES_MASK  (0xFF0000u)
#define I2C3_CR2_NACK (1u << 15)
#define I2C3_CR2_STOP (1u << 14)
#define I2C3_CR2_START (1u << 13)
#define I2C3_CR2_HEAD10R (1u << 12)
#define I2C3_CR2_ADD10 (1u << 11)
#define I2C3_CR2_RD_WRN (1u << 10)
#define I2C3_CR2_SADD_LSB   0
#define I2C3_CR2_SADD_WIDTH 10
#define I2C3_CR2_SADD_MASK  (0x3FFu)
#define I2C3_OAR1_OA1_LSB   0
#define I2C3_OAR1_OA1_WIDTH 10
#define I2C3_OAR1_OA1_MASK  (0x3FFu)
#define I2C3_OAR1_OA1MODE (1u << 10)
#define I2C3_OAR1_OA1EN (1u << 15)
#define I2C3_OAR2_OA2_LSB   1
#define I2C3_OAR2_OA2_WIDTH 7
#define I2C3_OAR2_OA2_MASK  (0xFEu)
#define I2C3_OAR2_OA2MSK_LSB   8
#define I2C3_OAR2_OA2MSK_WIDTH 3
#define I2C3_OAR2_OA2MSK_MASK  (0x700u)
#define I2C3_OAR2_OA2EN (1u << 15)
#define I2C3_TIMINGR_SCLL_LSB   0
#define I2C3_TIMINGR_SCLL_WIDTH 8
#define I2C3_TIMINGR_SCLL_MASK  (0xFFu)
#define I2C3_TIMINGR_SCLH_LSB   8
#define I2C3_TIMINGR_SCLH_WIDTH 8
#define I2C3_TIMINGR_SCLH_MASK  (0xFF00u)
#define I2C3_TIMINGR_SDADEL_LSB   16
#define I2C3_TIMINGR_SDADEL_WIDTH 4
#define I2C3_TIMINGR_SDADEL_MASK  (0xF0000u)
#define I2C3_TIMINGR_SCLDEL_LSB   20
#define I2C3_TIMINGR_SCLDEL_WIDTH 4
#define I2C3_TIMINGR_SCLDEL_MASK  (0xF00000u)
#define I2C3_TIMINGR_PRESC_LSB   28
#define I2C3_TIMINGR_PRESC_WIDTH 4
#define I2C3_TIMINGR_PRESC_MASK  (0xF0000000u)
#define I2C3_TIMEOUTR_TIMEOUTA_LSB   0
#define I2C3_TIMEOUTR_TIMEOUTA_WIDTH 12
#define I2C3_TIMEOUTR_TIMEOUTA_MASK  (0xFFFu)
#define I2C3_TIMEOUTR_TIDLE (1u << 12)
#define I2C3_TIMEOUTR_TIMOUTEN (1u << 15)
#define I2C3_TIMEOUTR_TIMEOUTB_LSB   16
#define I2C3_TIMEOUTR_TIMEOUTB_WIDTH 12
#define I2C3_TIMEOUTR_TIMEOUTB_MASK  (0xFFF0000u)
#define I2C3_TIMEOUTR_TEXTEN (1u << 31)
#define I2C3_ISR_ADDCODE_LSB   17
#define I2C3_ISR_ADDCODE_WIDTH 7
#define I2C3_ISR_ADDCODE_MASK  (0xFE0000u)
#define I2C3_ISR_DIR (1u << 16)
#define I2C3_ISR_BUSY (1u << 15)
#define I2C3_ISR_ALERT (1u << 13)
#define I2C3_ISR_TIMEOUT (1u << 12)
#define I2C3_ISR_PECERR (1u << 11)
#define I2C3_ISR_OVR (1u << 10)
#define I2C3_ISR_ARLO (1u << 9)
#define I2C3_ISR_BERR (1u << 8)
#define I2C3_ISR_TCR (1u << 7)
#define I2C3_ISR_TC (1u << 6)
#define I2C3_ISR_STOPF (1u << 5)
#define I2C3_ISR_NACKF (1u << 4)
#define I2C3_ISR_ADDR (1u << 3)
#define I2C3_ISR_RXNE (1u << 2)
#define I2C3_ISR_TXIS (1u << 1)
#define I2C3_ISR_TXE (1u << 0)
#define I2C3_ICR_ALERTCF (1u << 13)
#define I2C3_ICR_TIMOUTCF (1u << 12)
#define I2C3_ICR_PECCF (1u << 11)
#define I2C3_ICR_OVRCF (1u << 10)
#define I2C3_ICR_ARLOCF (1u << 9)
#define I2C3_ICR_BERRCF (1u << 8)
#define I2C3_ICR_STOPCF (1u << 5)
#define I2C3_ICR_NACKCF (1u << 4)
#define I2C3_ICR_ADDRCF (1u << 3)
#define I2C3_PECR_PEC_LSB   0
#define I2C3_PECR_PEC_WIDTH 8
#define I2C3_PECR_PEC_MASK  (0xFFu)
#define I2C3_RXDR_RXDATA_LSB   0
#define I2C3_RXDR_RXDATA_WIDTH 8
#define I2C3_RXDR_RXDATA_MASK  (0xFFu)
#define I2C3_TXDR_TXDATA_LSB   0
#define I2C3_TXDR_TXDATA_WIDTH 8
#define I2C3_TXDR_TXDATA_MASK  (0xFFu)

