Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
/* === PWR ================================= */
typedef struct {
    volatile uint32_t CR; /* 0x000 */
    volatile uint32_t CSR; /* 0x004 */
} PWR_Type;

#define PWR_BASE 0x40007000u
#define PWR ((volatile PWR_Type*)PWR_BASE)

#define PWR_CR_LPSDSR (1u << 0)
#define PWR_CR_PDDS (1u << 1)
#define PWR_CR_CWUF (1u << 2)
#define PWR_CR_CSBF (1u << 3)
#define PWR_CR_PVDE (1u << 4)
#define PWR_CR_PLS_LSB   5
#define PWR_CR_PLS_WIDTH 3
#define PWR_CR_PLS_MASK  (0xE0u)
#define PWR_CR_DBP (1u << 8)
#define PWR_CR_ULP (1u << 9)
#define PWR_CR_FWU (1u << 10)
#define PWR_CR_VOS_LSB   11
#define PWR_CR_VOS_WIDTH 2
#define PWR_CR_VOS_MASK  (0x1800u)
#define PWR_CR_DS_EE_KOFF (1u << 13)
#define PWR_CR_LPRUN (1u << 14)
#define PWR_CR_LPDS (1u << 16)
#define PWR_CSR_EWUP3 (1u << 10)
#define PWR_CSR_EWUP2 (1u << 9)
#define PWR_CSR_EWUP1 (1u << 8)
#define PWR_CSR_REGLPF (1u << 5)
#define PWR_CSR_VOSF (1u << 4)
#define PWR_CSR_VREFINTRDYF (1u << 3)
#define PWR_CSR_PVDO (1u << 2)
#define PWR_CSR_SBF (1u << 1)
#define PWR_CSR_WUF (1u << 0)

/* === Flash ================================= */
typedef struct {
    volatile uint32_t ACR; /* 0x000 */
    volatile uint32_t PECR; /* 0x004 */
    volatile uint32_t PDKEYR; /* 0x008 */
    volatile uint32_t PEKEYR; /* 0x00C */
    volatile uint32_t PRGKEYR; /* 0x010 */
    volatile uint32_t OPTKEYR; /* 0x014 */
    volatile uint32_t SR; /* 0x018 */
    volatile uint32_t OPTR; /* 0x01C */
    volatile uint32_t WRPROT1; /* 0x020 */
    uint8_t _res_0024[92];
    volatile uint32_t WRPROT2; /* 0x080 */
} Flash_Type;

#define FLASH_BASE 0x40022000u
#define FLASH ((volatile Flash_Type*)FLASH_BASE)

#define FLASH_ACR_LATENCY (1u << 0)
#define FLASH_ACR_PRFTEN (1u << 1)
#define FLASH_ACR_SLEEP_PD (1u << 3)
#define FLASH_ACR_RUN_PD (1u << 4)
#define FLASH_ACR_DISAB_BUF (1u << 5)
#define FLASH_ACR_PRE_READ (1u << 6)
#define FLASH_PECR_PELOCK (1u << 0)
#define FLASH_PECR_PRGLOCK (1u << 1)
#define FLASH_PECR_OPTLOCK (1u << 2)
#define FLASH_PECR_PROG (1u << 3)
#define FLASH_PECR_DATA (1u << 4)
#define FLASH_PECR_FIX (1u << 8)
#define FLASH_PECR_ERASE (1u << 9)
#define FLASH_PECR_FPRG (1u << 10)
#define FLASH_PECR_PARALLELBANK (1u << 15)
#define FLASH_PECR_EOPIE (1u << 16)
#define FLASH_PECR_ERRIE (1u << 17)
#define FLASH_PECR_OBL_LAUNCH (1u << 18)
#define FLASH_PECR_NZDISABLE (1u << 23)
#define FLASH_PDKEYR_PDKEYR_LSB   0
#define FLASH_PDKEYR_PDKEYR_WIDTH 32
#define FLASH_PDKEYR_PDKEYR_MASK  (0xFFFFFFFFu)
#define FLASH_PEKEYR_PEKEYR_LSB   0
#define FLASH_PEKEYR_PEKEYR_WIDTH 32
#define FLASH_PEKEYR_PEKEYR_MASK  (0xFFFFFFFFu)
#define FLASH_PRGKEYR_PRGKEYR_LSB   0
#define FLASH_PRGKEYR_PRGKEYR_WIDTH 32
#define FLASH_PRGKEYR_PRGKEYR_MASK  (0xFFFFFFFFu)
#define FLASH_OPTKEYR_OPTKEYR_LSB   0
#define FLASH_OPTKEYR_OPTKEYR_WIDTH 32
#define FLASH_OPTKEYR_OPTKEYR_MASK  (0xFFFFFFFFu)
#define FLASH_SR_BSY (1u << 0)
#define FLASH_SR_EOP (1u << 1)
#define FLASH_SR_ENDHV (1u << 2)
#define FLASH_SR_READY (1u << 3)
#define FLASH_SR_WRPERR (1u << 8)
#define FLASH_SR_PGAERR (1u << 9)
#define FLASH_SR_SIZERR (1u << 10)
#define FLASH_SR_OPTVERR (1u << 11)
#define FLASH_SR_RDERR (1u << 13)
#define FLASH_SR_NOTZEROERR (1u << 16)
#define FLASH_SR_FWWERR (1u << 17)
#define FLASH_OPTR_RDPROT_LSB   0
#define FLASH_OPTR_RDPROT_WIDTH 8
#define FLASH_OPTR_RDPROT_MASK  (0xFFu)
#define FLASH_OPTR_WPRMOD (1u << 8)
#define FLASH_OPTR_BOR_LEV_LSB   16
#define FLASH_OPTR_BOR_LEV_WIDTH 4
#define FLASH_OPTR_BOR_LEV_MASK  (0xF0000u)
#define FLASH_OPTR_WDG_SW (1u << 20)
#define FLASH_OPTR_NRST_STOP (1u << 21)
#define FLASH_OPTR_NRST_STDBY (1u << 22)
#define FLASH_OPTR_BFB2 (1u << 23)
#define FLASH_OPTR_NBOOT1 (1u << 31)
#define FLASH_WRPROT1_WRPROT1_LSB   0
#define FLASH_WRPROT1_WRPROT1_WIDTH 32
#define FLASH_WRPROT1_WRPROT1_MASK  (0xFFFFFFFFu)
#define FLASH_WRPROT2_WRPROT2_LSB   0
#define FLASH_WRPROT2_WRPROT2_WIDTH 16
#define FLASH_WRPROT2_WRPROT2_MASK  (0xFFFFu)

/* === EXTI ================================= */
typedef struct {
    volatile uint32_t IMR; /* 0x000 */
    volatile uint32_t EMR; /* 0x004 */
    volatile uint32_t RTSR; /* 0x008 */
    volatile uint32_t FTSR; /* 0x00C */
    volatile uint32_t SWIER; /* 0x010 */
    volatile uint32_t PR; /* 0x014 */
} EXTI_Type;

#define EXTI_BASE 0x40010400u
#define EXTI ((volatile EXTI_Type*)EXTI_BASE)

#define EXTI_IMR_IM0 (1u << 0)
#define EXTI_IMR_IM1 (1u << 1)
#define EXTI_IMR_IM2 (1u << 2)
#define EXTI_IMR_IM3 (1u << 3)
#define EXTI_IMR_IM4 (1u << 4)
#define EXTI_IMR_IM5 (1u << 5)
#define EXTI_IMR_IM6 (1u << 6)
#define EXTI_IMR_IM7 (1u << 7)
#define EXTI_IMR_IM8 (1u << 8)
#define EXTI_IMR_IM9 (1u << 9)
#define EXTI_IMR_IM10 (1u << 10)
#define EXTI_IMR_IM11 (1u << 11)
#define EXTI_IMR_IM12 (1u << 12)
#define EXTI_IMR_IM13 (1u << 13)
#define EXTI_IMR_IM14 (1u << 14)
#define EXTI_IMR_IM15 (1u << 15)
#define EXTI_IMR_IM16 (1u << 16)
#define EXTI_IMR_IM17 (1u << 17)
#define EXTI_IMR_IM18 (1u << 18)
#define EXTI_IMR_IM19 (1u << 19)
#define EXTI_IMR_IM20 (1u << 20)
#define EXTI_IMR_IM21 (1u << 21)
#define EXTI_IMR_IM22 (1u << 22)
#define EXTI_IMR_IM23 (1u << 23)
#define EXTI_IMR_IM24 (1u << 24)
#define EXTI_IMR_IM25 (1u << 25)
#define EXTI_IMR_IM26 (1u << 26)
#define EXTI_IMR_IM28 (1u << 28)
#define EXTI_IMR_IM29 (1u << 29)
#define EXTI_EMR_EM0 (1u << 0)
#define EXTI_EMR_EM1 (1u << 1)
#define EXTI_EMR_EM2 (1u << 2)
#define EXTI_EMR_EM3 (1u << 3)
#define EXTI_EMR_EM4 (1u << 4)
#define EXTI_EMR_EM5 (1u << 5)
#define EXTI_EMR_EM6 (1u << 6)
#define EXTI_EMR_EM7 (1u << 7)
#define EXTI_EMR_EM8 (1u << 8)
#define EXTI_EMR_EM9 (1u << 9)
#define EXTI_EMR_EM10 (1u << 10)
#define EXTI_EMR_EM11 (1u << 11)
#define EXTI_EMR_EM12 (1u << 12)
#define EXTI_EMR_EM13 (1u << 13)
#define EXTI_EMR_EM14 (1u << 14)
#define EXTI_EMR_EM15 (1u << 15)
#define EXTI_EMR_EM16 (1u << 16)
#define EXTI_EMR_EM17 (1u << 17)
#define EXTI_EMR_EM18 (1u << 18)
#define EXTI_EMR_EM19 (1u << 19)
#define EXTI_EMR_EM20 (1u << 20)
#define EXTI_EMR_EM21 (1u << 21)
#define EXTI_EMR_EM22 (1u << 22)
#define EXTI_EMR_EM23 (1u << 23)
#define EXTI_EMR_EM24 (1u << 24)
#define EXTI_EMR_EM25 (1u << 25)
#define EXTI_EMR_EM26 (1u << 26)
#define EXTI_EMR_EM28 (1u << 28)
#define EXTI_EMR_EM29 (1u << 29)
#define EXTI_RTSR_RT0 (1u << 0)
#define EXTI_RTSR_RT1 (1u << 1)
#define EXTI_RTSR_RT2 (1u << 2)
#define EXTI_RTSR_RT3 (1u << 3)
#define EXTI_RTSR_RT4 (1u << 4)
#define EXTI_RTSR_RT5 (1u << 5)
#define EXTI_RTSR_RT6 (1u << 6)
#define EXTI_RTSR_RT7 (1u << 7)
#define EXTI_RTSR_RT8 (1u << 8)
#define EXTI_RTSR_RT9 (1u << 9)
#define EXTI_RTSR_RT10 (1u << 10)
#define EXTI_RTSR_RT11 (1u << 11)
#define EXTI_RTSR_RT12 (1u << 12)
#define EXTI_RTSR_RT13 (1u << 13)
#define EXTI_RTSR_RT14 (1u << 14)
#define EXTI_RTSR_RT15 (1u << 15)
#define EXTI_RTSR_RT16 (1u << 16)
#define EXTI_RTSR_RT17 (1u << 17)
#define EXTI_RTSR_RT19 (1u << 19)
#define EXTI_RTSR_RT20 (1u << 20)
#define EXTI_RTSR_RT21 (1u << 21)
#define EXTI_RTSR_RT22 (1u << 22)
#define EXTI_FTSR_FT0 (1u << 0)
#define EXTI_FTSR_FT1 (1u << 1)
#define EXTI_FTSR_FT2 (1u << 2)
#define EXTI_FTSR_FT3 (1u << 3)
#define EXTI_FTSR_FT4 (1u << 4)
#define EXTI_FTSR_FT5 (1u << 5)
#define EXTI_FTSR_FT6 (1u << 6)
#define EXTI_FTSR_FT7 (1u << 7)
#define EXTI_FTSR_FT8 (1u << 8)
#define EXTI_FTSR_FT9 (1u << 9)
#define EXTI_FTSR_FT10 (1u << 10)
#define EXTI_FTSR_FT11 (1u << 11)
#define EXTI_FTSR_FT12 (1u << 12)
#define EXTI_FTSR_FT13 (1u << 13)
#define EXTI_FTSR_FT14 (1u << 14)
#define EXTI_FTSR_FT15 (1u << 15)
#define EXTI_FTSR_FT16 (1u << 16)
#define EXTI_FTSR_FT17 (1u << 17)
#define EXTI_FTSR_FT19 (1u << 19)
#define EXTI_FTSR_FT20 (1u << 20)
#define EXTI_FTSR_FT21 (1u << 21)
#define EXTI_FTSR_FT22 (1u << 22)
#define EXTI_SWIER_SWI0 (1u << 0)
#define EXTI_SWIER_SWI1 (1u << 1)
#define EXTI_SWIER_SWI2 (1u << 2)
#define EXTI_SWIER_SWI3 (1u << 3)
#define EXTI_SWIER_SWI4 (1u << 4)
#define EXTI_SWIER_SWI5 (1u << 5)
#define EXTI_SWIER_SWI6 (1u << 6)
#define EXTI_SWIER_SWI7 (1u << 7)
#define EXTI_SWIER_SWI8 (1u << 8)
#define EXTI_SWIER_SWI9 (1u << 9)
#define EXTI_SWIER_SWI10 (1u << 10)
#define EXTI_SWIER_SWI11 (1u << 11)
#define EXTI_SWIER_SWI12 (1u << 12)
#define EXTI_SWIER_SWI13 (1u << 13)
#define EXTI_SWIER_SWI14 (1u << 14)
#define EXTI_SWIER_SWI15 (1u << 15)
#define EXTI_SWIER_SWI16 (1u << 16)
#define EXTI_SWIER_SWI17 (1u << 17)
#define EXTI_SWIER_SWI19 (1u << 19)
#define EXTI_SWIER_SWI20 (1u << 20)
#define EXTI_SWIER_SWI21 (1u << 21)
#define EXTI_SWIER_SWI22 (1u << 22)
#define EXTI_PR_PIF0 (1u << 0)
#define EXTI_PR_PIF1 (1u << 1)
#define EXTI_PR_PIF2 (1u << 2)
#define EXTI_PR_PIF3 (1u << 3)
#define EXTI_PR_PIF4 (1u << 4)
#define EXTI_PR_PIF5 (1u << 5)
#define EXTI_PR_PIF6 (1u << 6)
#define EXTI_PR_PIF7 (1u << 7)
#define EXTI_PR_PIF8 (1u << 8)
#define EXTI_PR_PIF9 (1u << 9)
#define EXTI_PR_PIF10 (1u << 10)
#define EXTI_PR_PIF11 (1u << 11)
#define EXTI_PR_PIF12 (1u << 12)
#define EXTI_PR_PIF13 (1u << 13)
#define EXTI_PR_PIF14 (1u << 14)
#define EXTI_PR_PIF15 (1u << 15)
#define EXTI_PR_PIF16 (1u << 16)
#define EXTI_PR_PIF17 (1u << 17)
#define EXTI_PR_PIF19 (1u << 19)
#define EXTI_PR_PIF20 (1u << 20)
#define EXTI_PR_PIF21 (1u << 21)
#define EXTI_PR_PIF22 (1u << 22)

/* === ADC ================================= */
typedef struct {
    volatile uint32_t ISR; /* 0x000 */
    volatile uint32_t IER; /* 0x004 */
    volatile uint32_t CR; /* 0x008 */
    volatile uint32_t CFGR1; /* 0x00C */
    volatile uint32_t CFGR2; /* 0x010 */
    volatile uint32_t SMPR; /* 0x014 */
    uint8_t _res_0018[8];
    volatile uint32_t TR; /* 0x020 */
    uint8_t _res_0024[4];
    volatile uint32_t CHSELR; /* 0x028 */
    uint8_t _res_002C[20];
    volatile uint32_t DR; /* 0x040 */
    uint8_t _res_0044[112];
    volatile uint32_t CALFACT; /* 0x0B4 */
    uint8_t _res_00B8[592];
    volatile uint32_t CCR; /* 0x308 */
} ADC_Type;

#define ADC_BASE 0x40012400u
#define ADC ((volatile ADC_Type*)ADC_BASE)

#define ADC_ISR_ADRDY (1u << 0)
#define ADC_ISR_EOSMP (1u << 1)
#define ADC_ISR_EOC (1u << 2)
#define ADC_ISR_EOS (1u << 3)
#define ADC_ISR_OVR (1u << 4)
#define ADC_ISR_AWD (1u << 7)
#define ADC_ISR_EOCAL (1u << 11)
#define ADC_IER_ADRDYIE (1u << 0)
#define ADC_IER_EOSMPIE (1u << 1)
#define ADC_IER_EOCIE (1u << 2)
#define ADC_IER_EOSIE (1u << 3)
#define ADC_IER_OVRIE (1u << 4)
#define ADC_IER_AWDIE (1u << 7)
#define ADC_IER_EOCALIE (1u << 11)
#define ADC_CR_ADEN (1u << 0)
#define ADC_CR_ADDIS (1u << 1)
#define ADC_CR_ADSTART (1u << 2)
#define ADC_CR_ADSTP (1u << 4)
#define ADC_CR_ADVREGEN (1u << 28)
#define ADC_CR_ADCAL (1u << 31)
#define ADC_CFGR1_AWDCH_LSB   26
#define ADC_CFGR1_AWDCH_WIDTH 5
#define ADC_CFGR1_AWDCH_MASK  (0x7C000000u)
#define ADC_CFGR1_AWDEN (1u << 23)
#define ADC_CFGR1_AWDSGL (1u << 22)
#define ADC_CFGR1_DISCEN (1u << 16)
#define ADC_CFGR1_AUTOFF (1u << 15)
#define ADC_CFGR1_AUTDLY (1u << 14)
#define ADC_CFGR1_CONT (1u << 13)
#define ADC_CFGR1_OVRMOD (1u << 12)
#define ADC_CFGR1_EXTEN_LSB   10
#define ADC_CFGR1_EXTEN_WIDTH 2
#define ADC_CFGR1_EXTEN_MASK  (0xC00u)
#define ADC_CFGR1_EXTSEL_LSB   6
#define ADC_CFGR1_EXTSEL_WIDTH 3
#define ADC_CFGR1_EXTSEL_MASK  (0x1C0u)
#define ADC_CFGR1_ALIGN (1u << 5)
#define ADC_CFGR1_RES_LSB   3
#define ADC_CFGR1_RES_WIDTH 2
#define ADC_CFGR1_RES_MASK  (0x18u)
#define ADC_CFGR1_SCANDIR (1u << 2)
#define ADC_CFGR1_DMACFG (1u << 1)
#define ADC_CFGR1_DMAEN (1u << 0)
#define ADC_CFGR2_OVSE (1u << 0)
#define ADC_CFGR2_OVSR_LSB   2
#define ADC_CFGR2_OVSR_WIDTH 3
#define ADC_CFGR2_OVSR_MASK  (0x1Cu)
#define ADC_CFGR2_OVSS_LSB   5
#define ADC_CFGR2_OVSS_WIDTH 4
#define ADC_CFGR2_OVSS_MASK  (0x1E0u)
#define ADC_CFGR2_TOVS (1u << 9)
#define ADC_CFGR2_CKMODE_LSB   30
#define ADC_CFGR2_CKMODE_WIDTH 2
#define ADC_CFGR2_CKMODE_MASK  (0xC0000000u)
#define ADC_SMPR_SMPR_LSB   0
#define ADC_SMPR_SMPR_WIDTH 3
#define ADC_SMPR_SMPR_MASK  (0x7u)
#define ADC_TR_HT_LSB   16
#define ADC_TR_HT_WIDTH 12
#define ADC_TR_HT_MASK  (0xFFF0000u)
#define ADC_TR_LT_LSB   0
#define ADC_TR_LT_WIDTH 12
#define ADC_TR_LT_MASK  (0xFFFu)
#define ADC_CHSELR_CHSEL18 (1u << 18)
#define ADC_CHSELR_CHSEL17 (1u << 17)
#define ADC_CHSELR_CHSEL16 (1u << 16)
#define ADC_CHSELR_CHSEL15 (1u << 15)
#define ADC_CHSELR_CHSEL14 (1u << 14)
#define ADC_CHSELR_CHSEL13 (1u << 13)
#define ADC_CHSELR_CHSEL12 (1u << 12)
#define ADC_CHSELR_CHSEL11 (1u << 11)
#define ADC_CHSELR_CHSEL10 (1u << 10)
#define ADC_CHSELR_CHSEL9 (1u << 9)
#define ADC_CHSELR_CHSEL8 (1u << 8)
#define ADC_CHSELR_CHSEL7 (1u << 7)
#define ADC_CHSELR_CHSEL6 (1u << 6)
#define ADC_CHSELR_CHSEL5 (1u << 5)
#define ADC_CHSELR_CHSEL4 (1u << 4)
#define ADC_CHSELR_CHSEL3 (1u << 3)
#define ADC_CHSELR_CHSEL2 (1u << 2)
#define ADC_CHSELR_CHSEL1 (1u << 1)
#define ADC_CHSELR_CHSEL0 (1u << 0)
#define ADC_DR_DATA_LSB   0
#define ADC_DR_DATA_WIDTH 16
#define ADC_DR_DATA_MASK  (0xFFFFu)
#define ADC_CALFACT_CALFACT_LSB   0
#define ADC_CALFACT_CALFACT_WIDTH 7
#define ADC_CALFACT_CALFACT_MASK  (0x7Fu)
#define ADC_CCR_PRESC_LSB   18
#define ADC_CCR_PRESC_WIDTH 4
#define ADC_CCR_PRESC_MASK  (0x3C0000u)
#define ADC_CCR_VREFEN (1u << 22)
#define ADC_CCR_TSEN (1u << 23)
#define ADC_CCR_VLCDEN (1u << 24)
#define ADC_CCR_LFMEN (1u << 25)

/* === DBG ================================= */
typedef struct {
    volatile uint32_t IDCODE; /* 0x000 */
    volatile uint32_t CR; /* 0x004 */
    volatile uint32_t APB1_FZ; /* 0x008 */
    volatile uint32_t APB2_FZ; /* 0x00C */
} DBG_Type;

#define DBG_BASE 0x40015800u
#define DBG ((volatile DBG_Type*)DBG_BASE)

#define DBG_IDCODE_DEV_ID_LSB   0
#define DBG_IDCODE_DEV_ID_WIDTH 12
#define DBG_IDCODE_DEV_ID_MASK  (0xFFFu)
#define DBG_IDCODE_REV_ID_LSB   16
#define DBG_IDCODE_REV_ID_WIDTH 16
#define DBG_IDCODE_REV_ID_MASK  (0xFFFF0000u)
#define DBG_CR_DBG_STOP (1u << 1)
#define DBG_CR_DBG_STANDBY (1u << 2)
#define DBG_CR_DBG_SLEEP (1u << 0)
#define DBG_APB1_FZ_DBG_TIMER2_STOP (1u << 0)
#define DBG_APB1_FZ_DBG_TIMER6_STOP (1u << 4)
#define DBG_APB1_FZ_DBG_RTC_STOP (1u << 10)
#define DBG_APB1_FZ_DBG_WWDG_STOP (1u << 11)
#define DBG_APB1_FZ_DBG_IWDG_STOP (1u << 12)
#define DBG_APB1_FZ_DBG_I2C1_STOP (1u << 21)
#define DBG_APB1_FZ_DBG_I2C2_STOP (1u << 22)
#define DBG_APB1_FZ_DBG_LPTIMER_STOP (1u << 31)
#define DBG_APB2_FZ_DBG_TIMER21_STOP (1u << 2)
#define DBG_APB2_FZ_DBG_TIMER22_STO (1u << 6)

/* === TIM2 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SMCR; /* 0x008 */
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    union {
    volatile uint32_t CCMR1_Output; /* 0x018 */
    volatile uint32_t CCMR1_Input; /* 0x018 */
    };
    union {
    volatile uint32_t CCMR2_Output; /* 0x01C */
    volatile uint32_t CCMR2_Input; /* 0x01C */
    };
    volatile uint32_t CCER; /* 0x020 */
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
    uint8_t _res_0030[4];
    volatile uint32_t CCR1; /* 0x034 */
    volatile uint32_t CCR2; /* 0x038 */
    volatile uint32_t CCR3; /* 0x03C */
    volatile uint32_t CCR4; /* 0x040 */
    uint8_t _res_0044[4];
    volatile uint32_t DCR; /* 0x048 */
    volatile uint32_t DMAR; /* 0x04C */
    volatile uint32_t OR; /* 0x050 */
} TIM2_Type;

#define TIM2_BASE 0x40000000u
#define TIM2 ((volatile TIM2_Type*)TIM2_BASE)

