Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define TIM2_CR1_CKD_LSB   8
#define TIM2_CR1_CKD_WIDTH 2
#define TIM2_CR1_CKD_MASK  (0x300u)
#define TIM2_CR1_ARPE (1u << 7)
#define TIM2_CR1_CMS_LSB   5
#define TIM2_CR1_CMS_WIDTH 2
#define TIM2_CR1_CMS_MASK  (0x60u)
#define TIM2_CR1_DIR (1u << 4)
#define TIM2_CR1_OPM (1u << 3)
#define TIM2_CR1_URS (1u << 2)
#define TIM2_CR1_UDIS (1u << 1)
#define TIM2_CR1_CEN (1u << 0)
#define TIM2_CR2_TI1S (1u << 7)
#define TIM2_CR2_MMS_LSB   4
#define TIM2_CR2_MMS_WIDTH 3
#define TIM2_CR2_MMS_MASK  (0x70u)
#define TIM2_CR2_CCDS (1u << 3)
#define TIM2_SMCR_ETP (1u << 15)
#define TIM2_SMCR_ECE (1u << 14)
#define TIM2_SMCR_ETPS_LSB   12
#define TIM2_SMCR_ETPS_WIDTH 2
#define TIM2_SMCR_ETPS_MASK  (0x3000u)
#define TIM2_SMCR_ETF_LSB   8
#define TIM2_SMCR_ETF_WIDTH 4
#define TIM2_SMCR_ETF_MASK  (0xF00u)
#define TIM2_SMCR_MSM (1u << 7)
#define TIM2_SMCR_TS_LSB   4
#define TIM2_SMCR_TS_WIDTH 3
#define TIM2_SMCR_TS_MASK  (0x70u)
#define TIM2_SMCR_SMS_LSB   0
#define TIM2_SMCR_SMS_WIDTH 3
#define TIM2_SMCR_SMS_MASK  (0x7u)
#define TIM2_DIER_TDE (1u << 14)
#define TIM2_DIER_CC4DE (1u << 12)
#define TIM2_DIER_CC3DE (1u << 11)
#define TIM2_DIER_CC2DE (1u << 10)
#define TIM2_DIER_CC1DE (1u << 9)
#define TIM2_DIER_UDE (1u << 8)
#define TIM2_DIER_TIE (1u << 6)
#define TIM2_DIER_CC4IE (1u << 4)
#define TIM2_DIER_CC3IE (1u << 3)
#define TIM2_DIER_CC2IE (1u << 2)
#define TIM2_DIER_CC1IE (1u << 1)
#define TIM2_DIER_UIE (1u << 0)
#define TIM2_SR_CC4OF (1u << 12)
#define TIM2_SR_CC3OF (1u << 11)
#define TIM2_SR_CC2OF (1u << 10)
#define TIM2_SR_CC1OF (1u << 9)
#define TIM2_SR_TIF (1u << 6)
#define TIM2_SR_CC4IF (1u << 4)
#define TIM2_SR_CC3IF (1u << 3)
#define TIM2_SR_CC2IF (1u << 2)
#define TIM2_SR_CC1IF (1u << 1)
#define TIM2_SR_UIF (1u << 0)
#define TIM2_EGR_TG (1u << 6)
#define TIM2_EGR_CC4G (1u << 4)
#define TIM2_EGR_CC3G (1u << 3)
#define TIM2_EGR_CC2G (1u << 2)
#define TIM2_EGR_CC1G (1u << 1)
#define TIM2_EGR_UG (1u << 0)
#define TIM2_CCMR1_OUTPUT_OC2CE (1u << 15)
#define TIM2_CCMR1_OUTPUT_OC2M_LSB   12
#define TIM2_CCMR1_OUTPUT_OC2M_WIDTH 3
#define TIM2_CCMR1_OUTPUT_OC2M_MASK  (0x7000u)
#define TIM2_CCMR1_OUTPUT_OC2PE (1u << 11)
#define TIM2_CCMR1_OUTPUT_OC2FE (1u << 10)
#define TIM2_CCMR1_OUTPUT_CC2S_LSB   8
#define TIM2_CCMR1_OUTPUT_CC2S_WIDTH 2
#define TIM2_CCMR1_OUTPUT_CC2S_MASK  (0x300u)
#define TIM2_CCMR1_OUTPUT_OC1CE (1u << 7)
#define TIM2_CCMR1_OUTPUT_OC1M_LSB   4
#define TIM2_CCMR1_OUTPUT_OC1M_WIDTH 3
#define TIM2_CCMR1_OUTPUT_OC1M_MASK  (0x70u)
#define TIM2_CCMR1_OUTPUT_OC1PE (1u << 3)
#define TIM2_CCMR1_OUTPUT_OC1FE (1u << 2)
#define TIM2_CCMR1_OUTPUT_CC1S_LSB   0
#define TIM2_CCMR1_OUTPUT_CC1S_WIDTH 2
#define TIM2_CCMR1_OUTPUT_CC1S_MASK  (0x3u)
#define TIM2_CCMR1_INPUT_IC2F_LSB   12
#define TIM2_CCMR1_INPUT_IC2F_WIDTH 4
#define TIM2_CCMR1_INPUT_IC2F_MASK  (0xF000u)
#define TIM2_CCMR1_INPUT_IC2PSC_LSB   10
#define TIM2_CCMR1_INPUT_IC2PSC_WIDTH 2
#define TIM2_CCMR1_INPUT_IC2PSC_MASK  (0xC00u)
#define TIM2_CCMR1_INPUT_CC2S_LSB   8
#define TIM2_CCMR1_INPUT_CC2S_WIDTH 2
#define TIM2_CCMR1_INPUT_CC2S_MASK  (0x300u)
#define TIM2_CCMR1_INPUT_IC1F_LSB   4
#define TIM2_CCMR1_INPUT_IC1F_WIDTH 4
#define TIM2_CCMR1_INPUT_IC1F_MASK  (0xF0u)
#define TIM2_CCMR1_INPUT_IC1PSC_LSB   2
#define TIM2_CCMR1_INPUT_IC1PSC_WIDTH 2
#define TIM2_CCMR1_INPUT_IC1PSC_MASK  (0xCu)
#define TIM2_CCMR1_INPUT_CC1S_LSB   0
#define TIM2_CCMR1_INPUT_CC1S_WIDTH 2
#define TIM2_CCMR1_INPUT_CC1S_MASK  (0x3u)
#define TIM2_CCMR2_OUTPUT_OC4CE (1u << 15)
#define TIM2_CCMR2_OUTPUT_OC4M_LSB   12
#define TIM2_CCMR2_OUTPUT_OC4M_WIDTH 3
#define TIM2_CCMR2_OUTPUT_OC4M_MASK  (0x7000u)
#define TIM2_CCMR2_OUTPUT_OC4PE (1u << 11)
#define TIM2_CCMR2_OUTPUT_OC4FE (1u << 10)
#define TIM2_CCMR2_OUTPUT_CC4S_LSB   8
#define TIM2_CCMR2_OUTPUT_CC4S_WIDTH 2
#define TIM2_CCMR2_OUTPUT_CC4S_MASK  (0x300u)
#define TIM2_CCMR2_OUTPUT_OC3CE (1u << 7)
#define TIM2_CCMR2_OUTPUT_OC3M_LSB   4
#define TIM2_CCMR2_OUTPUT_OC3M_WIDTH 3
#define TIM2_CCMR2_OUTPUT_OC3M_MASK  (0x70u)
#define TIM2_CCMR2_OUTPUT_OC3PE (1u << 3)
#define TIM2_CCMR2_OUTPUT_OC3FE (1u << 2)
#define TIM2_CCMR2_OUTPUT_CC3S_LSB   0
#define TIM2_CCMR2_OUTPUT_CC3S_WIDTH 2
#define TIM2_CCMR2_OUTPUT_CC3S_MASK  (0x3u)
#define TIM2_CCMR2_INPUT_IC4F_LSB   12
#define TIM2_CCMR2_INPUT_IC4F_WIDTH 4
#define TIM2_CCMR2_INPUT_IC4F_MASK  (0xF000u)
#define TIM2_CCMR2_INPUT_IC4PSC_LSB   10
#define TIM2_CCMR2_INPUT_IC4PSC_WIDTH 2
#define TIM2_CCMR2_INPUT_IC4PSC_MASK  (0xC00u)
#define TIM2_CCMR2_INPUT_CC4S_LSB   8
#define TIM2_CCMR2_INPUT_CC4S_WIDTH 2
#define TIM2_CCMR2_INPUT_CC4S_MASK  (0x300u)
#define TIM2_CCMR2_INPUT_IC3F_LSB   4
#define TIM2_CCMR2_INPUT_IC3F_WIDTH 4
#define TIM2_CCMR2_INPUT_IC3F_MASK  (0xF0u)
#define TIM2_CCMR2_INPUT_IC3PSC_LSB   2
#define TIM2_CCMR2_INPUT_IC3PSC_WIDTH 2
#define TIM2_CCMR2_INPUT_IC3PSC_MASK  (0xCu)
#define TIM2_CCMR2_INPUT_CC3S_LSB   0
#define TIM2_CCMR2_INPUT_CC3S_WIDTH 2
#define TIM2_CCMR2_INPUT_CC3S_MASK  (0x3u)
#define TIM2_CCER_CC4NP (1u << 15)
#define TIM2_CCER_CC4P (1u << 13)
#define TIM2_CCER_CC4E (1u << 12)
#define TIM2_CCER_CC3NP (1u << 11)
#define TIM2_CCER_CC3P (1u << 9)
#define TIM2_CCER_CC3E (1u << 8)
#define TIM2_CCER_CC2NP (1u << 7)
#define TIM2_CCER_CC2P (1u << 5)
#define TIM2_CCER_CC2E (1u << 4)
#define TIM2_CCER_CC1NP (1u << 3)
#define TIM2_CCER_CC1P (1u << 1)
#define TIM2_CCER_CC1E (1u << 0)
#define TIM2_CNT_CNT_H_LSB   16
#define TIM2_CNT_CNT_H_WIDTH 16
#define TIM2_CNT_CNT_H_MASK  (0xFFFF0000u)
#define TIM2_CNT_CNT_L_LSB   0
#define TIM2_CNT_CNT_L_WIDTH 16
#define TIM2_CNT_CNT_L_MASK  (0xFFFFu)
#define TIM2_PSC_PSC_LSB   0
#define TIM2_PSC_PSC_WIDTH 16
#define TIM2_PSC_PSC_MASK  (0xFFFFu)
#define TIM2_ARR_ARR_H_LSB   16
#define TIM2_ARR_ARR_H_WIDTH 16
#define TIM2_ARR_ARR_H_MASK  (0xFFFF0000u)
#define TIM2_ARR_ARR_L_LSB   0
#define TIM2_ARR_ARR_L_WIDTH 16
#define TIM2_ARR_ARR_L_MASK  (0xFFFFu)
#define TIM2_CCR1_CCR1_H_LSB   16
#define TIM2_CCR1_CCR1_H_WIDTH 16
#define TIM2_CCR1_CCR1_H_MASK  (0xFFFF0000u)
#define TIM2_CCR1_CCR1_L_LSB   0
#define TIM2_CCR1_CCR1_L_WIDTH 16
#define TIM2_CCR1_CCR1_L_MASK  (0xFFFFu)
#define TIM2_CCR2_CCR2_H_LSB   16
#define TIM2_CCR2_CCR2_H_WIDTH 16
#define TIM2_CCR2_CCR2_H_MASK  (0xFFFF0000u)
#define TIM2_CCR2_CCR2_L_LSB   0
#define TIM2_CCR2_CCR2_L_WIDTH 16
#define TIM2_CCR2_CCR2_L_MASK  (0xFFFFu)
#define TIM2_CCR3_CCR3_H_LSB   16
#define TIM2_CCR3_CCR3_H_WIDTH 16
#define TIM2_CCR3_CCR3_H_MASK  (0xFFFF0000u)
#define TIM2_CCR3_CCR3_L_LSB   0
#define TIM2_CCR3_CCR3_L_WIDTH 16
#define TIM2_CCR3_CCR3_L_MASK  (0xFFFFu)
#define TIM2_CCR4_CCR4_H_LSB   16
#define TIM2_CCR4_CCR4_H_WIDTH 16
#define TIM2_CCR4_CCR4_H_MASK  (0xFFFF0000u)
#define TIM2_CCR4_CCR4_L_LSB   0
#define TIM2_CCR4_CCR4_L_WIDTH 16
#define TIM2_CCR4_CCR4_L_MASK  (0xFFFFu)
#define TIM2_DCR_DBL_LSB   8
#define TIM2_DCR_DBL_WIDTH 5
#define TIM2_DCR_DBL_MASK  (0x1F00u)
#define TIM2_DCR_DBA_LSB   0
#define TIM2_DCR_DBA_WIDTH 5
#define TIM2_DCR_DBA_MASK  (0x1Fu)
#define TIM2_DMAR_DMAB_LSB   0
#define TIM2_DMAR_DMAB_WIDTH 16
#define TIM2_DMAR_DMAB_MASK  (0xFFFFu)
#define TIM2_OR_ETR_RMP_LSB   0
#define TIM2_OR_ETR_RMP_WIDTH 3
#define TIM2_OR_ETR_RMP_MASK  (0x7u)
#define TIM2_OR_TI4_RMP_LSB   3
#define TIM2_OR_TI4_RMP_WIDTH 2
#define TIM2_OR_TI4_RMP_MASK  (0x18u)

/* === TIM3 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SMCR; /* 0x008 */
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    union {
    volatile uint32_t CCMR1_Output; /* 0x018 */
    volatile uint32_t CCMR1_Input; /* 0x018 */
    };
    union {
    volatile uint32_t CCMR2_Output; /* 0x01C */
    volatile uint32_t CCMR2_Input; /* 0x01C */
    };
    volatile uint32_t CCER; /* 0x020 */
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
    uint8_t _res_0030[4];
    volatile uint32_t CCR1; /* 0x034 */
    volatile uint32_t CCR2; /* 0x038 */
    volatile uint32_t CCR3; /* 0x03C */
    volatile uint32_t CCR4; /* 0x040 */
    uint8_t _res_0044[4];
    volatile uint32_t DCR; /* 0x048 */
    volatile uint32_t DMAR; /* 0x04C */
    volatile uint32_t OR; /* 0x050 */
} TIM3_Type;

#define TIM3_BASE 0x40000400u
#define TIM3 ((volatile TIM3_Type*)TIM3_BASE)

#define TIM3_CR1_CKD_LSB   8
#define TIM3_CR1_CKD_WIDTH 2
#define TIM3_CR1_CKD_MASK  (0x300u)
#define TIM3_CR1_ARPE (1u << 7)
#define TIM3_CR1_CMS_LSB   5
#define TIM3_CR1_CMS_WIDTH 2
#define TIM3_CR1_CMS_MASK  (0x60u)
#define TIM3_CR1_DIR (1u << 4)
#define TIM3_CR1_OPM (1u << 3)
#define TIM3_CR1_URS (1u << 2)
#define TIM3_CR1_UDIS (1u << 1)
#define TIM3_CR1_CEN (1u << 0)
#define TIM3_CR2_TI1S (1u << 7)
#define TIM3_CR2_MMS_LSB   4
#define TIM3_CR2_MMS_WIDTH 3
#define TIM3_CR2_MMS_MASK  (0x70u)
#define TIM3_CR2_CCDS (1u << 3)
#define TIM3_SMCR_ETP (1u << 15)
#define TIM3_SMCR_ECE (1u << 14)
#define TIM3_SMCR_ETPS_LSB   12
#define TIM3_SMCR_ETPS_WIDTH 2
#define TIM3_SMCR_ETPS_MASK  (0x3000u)
#define TIM3_SMCR_ETF_LSB   8
#define TIM3_SMCR_ETF_WIDTH 4
#define TIM3_SMCR_ETF_MASK  (0xF00u)
#define TIM3_SMCR_MSM (1u << 7)
#define TIM3_SMCR_TS_LSB   4
#define TIM3_SMCR_TS_WIDTH 3
#define TIM3_SMCR_TS_MASK  (0x70u)
#define TIM3_SMCR_SMS_LSB   0
#define TIM3_SMCR_SMS_WIDTH 3
#define TIM3_SMCR_SMS_MASK  (0x7u)
#define TIM3_DIER_TDE (1u << 14)
#define TIM3_DIER_CC4DE (1u << 12)
#define TIM3_DIER_CC3DE (1u << 11)
#define TIM3_DIER_CC2DE (1u << 10)
#define TIM3_DIER_CC1DE (1u << 9)
#define TIM3_DIER_UDE (1u << 8)
#define TIM3_DIER_TIE (1u << 6)
#define TIM3_DIER_CC4IE (1u << 4)
#define TIM3_DIER_CC3IE (1u << 3)
#define TIM3_DIER_CC2IE (1u << 2)
#define TIM3_DIER_CC1IE (1u << 1)
#define TIM3_DIER_UIE (1u << 0)
#define TIM3_SR_CC4OF (1u << 12)
#define TIM3_SR_CC3OF (1u << 11)
#define TIM3_SR_CC2OF (1u << 10)
#define TIM3_SR_CC1OF (1u << 9)
#define TIM3_SR_TIF (1u << 6)
#define TIM3_SR_CC4IF (1u << 4)
#define TIM3_SR_CC3IF (1u << 3)
#define TIM3_SR_CC2IF (1u << 2)
#define TIM3_SR_CC1IF (1u << 1)
#define TIM3_SR_UIF (1u << 0)
#define TIM3_EGR_TG (1u << 6)
#define TIM3_EGR_CC4G (1u << 4)
#define TIM3_EGR_CC3G (1u << 3)
#define TIM3_EGR_CC2G (1u << 2)
#define TIM3_EGR_CC1G (1u << 1)
#define TIM3_EGR_UG (1u << 0)
#define TIM3_CCMR1_OUTPUT_OC2CE (1u << 15)
#define TIM3_CCMR1_OUTPUT_OC2M_LSB   12
#define TIM3_CCMR1_OUTPUT_OC2M_WIDTH 3
#define TIM3_CCMR1_OUTPUT_OC2M_MASK  (0x7000u)
#define TIM3_CCMR1_OUTPUT_OC2PE (1u << 11)
#define TIM3_CCMR1_OUTPUT_OC2FE (1u << 10)
#define TIM3_CCMR1_OUTPUT_CC2S_LSB   8
#define TIM3_CCMR1_OUTPUT_CC2S_WIDTH 2
#define TIM3_CCMR1_OUTPUT_CC2S_MASK  (0x300u)
#define TIM3_CCMR1_OUTPUT_OC1CE (1u << 7)
#define TIM3_CCMR1_OUTPUT_OC1M_LSB   4
#define TIM3_CCMR1_OUTPUT_OC1M_WIDTH 3
#define TIM3_CCMR1_OUTPUT_OC1M_MASK  (0x70u)
#define TIM3_CCMR1_OUTPUT_OC1PE (1u << 3)
#define TIM3_CCMR1_OUTPUT_OC1FE (1u << 2)
#define TIM3_CCMR1_OUTPUT_CC1S_LSB   0
#define TIM3_CCMR1_OUTPUT_CC1S_WIDTH 2
#define TIM3_CCMR1_OUTPUT_CC1S_MASK  (0x3u)
#define TIM3_CCMR1_INPUT_IC2F_LSB   12
#define TIM3_CCMR1_INPUT_IC2F_WIDTH 4
#define TIM3_CCMR1_INPUT_IC2F_MASK  (0xF000u)
#define TIM3_CCMR1_INPUT_IC2PSC_LSB   10
#define TIM3_CCMR1_INPUT_IC2PSC_WIDTH 2
#define TIM3_CCMR1_INPUT_IC2PSC_MASK  (0xC00u)
#define TIM3_CCMR1_INPUT_CC2S_LSB   8
#define TIM3_CCMR1_INPUT_CC2S_WIDTH 2
#define TIM3_CCMR1_INPUT_CC2S_MASK  (0x300u)
#define TIM3_CCMR1_INPUT_IC1F_LSB   4
#define TIM3_CCMR1_INPUT_IC1F_WIDTH 4
#define TIM3_CCMR1_INPUT_IC1F_MASK  (0xF0u)
#define TIM3_CCMR1_INPUT_IC1PSC_LSB   2
#define TIM3_CCMR1_INPUT_IC1PSC_WIDTH 2
#define TIM3_CCMR1_INPUT_IC1PSC_MASK  (0xCu)
#define TIM3_CCMR1_INPUT_CC1S_LSB   0
#define TIM3_CCMR1_INPUT_CC1S_WIDTH 2
#define TIM3_CCMR1_INPUT_CC1S_MASK  (0x3u)
#define TIM3_CCMR2_OUTPUT_OC4CE (1u << 15)
#define TIM3_CCMR2_OUTPUT_OC4M_LSB   12
#define TIM3_CCMR2_OUTPUT_OC4M_WIDTH 3
#define TIM3_CCMR2_OUTPUT_OC4M_MASK  (0x7000u)
#define TIM3_CCMR2_OUTPUT_OC4PE (1u << 11)
#define TIM3_CCMR2_OUTPUT_OC4FE (1u << 10)
#define TIM3_CCMR2_OUTPUT_CC4S_LSB   8
#define TIM3_CCMR2_OUTPUT_CC4S_WIDTH 2
#define TIM3_CCMR2_OUTPUT_CC4S_MASK  (0x300u)
#define TIM3_CCMR2_OUTPUT_OC3CE (1u << 7)
#define TIM3_CCMR2_OUTPUT_OC3M_LSB   4
#define TIM3_CCMR2_OUTPUT_OC3M_WIDTH 3
#define TIM3_CCMR2_OUTPUT_OC3M_MASK  (0x70u)
#define TIM3_CCMR2_OUTPUT_OC3PE (1u << 3)
#define TIM3_CCMR2_OUTPUT_OC3FE (1u << 2)
#define TIM3_CCMR2_OUTPUT_CC3S_LSB   0
#define TIM3_CCMR2_OUTPUT_CC3S_WIDTH 2
#define TIM3_CCMR2_OUTPUT_CC3S_MASK  (0x3u)
#define TIM3_CCMR2_INPUT_IC4F_LSB   12
#define TIM3_CCMR2_INPUT_IC4F_WIDTH 4
#define TIM3_CCMR2_INPUT_IC4F_MASK  (0xF000u)
#define TIM3_CCMR2_INPUT_IC4PSC_LSB   10
#define TIM3_CCMR2_INPUT_IC4PSC_WIDTH 2
#define TIM3_CCMR2_INPUT_IC4PSC_MASK  (0xC00u)
#define TIM3_CCMR2_INPUT_CC4S_LSB   8
#define TIM3_CCMR2_INPUT_CC4S_WIDTH 2
#define TIM3_CCMR2_INPUT_CC4S_MASK  (0x300u)
#define TIM3_CCMR2_INPUT_IC3F_LSB   4
#define TIM3_CCMR2_INPUT_IC3F_WIDTH 4
#define TIM3_CCMR2_INPUT_IC3F_MASK  (0xF0u)
#define TIM3_CCMR2_INPUT_IC3PSC_LSB   2
#define TIM3_CCMR2_INPUT_IC3PSC_WIDTH 2
#define TIM3_CCMR2_INPUT_IC3PSC_MASK  (0xCu)
#define TIM3_CCMR2_INPUT_CC3S_LSB   0
#define TIM3_CCMR2_INPUT_CC3S_WIDTH 2
#define TIM3_CCMR2_INPUT_CC3S_MASK  (0x3u)
#define TIM3_CCER_CC4NP (1u << 15)
#define TIM3_CCER_CC4P (1u << 13)
#define TIM3_CCER_CC4E (1u << 12)
#define TIM3_CCER_CC3NP (1u << 11)
#define TIM3_CCER_CC3P (1u << 9)
#define TIM3_CCER_CC3E (1u << 8)
#define TIM3_CCER_CC2NP (1u << 7)
#define TIM3_CCER_CC2P (1u << 5)
#define TIM3_CCER_CC2E (1u << 4)
#define TIM3_CCER_CC1NP (1u << 3)
#define TIM3_CCER_CC1P (1u << 1)
#define TIM3_CCER_CC1E (1u << 0)
#define TIM3_CNT_CNT_H_LSB   16
#define TIM3_CNT_CNT_H_WIDTH 16
#define TIM3_CNT_CNT_H_MASK  (0xFFFF0000u)
#define TIM3_CNT_CNT_L_LSB   0
#define TIM3_CNT_CNT_L_WIDTH 16
#define TIM3_CNT_CNT_L_MASK  (0xFFFFu)
#define TIM3_PSC_PSC_LSB   0
#define TIM3_PSC_PSC_WIDTH 16
#define TIM3_PSC_PSC_MASK  (0xFFFFu)
#define TIM3_ARR_ARR_H_LSB   16
#define TIM3_ARR_ARR_H_WIDTH 16
#define TIM3_ARR_ARR_H_MASK  (0xFFFF0000u)
#define TIM3_ARR_ARR_L_LSB   0
#define TIM3_ARR_ARR_L_WIDTH 16
#define TIM3_ARR_ARR_L_MASK  (0xFFFFu)
#define TIM3_CCR1_CCR1_H_LSB   16
#define TIM3_CCR1_CCR1_H_WIDTH 16
#define TIM3_CCR1_CCR1_H_MASK  (0xFFFF0000u)
#define TIM3_CCR1_CCR1_L_LSB   0
#define TIM3_CCR1_CCR1_L_WIDTH 16
#define TIM3_CCR1_CCR1_L_MASK  (0xFFFFu)
#define TIM3_CCR2_CCR2_H_LSB   16
#define TIM3_CCR2_CCR2_H_WIDTH 16
#define TIM3_CCR2_CCR2_H_MASK  (0xFFFF0000u)
#define TIM3_CCR2_CCR2_L_LSB   0
#define TIM3_CCR2_CCR2_L_WIDTH 16
#define TIM3_CCR2_CCR2_L_MASK  (0xFFFFu)
#define TIM3_CCR3_CCR3_H_LSB   16
#define TIM3_CCR3_CCR3_H_WIDTH 16
#define TIM3_CCR3_CCR3_H_MASK  (0xFFFF0000u)
#define TIM3_CCR3_CCR3_L_LSB   0
#define TIM3_CCR3_CCR3_L_WIDTH 16
#define TIM3_CCR3_CCR3_L_MASK  (0xFFFFu)
#define TIM3_CCR4_CCR4_H_LSB   16
#define TIM3_CCR4_CCR4_H_WIDTH 16
#define TIM3_CCR4_CCR4_H_MASK  (0xFFFF0000u)
#define TIM3_CCR4_CCR4_L_LSB   0
#define TIM3_CCR4_CCR4_L_WIDTH 16
#define TIM3_CCR4_CCR4_L_MASK  (0xFFFFu)
#define TIM3_DCR_DBL_LSB   8
#define TIM3_DCR_DBL_WIDTH 5
#define TIM3_DCR_DBL_MASK  (0x1F00u)
#define TIM3_DCR_DBA_LSB   0
#define TIM3_DCR_DBA_WIDTH 5
#define TIM3_DCR_DBA_MASK  (0x1Fu)
#define TIM3_DMAR_DMAB_LSB   0
#define TIM3_DMAR_DMAB_WIDTH 16
#define TIM3_DMAR_DMAB_MASK  (0xFFFFu)
#define TIM3_OR_ETR_RMP_LSB   0
#define TIM3_OR_ETR_RMP_WIDTH 3
#define TIM3_OR_ETR_RMP_MASK  (0x7u)
#define TIM3_OR_TI4_RMP_LSB   3
#define TIM3_OR_TI4_RMP_WIDTH 2
#define TIM3_OR_TI4_RMP_MASK  (0x18u)

/* === TIM6 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    uint8_t _res_0008[4];
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    uint8_t _res_0018[12];
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
} TIM6_Type;

#define TIM6_BASE 0x40001000u
#define TIM6 ((volatile TIM6_Type*)TIM6_BASE)

#define TIM6_CR1_ARPE (1u << 7)
#define TIM6_CR1_OPM (1u << 3)
#define TIM6_CR1_URS (1u << 2)
#define TIM6_CR1_UDIS (1u << 1)
#define TIM6_CR1_CEN (1u << 0)
#define TIM6_CR2_MMS_LSB   4
#define TIM6_CR2_MMS_WIDTH 3
#define TIM6_CR2_MMS_MASK  (0x70u)
#define TIM6_DIER_UDE (1u << 8)
#define TIM6_DIER_UIE (1u << 0)
#define TIM6_SR_UIF (1u << 0)
#define TIM6_EGR_UG (1u << 0)
#define TIM6_CNT_CNT_LSB   0
#define TIM6_CNT_CNT_WIDTH 16
#define TIM6_CNT_CNT_MASK  (0xFFFFu)
#define TIM6_PSC_PSC_LSB   0
#define TIM6_PSC_PSC_WIDTH 16
#define TIM6_PSC_PSC_MASK  (0xFFFFu)
#define TIM6_ARR_ARR_LSB   0
#define TIM6_ARR_ARR_WIDTH 16
#define TIM6_ARR_ARR_MASK  (0xFFFFu)

