Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
/* === TIM7 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    uint8_t _res_0008[4];
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    uint8_t _res_0018[12];
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
} TIM7_Type;

#define TIM7_BASE 0x40001400u
#define TIM7 ((volatile TIM7_Type*)TIM7_BASE)

#define TIM7_CR1_ARPE (1u << 7)
#define TIM7_CR1_OPM (1u << 3)
#define TIM7_CR1_URS (1u << 2)
#define TIM7_CR1_UDIS (1u << 1)
#define TIM7_CR1_CEN (1u << 0)
#define TIM7_CR2_MMS_LSB   4
#define TIM7_CR2_MMS_WIDTH 3
#define TIM7_CR2_MMS_MASK  (0x70u)
#define TIM7_DIER_UDE (1u << 8)
#define TIM7_DIER_UIE (1u << 0)
#define TIM7_SR_UIF (1u << 0)
#define TIM7_EGR_UG (1u << 0)
#define TIM7_CNT_CNT_LSB   0
#define TIM7_CNT_CNT_WIDTH 16
#define TIM7_CNT_CNT_MASK  (0xFFFFu)
#define TIM7_PSC_PSC_LSB   0
#define TIM7_PSC_PSC_WIDTH 16
#define TIM7_PSC_PSC_MASK  (0xFFFFu)
#define TIM7_ARR_ARR_LSB   0
#define TIM7_ARR_ARR_WIDTH 16
#define TIM7_ARR_ARR_MASK  (0xFFFFu)

/* === TIM21 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SMCR; /* 0x008 */
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    union {
    volatile uint32_t CCMR1_Output; /* 0x018 */
    volatile uint32_t CCMR1_Input; /* 0x018 */
    };
    uint8_t _res_001C[4];
    volatile uint32_t CCER; /* 0x020 */
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
    uint8_t _res_0030[4];
    volatile uint32_t CCR1; /* 0x034 */
    volatile uint32_t CCR2; /* 0x038 */
    uint8_t _res_003C[20];
    volatile uint32_t OR; /* 0x050 */
} TIM21_Type;

#define TIM21_BASE 0x40010800u
#define TIM21 ((volatile TIM21_Type*)TIM21_BASE)

#define TIM21_CR1_CEN (1u << 0)
#define TIM21_CR1_UDIS (1u << 1)
#define TIM21_CR1_URS (1u << 2)
#define TIM21_CR1_OPM (1u << 3)
#define TIM21_CR1_DIR (1u << 4)
#define TIM21_CR1_CMS_LSB   5
#define TIM21_CR1_CMS_WIDTH 2
#define TIM21_CR1_CMS_MASK  (0x60u)
#define TIM21_CR1_ARPE (1u << 7)
#define TIM21_CR1_CKD_LSB   8
#define TIM21_CR1_CKD_WIDTH 2
#define TIM21_CR1_CKD_MASK  (0x300u)
#define TIM21_CR2_MMS_LSB   4
#define TIM21_CR2_MMS_WIDTH 3
#define TIM21_CR2_MMS_MASK  (0x70u)
#define TIM21_SMCR_SMS_LSB   0
#define TIM21_SMCR_SMS_WIDTH 3
#define TIM21_SMCR_SMS_MASK  (0x7u)
#define TIM21_SMCR_TS_LSB   4
#define TIM21_SMCR_TS_WIDTH 3
#define TIM21_SMCR_TS_MASK  (0x70u)
#define TIM21_SMCR_MSM (1u << 7)
#define TIM21_SMCR_ETF_LSB   8
#define TIM21_SMCR_ETF_WIDTH 4
#define TIM21_SMCR_ETF_MASK  (0xF00u)
#define TIM21_SMCR_ETPS_LSB   12
#define TIM21_SMCR_ETPS_WIDTH 2
#define TIM21_SMCR_ETPS_MASK  (0x3000u)
#define TIM21_SMCR_ECE (1u << 14)
#define TIM21_SMCR_ETP (1u << 15)
#define TIM21_DIER_TIE (1u << 6)
#define TIM21_DIER_CC2IE (1u << 2)
#define TIM21_DIER_CC1IE (1u << 1)
#define TIM21_DIER_UIE (1u << 0)
#define TIM21_SR_CC2OF (1u << 10)
#define TIM21_SR_CC1OF (1u << 9)
#define TIM21_SR_TIF (1u << 6)
#define TIM21_SR_CC2IF (1u << 2)
#define TIM21_SR_CC1IF (1u << 1)
#define TIM21_SR_UIF (1u << 0)
#define TIM21_EGR_TG (1u << 6)
#define TIM21_EGR_CC2G (1u << 2)
#define TIM21_EGR_CC1G (1u << 1)
#define TIM21_EGR_UG (1u << 0)
#define TIM21_CCMR1_OUTPUT_OC2M_LSB   12
#define TIM21_CCMR1_OUTPUT_OC2M_WIDTH 3
#define TIM21_CCMR1_OUTPUT_OC2M_MASK  (0x7000u)
#define TIM21_CCMR1_OUTPUT_OC2PE (1u << 11)
#define TIM21_CCMR1_OUTPUT_OC2FE (1u << 10)
#define TIM21_CCMR1_OUTPUT_CC2S_LSB   8
#define TIM21_CCMR1_OUTPUT_CC2S_WIDTH 2
#define TIM21_CCMR1_OUTPUT_CC2S_MASK  (0x300u)
#define TIM21_CCMR1_OUTPUT_OC1M_LSB   4
#define TIM21_CCMR1_OUTPUT_OC1M_WIDTH 3
#define TIM21_CCMR1_OUTPUT_OC1M_MASK  (0x70u)
#define TIM21_CCMR1_OUTPUT_OC1PE (1u << 3)
#define TIM21_CCMR1_OUTPUT_OC1FE (1u << 2)
#define TIM21_CCMR1_OUTPUT_CC1S_LSB   0
#define TIM21_CCMR1_OUTPUT_CC1S_WIDTH 2
#define TIM21_CCMR1_OUTPUT_CC1S_MASK  (0x3u)
#define TIM21_CCMR1_INPUT_IC2F_LSB   12
#define TIM21_CCMR1_INPUT_IC2F_WIDTH 4
#define TIM21_CCMR1_INPUT_IC2F_MASK  (0xF000u)
#define TIM21_CCMR1_INPUT_IC2PSC_LSB   10
#define TIM21_CCMR1_INPUT_IC2PSC_WIDTH 2
#define TIM21_CCMR1_INPUT_IC2PSC_MASK  (0xC00u)
#define TIM21_CCMR1_INPUT_CC2S_LSB   8
#define TIM21_CCMR1_INPUT_CC2S_WIDTH 2
#define TIM21_CCMR1_INPUT_CC2S_MASK  (0x300u)
#define TIM21_CCMR1_INPUT_IC1F_LSB   4
#define TIM21_CCMR1_INPUT_IC1F_WIDTH 4
#define TIM21_CCMR1_INPUT_IC1F_MASK  (0xF0u)
#define TIM21_CCMR1_INPUT_IC1PSC_LSB   2
#define TIM21_CCMR1_INPUT_IC1PSC_WIDTH 2
#define TIM21_CCMR1_INPUT_IC1PSC_MASK  (0xCu)
#define TIM21_CCMR1_INPUT_CC1S_LSB   0
#define TIM21_CCMR1_INPUT_CC1S_WIDTH 2
#define TIM21_CCMR1_INPUT_CC1S_MASK  (0x3u)
#define TIM21_CCER_CC2NP (1u << 7)
#define TIM21_CCER_CC2P (1u << 5)
#define TIM21_CCER_CC2E (1u << 4)
#define TIM21_CCER_CC1NP (1u << 3)
#define TIM21_CCER_CC1P (1u << 1)
#define TIM21_CCER_CC1E (1u << 0)
#define TIM21_CNT_CNT_LSB   0
#define TIM21_CNT_CNT_WIDTH 16
#define TIM21_CNT_CNT_MASK  (0xFFFFu)
#define TIM21_PSC_PSC_LSB   0
#define TIM21_PSC_PSC_WIDTH 16
#define TIM21_PSC_PSC_MASK  (0xFFFFu)
#define TIM21_ARR_ARR_LSB   0
#define TIM21_ARR_ARR_WIDTH 16
#define TIM21_ARR_ARR_MASK  (0xFFFFu)
#define TIM21_CCR1_CCR1_LSB   0
#define TIM21_CCR1_CCR1_WIDTH 16
#define TIM21_CCR1_CCR1_MASK  (0xFFFFu)
#define TIM21_CCR2_CCR2_LSB   0
#define TIM21_CCR2_CCR2_WIDTH 16
#define TIM21_CCR2_CCR2_MASK  (0xFFFFu)
#define TIM21_OR_ETR_RMP_LSB   0
#define TIM21_OR_ETR_RMP_WIDTH 2
#define TIM21_OR_ETR_RMP_MASK  (0x3u)
#define TIM21_OR_TI1_RMP_LSB   2
#define TIM21_OR_TI1_RMP_WIDTH 3
#define TIM21_OR_TI1_RMP_MASK  (0x1Cu)
#define TIM21_OR_TI2_RMP (1u << 5)

/* === TIM22 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t SMCR; /* 0x008 */
    volatile uint32_t DIER; /* 0x00C */
    volatile uint32_t SR; /* 0x010 */
    volatile uint32_t EGR; /* 0x014 */
    union {
    volatile uint32_t CCMR1_Output; /* 0x018 */
    volatile uint32_t CCMR1_Input; /* 0x018 */
    };
    uint8_t _res_001C[4];
    volatile uint32_t CCER; /* 0x020 */
    volatile uint32_t CNT; /* 0x024 */
    volatile uint32_t PSC; /* 0x028 */
    volatile uint32_t ARR; /* 0x02C */
    uint8_t _res_0030[4];
    volatile uint32_t CCR1; /* 0x034 */
    volatile uint32_t CCR2; /* 0x038 */
    uint8_t _res_003C[20];
    volatile uint32_t OR; /* 0x050 */
} TIM22_Type;

