Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define TIM22_BASE 0x40011400u
#define TIM22 ((volatile TIM22_Type*)TIM22_BASE)

#define TIM22_CR1_CEN (1u << 0)
#define TIM22_CR1_UDIS (1u << 1)
#define TIM22_CR1_URS (1u << 2)
#define TIM22_CR1_OPM (1u << 3)
#define TIM22_CR1_DIR (1u << 4)
#define TIM22_CR1_CMS_LSB   5
#define TIM22_CR1_CMS_WIDTH 2
#define TIM22_CR1_CMS_MASK  (0x60u)
#define TIM22_CR1_ARPE (1u << 7)
#define TIM22_CR1_CKD_LSB   8
#define TIM22_CR1_CKD_WIDTH 2
#define TIM22_CR1_CKD_MASK  (0x300u)
#define TIM22_CR2_MMS_LSB   4
#define TIM22_CR2_MMS_WIDTH 3
#define TIM22_CR2_MMS_MASK  (0x70u)
#define TIM22_SMCR_SMS_LSB   0
#define TIM22_SMCR_SMS_WIDTH 3
#define TIM22_SMCR_SMS_MASK  (0x7u)
#define TIM22_SMCR_TS_LSB   4
#define TIM22_SMCR_TS_WIDTH 3
#define TIM22_SMCR_TS_MASK  (0x70u)
#define TIM22_SMCR_MSM (1u << 7)
#define TIM22_SMCR_ETF_LSB   8
#define TIM22_SMCR_ETF_WIDTH 4
#define TIM22_SMCR_ETF_MASK  (0xF00u)
#define TIM22_SMCR_ETPS_LSB   12
#define TIM22_SMCR_ETPS_WIDTH 2
#define TIM22_SMCR_ETPS_MASK  (0x3000u)
#define TIM22_SMCR_ECE (1u << 14)
#define TIM22_SMCR_ETP (1u << 15)
#define TIM22_DIER_TIE (1u << 6)
#define TIM22_DIER_CC2IE (1u << 2)
#define TIM22_DIER_CC1IE (1u << 1)
#define TIM22_DIER_UIE (1u << 0)
#define TIM22_SR_CC2OF (1u << 10)
#define TIM22_SR_CC1OF (1u << 9)
#define TIM22_SR_TIF (1u << 6)
#define TIM22_SR_CC2IF (1u << 2)
#define TIM22_SR_CC1IF (1u << 1)
#define TIM22_SR_UIF (1u << 0)
#define TIM22_EGR_TG (1u << 6)
#define TIM22_EGR_CC2G (1u << 2)
#define TIM22_EGR_CC1G (1u << 1)
#define TIM22_EGR_UG (1u << 0)
#define TIM22_CCMR1_OUTPUT_OC2M_LSB   12
#define TIM22_CCMR1_OUTPUT_OC2M_WIDTH 3
#define TIM22_CCMR1_OUTPUT_OC2M_MASK  (0x7000u)
#define TIM22_CCMR1_OUTPUT_OC2PE (1u << 11)
#define TIM22_CCMR1_OUTPUT_OC2FE (1u << 10)
#define TIM22_CCMR1_OUTPUT_CC2S_LSB   8
#define TIM22_CCMR1_OUTPUT_CC2S_WIDTH 2
#define TIM22_CCMR1_OUTPUT_CC2S_MASK  (0x300u)
#define TIM22_CCMR1_OUTPUT_OC1M_LSB   4
#define TIM22_CCMR1_OUTPUT_OC1M_WIDTH 3
#define TIM22_CCMR1_OUTPUT_OC1M_MASK  (0x70u)
#define TIM22_CCMR1_OUTPUT_OC1PE (1u << 3)
#define TIM22_CCMR1_OUTPUT_OC1FE (1u << 2)
#define TIM22_CCMR1_OUTPUT_CC1S_LSB   0
#define TIM22_CCMR1_OUTPUT_CC1S_WIDTH 2
#define TIM22_CCMR1_OUTPUT_CC1S_MASK  (0x3u)
#define TIM22_CCMR1_INPUT_IC2F_LSB   12
#define TIM22_CCMR1_INPUT_IC2F_WIDTH 4
#define TIM22_CCMR1_INPUT_IC2F_MASK  (0xF000u)
#define TIM22_CCMR1_INPUT_IC2PSC_LSB   10
#define TIM22_CCMR1_INPUT_IC2PSC_WIDTH 2
#define TIM22_CCMR1_INPUT_IC2PSC_MASK  (0xC00u)
#define TIM22_CCMR1_INPUT_CC2S_LSB   8
#define TIM22_CCMR1_INPUT_CC2S_WIDTH 2
#define TIM22_CCMR1_INPUT_CC2S_MASK  (0x300u)
#define TIM22_CCMR1_INPUT_IC1F_LSB   4
#define TIM22_CCMR1_INPUT_IC1F_WIDTH 4
#define TIM22_CCMR1_INPUT_IC1F_MASK  (0xF0u)
#define TIM22_CCMR1_INPUT_IC1PSC_LSB   2
#define TIM22_CCMR1_INPUT_IC1PSC_WIDTH 2
#define TIM22_CCMR1_INPUT_IC1PSC_MASK  (0xCu)
#define TIM22_CCMR1_INPUT_CC1S_LSB   0
#define TIM22_CCMR1_INPUT_CC1S_WIDTH 2
#define TIM22_CCMR1_INPUT_CC1S_MASK  (0x3u)
#define TIM22_CCER_CC2NP (1u << 7)
#define TIM22_CCER_CC2P (1u << 5)
#define TIM22_CCER_CC2E (1u << 4)
#define TIM22_CCER_CC1NP (1u << 3)
#define TIM22_CCER_CC1P (1u << 1)
#define TIM22_CCER_CC1E (1u << 0)
#define TIM22_CNT_CNT_LSB   0
#define TIM22_CNT_CNT_WIDTH 16
#define TIM22_CNT_CNT_MASK  (0xFFFFu)
#define TIM22_PSC_PSC_LSB   0
#define TIM22_PSC_PSC_WIDTH 16
#define TIM22_PSC_PSC_MASK  (0xFFFFu)
#define TIM22_ARR_ARR_LSB   0
#define TIM22_ARR_ARR_WIDTH 16
#define TIM22_ARR_ARR_MASK  (0xFFFFu)
#define TIM22_CCR1_CCR1_LSB   0
#define TIM22_CCR1_CCR1_WIDTH 16
#define TIM22_CCR1_CCR1_MASK  (0xFFFFu)
#define TIM22_CCR2_CCR2_LSB   0
#define TIM22_CCR2_CCR2_WIDTH 16
#define TIM22_CCR2_CCR2_MASK  (0xFFFFu)
#define TIM22_OR_ETR_RMP_LSB   0
#define TIM22_OR_ETR_RMP_WIDTH 2
#define TIM22_OR_ETR_RMP_MASK  (0x3u)
#define TIM22_OR_TI1_RMP_LSB   2
#define TIM22_OR_TI1_RMP_WIDTH 2
#define TIM22_OR_TI1_RMP_MASK  (0xCu)

/* === LPUART1 ================================= */
typedef struct {
    volatile uint32_t CR1; /* 0x000 */
    volatile uint32_t CR2; /* 0x004 */
    volatile uint32_t CR3; /* 0x008 */
    volatile uint32_t BRR; /* 0x00C */
    uint8_t _res_0010[8];
    volatile uint32_t RQR; /* 0x018 */
    volatile uint32_t ISR; /* 0x01C */
    volatile uint32_t ICR; /* 0x020 */
    volatile uint32_t RDR; /* 0x024 */
    volatile uint32_t TDR; /* 0x028 */
} LPUART1_Type;

#define LPUART1_BASE 0x40004800u
#define LPUART1 ((volatile LPUART1_Type*)LPUART1_BASE)

#define LPUART1_CR1_M1 (1u << 28)
#define LPUART1_CR1_DEAT4 (1u << 25)
#define LPUART1_CR1_DEAT3 (1u << 24)
#define LPUART1_CR1_DEAT2 (1u << 23)
#define LPUART1_CR1_DEAT1 (1u << 22)
#define LPUART1_CR1_DEAT0 (1u << 21)
#define LPUART1_CR1_DEDT4 (1u << 20)
#define LPUART1_CR1_DEDT3 (1u << 19)
#define LPUART1_CR1_DEDT2 (1u << 18)
#define LPUART1_CR1_DEDT1 (1u << 17)
#define LPUART1_CR1_DEDT0 (1u << 16)
#define LPUART1_CR1_CMIE (1u << 14)
#define LPUART1_CR1_MME (1u << 13)
#define LPUART1_CR1_M0 (1u << 12)
#define LPUART1_CR1_WAKE (1u << 11)
#define LPUART1_CR1_PCE (1u << 10)
#define LPUART1_CR1_PS (1u << 9)
#define LPUART1_CR1_PEIE (1u << 8)
#define LPUART1_CR1_TXEIE (1u << 7)
#define LPUART1_CR1_TCIE (1u << 6)
#define LPUART1_CR1_RXNEIE (1u << 5)
#define LPUART1_CR1_IDLEIE (1u << 4)
#define LPUART1_CR1_TE (1u << 3)
#define LPUART1_CR1_RE (1u << 2)
#define LPUART1_CR1_UESM (1u << 1)
#define LPUART1_CR1_UE (1u << 0)
#define LPUART1_CR2_ADD4_7_LSB   28
#define LPUART1_CR2_ADD4_7_WIDTH 4
#define LPUART1_CR2_ADD4_7_MASK  (0xF0000000u)
#define LPUART1_CR2_ADD0_3_LSB   24
#define LPUART1_CR2_ADD0_3_WIDTH 4
#define LPUART1_CR2_ADD0_3_MASK  (0xF000000u)
#define LPUART1_CR2_MSBFIRST (1u << 19)
#define LPUART1_CR2_TAINV (1u << 18)
#define LPUART1_CR2_TXINV (1u << 17)
#define LPUART1_CR2_RXINV (1u << 16)
#define LPUART1_CR2_SWAP (1u << 15)
#define LPUART1_CR2_STOP_LSB   12
#define LPUART1_CR2_STOP_WIDTH 2
#define LPUART1_CR2_STOP_MASK  (0x3000u)
#define LPUART1_CR2_CLKEN (1u << 11)
#define LPUART1_CR2_ADDM7 (1u << 4)
#define LPUART1_CR3_WUFIE (1u << 22)
#define LPUART1_CR3_WUS_LSB   20
#define LPUART1_CR3_WUS_WIDTH 2
#define LPUART1_CR3_WUS_MASK  (0x300000u)
#define LPUART1_CR3_DEP (1u << 15)
#define LPUART1_CR3_DEM (1u << 14)
#define LPUART1_CR3_DDRE (1u << 13)
#define LPUART1_CR3_OVRDIS (1u << 12)
#define LPUART1_CR3_CTSIE (1u << 10)
#define LPUART1_CR3_CTSE (1u << 9)
#define LPUART1_CR3_RTSE (1u << 8)
#define LPUART1_CR3_DMAT (1u << 7)
#define LPUART1_CR3_DMAR (1u << 6)
#define LPUART1_CR3_HDSEL (1u << 3)
#define LPUART1_CR3_EIE (1u << 0)
#define LPUART1_BRR_BRR_LSB   0
#define LPUART1_BRR_BRR_WIDTH 20
#define LPUART1_BRR_BRR_MASK  (0xFFFFFu)
#define LPUART1_RQR_RXFRQ (1u << 3)
#define LPUART1_RQR_MMRQ (1u << 2)
#define LPUART1_RQR_SBKRQ (1u << 1)
#define LPUART1_ISR_REACK (1u << 22)
#define LPUART1_ISR_TEACK (1u << 21)
#define LPUART1_ISR_WUF (1u << 20)
#define LPUART1_ISR_RWU (1u << 19)
#define LPUART1_ISR_SBKF (1u << 18)
#define LPUART1_ISR_CMF (1u << 17)
#define LPUART1_ISR_BUSY (1u << 16)
#define LPUART1_ISR_CTS (1u << 10)
#define LPUART1_ISR_CTSIF (1u << 9)
#define LPUART1_ISR_TXE (1u << 7)
#define LPUART1_ISR_TC (1u << 6)
#define LPUART1_ISR_RXNE (1u << 5)
#define LPUART1_ISR_IDLE (1u << 4)
#define LPUART1_ISR_ORE (1u << 3)
#define LPUART1_ISR_NF (1u << 2)
#define LPUART1_ISR_FE (1u << 1)
#define LPUART1_ISR_PE (1u << 0)
#define LPUART1_ICR_WUCF (1u << 20)
#define LPUART1_ICR_CMCF (1u << 17)
#define LPUART1_ICR_CTSCF (1u << 9)
#define LPUART1_ICR_TCCF (1u << 6)
#define LPUART1_ICR_IDLECF (1u << 4)
#define LPUART1_ICR_ORECF (1u << 3)
#define LPUART1_ICR_NCF (1u << 2)
#define LPUART1_ICR_FECF (1u << 1)
#define LPUART1_ICR_PECF (1u << 0)
#define LPUART1_RDR_RDR_LSB   0
#define LPUART1_RDR_RDR_WIDTH 9
#define LPUART1_RDR_RDR_MASK  (0x1FFu)
#define LPUART1_TDR_TDR_LSB   0
#define LPUART1_TDR_TDR_WIDTH 9
#define LPUART1_TDR_TDR_MASK  (0x1FFu)

/* === NVIC ================================= */
typedef struct {
    volatile uint32_t ISER; /* 0x000 */
    uint8_t _res_0004[124];
    volatile uint32_t ICER; /* 0x080 */
    uint8_t _res_0084[124];
    volatile uint32_t ISPR; /* 0x100 */
    uint8_t _res_0104[124];
    volatile uint32_t ICPR; /* 0x180 */
    uint8_t _res_0184[380];
    volatile uint32_t IPR0; /* 0x300 */
    volatile uint32_t IPR1; /* 0x304 */
    volatile uint32_t IPR2; /* 0x308 */
    volatile uint32_t IPR3; /* 0x30C */
    volatile uint32_t IPR4; /* 0x310 */
    volatile uint32_t IPR5; /* 0x314 */
    volatile uint32_t IPR6; /* 0x318 */
    volatile uint32_t IPR7; /* 0x31C */
} NVIC_Type;

#define NVIC_BASE 0xE000E100u
#define NVIC ((volatile NVIC_Type*)NVIC_BASE)

#define NVIC_ISER_SETENA_LSB   0
#define NVIC_ISER_SETENA_WIDTH 32
#define NVIC_ISER_SETENA_MASK  (0xFFFFFFFFu)
#define NVIC_ICER_CLRENA_LSB   0
#define NVIC_ICER_CLRENA_WIDTH 32
#define NVIC_ICER_CLRENA_MASK  (0xFFFFFFFFu)
#define NVIC_ISPR_SETPEND_LSB   0
#define NVIC_ISPR_SETPEND_WIDTH 32
#define NVIC_ISPR_SETPEND_MASK  (0xFFFFFFFFu)
#define NVIC_ICPR_CLRPEND_LSB   0
#define NVIC_ICPR_CLRPEND_WIDTH 32
#define NVIC_ICPR_CLRPEND_MASK  (0xFFFFFFFFu)
#define NVIC_IPR0_PRI_0_LSB   0
#define NVIC_IPR0_PRI_0_WIDTH 8
#define NVIC_IPR0_PRI_0_MASK  (0xFFu)
#define NVIC_IPR0_PRI_1_LSB   8
#define NVIC_IPR0_PRI_1_WIDTH 8
#define NVIC_IPR0_PRI_1_MASK  (0xFF00u)
#define NVIC_IPR0_PRI_2_LSB   16
#define NVIC_IPR0_PRI_2_WIDTH 8
#define NVIC_IPR0_PRI_2_MASK  (0xFF0000u)
#define NVIC_IPR0_PRI_3_LSB   24
#define NVIC_IPR0_PRI_3_WIDTH 8
#define NVIC_IPR0_PRI_3_MASK  (0xFF000000u)
#define NVIC_IPR1_PRI_4_LSB   0
#define NVIC_IPR1_PRI_4_WIDTH 8
#define NVIC_IPR1_PRI_4_MASK  (0xFFu)
#define NVIC_IPR1_PRI_5_LSB   8
#define NVIC_IPR1_PRI_5_WIDTH 8
#define NVIC_IPR1_PRI_5_MASK  (0xFF00u)
#define NVIC_IPR1_PRI_6_LSB   16
#define NVIC_IPR1_PRI_6_WIDTH 8
#define NVIC_IPR1_PRI_6_MASK  (0xFF0000u)
#define NVIC_IPR1_PRI_7_LSB   24
#define NVIC_IPR1_PRI_7_WIDTH 8
#define NVIC_IPR1_PRI_7_MASK  (0xFF000000u)
#define NVIC_IPR2_PRI_8_LSB   0
#define NVIC_IPR2_PRI_8_WIDTH 8
#define NVIC_IPR2_PRI_8_MASK  (0xFFu)
#define NVIC_IPR2_PRI_9_LSB   8
#define NVIC_IPR2_PRI_9_WIDTH 8
#define NVIC_IPR2_PRI_9_MASK  (0xFF00u)
#define NVIC_IPR2_PRI_10_LSB   16
#define NVIC_IPR2_PRI_10_WIDTH 8
#define NVIC_IPR2_PRI_10_MASK  (0xFF0000u)
#define NVIC_IPR2_PRI_11_LSB   24
#define NVIC_IPR2_PRI_11_WIDTH 8
#define NVIC_IPR2_PRI_11_MASK  (0xFF000000u)
#define NVIC_IPR3_PRI_12_LSB   0
#define NVIC_IPR3_PRI_12_WIDTH 8
#define NVIC_IPR3_PRI_12_MASK  (0xFFu)
#define NVIC_IPR3_PRI_13_LSB   8
#define NVIC_IPR3_PRI_13_WIDTH 8
#define NVIC_IPR3_PRI_13_MASK  (0xFF00u)
#define NVIC_IPR3_PRI_14_LSB   16
#define NVIC_IPR3_PRI_14_WIDTH 8
#define NVIC_IPR3_PRI_14_MASK  (0xFF0000u)
#define NVIC_IPR3_PRI_15_LSB   24
#define NVIC_IPR3_PRI_15_WIDTH 8
#define NVIC_IPR3_PRI_15_MASK  (0xFF000000u)
#define NVIC_IPR4_PRI_16_LSB   0
#define NVIC_IPR4_PRI_16_WIDTH 8
#define NVIC_IPR4_PRI_16_MASK  (0xFFu)
#define NVIC_IPR4_PRI_17_LSB   8
#define NVIC_IPR4_PRI_17_WIDTH 8
#define NVIC_IPR4_PRI_17_MASK  (0xFF00u)
#define NVIC_IPR4_PRI_18_LSB   16
#define NVIC_IPR4_PRI_18_WIDTH 8
#define NVIC_IPR4_PRI_18_MASK  (0xFF0000u)
#define NVIC_IPR4_PRI_19_LSB   24
#define NVIC_IPR4_PRI_19_WIDTH 8
#define NVIC_IPR4_PRI_19_MASK  (0xFF000000u)
#define NVIC_IPR5_PRI_20_LSB   0
#define NVIC_IPR5_PRI_20_WIDTH 8
#define NVIC_IPR5_PRI_20_MASK  (0xFFu)
#define NVIC_IPR5_PRI_21_LSB   8
#define NVIC_IPR5_PRI_21_WIDTH 8
#define NVIC_IPR5_PRI_21_MASK  (0xFF00u)
#define NVIC_IPR5_PRI_22_LSB   16
#define NVIC_IPR5_PRI_22_WIDTH 8
#define NVIC_IPR5_PRI_22_MASK  (0xFF0000u)
#define NVIC_IPR5_PRI_23_LSB   24
#define NVIC_IPR5_PRI_23_WIDTH 8
#define NVIC_IPR5_PRI_23_MASK  (0xFF000000u)
#define NVIC_IPR6_PRI_24_LSB   0
#define NVIC_IPR6_PRI_24_WIDTH 8
#define NVIC_IPR6_PRI_24_MASK  (0xFFu)
#define NVIC_IPR6_PRI_25_LSB   8
#define NVIC_IPR6_PRI_25_WIDTH 8
#define NVIC_IPR6_PRI_25_MASK  (0xFF00u)
#define NVIC_IPR6_PRI_26_LSB   16
#define NVIC_IPR6_PRI_26_WIDTH 8
#define NVIC_IPR6_PRI_26_MASK  (0xFF0000u)
#define NVIC_IPR6_PRI_27_LSB   24
#define NVIC_IPR6_PRI_27_WIDTH 8
#define NVIC_IPR6_PRI_27_MASK  (0xFF000000u)
#define NVIC_IPR7_PRI_28_LSB   0
#define NVIC_IPR7_PRI_28_WIDTH 8
#define NVIC_IPR7_PRI_28_MASK  (0xFFu)
#define NVIC_IPR7_PRI_29_LSB   8
#define NVIC_IPR7_PRI_29_WIDTH 8
#define NVIC_IPR7_PRI_29_MASK  (0xFF00u)
#define NVIC_IPR7_PRI_30_LSB   16
#define NVIC_IPR7_PRI_30_WIDTH 8
#define NVIC_IPR7_PRI_30_MASK  (0xFF0000u)
#define NVIC_IPR7_PRI_31_LSB   24
#define NVIC_IPR7_PRI_31_WIDTH 8
#define NVIC_IPR7_PRI_31_MASK  (0xFF000000u)

/* === MPU ================================= */
typedef struct {
    volatile uint32_t MPU_TYPER; /* 0x000 */
    volatile uint32_t MPU_CTRL; /* 0x004 */
    volatile uint32_t MPU_RNR; /* 0x008 */
    volatile uint32_t MPU_RBAR; /* 0x00C */
    volatile uint32_t MPU_RASR; /* 0x010 */
} MPU_Type;

