Stachu1/STM32_Watch/firmware/stm32l0x1_peripherals.h
#define MPU_BASE 0xE000ED90u
#define MPU ((volatile MPU_Type*)MPU_BASE)

#define MPU_MPU_TYPER_SEPARATE (1u << 0)
#define MPU_MPU_TYPER_DREGION_LSB   8
#define MPU_MPU_TYPER_DREGION_WIDTH 8
#define MPU_MPU_TYPER_DREGION_MASK  (0xFF00u)
#define MPU_MPU_TYPER_IREGION_LSB   16
#define MPU_MPU_TYPER_IREGION_WIDTH 8
#define MPU_MPU_TYPER_IREGION_MASK  (0xFF0000u)
#define MPU_MPU_CTRL_ENABLE (1u << 0)
#define MPU_MPU_CTRL_HFNMIENA (1u << 1)
#define MPU_MPU_CTRL_PRIVDEFENA (1u << 2)
#define MPU_MPU_RNR_REGION_LSB   0
#define MPU_MPU_RNR_REGION_WIDTH 8
#define MPU_MPU_RNR_REGION_MASK  (0xFFu)
#define MPU_MPU_RBAR_REGION_LSB   0
#define MPU_MPU_RBAR_REGION_WIDTH 4
#define MPU_MPU_RBAR_REGION_MASK  (0xFu)
#define MPU_MPU_RBAR_VALID (1u << 4)
#define MPU_MPU_RBAR_ADDR_LSB   5
#define MPU_MPU_RBAR_ADDR_WIDTH 27
#define MPU_MPU_RBAR_ADDR_MASK  (0xFFFFFFE0u)
#define MPU_MPU_RASR_ENABLE (1u << 0)
#define MPU_MPU_RASR_SIZE_LSB   1
#define MPU_MPU_RASR_SIZE_WIDTH 5
#define MPU_MPU_RASR_SIZE_MASK  (0x3Eu)
#define MPU_MPU_RASR_SRD_LSB   8
#define MPU_MPU_RASR_SRD_WIDTH 8
#define MPU_MPU_RASR_SRD_MASK  (0xFF00u)
#define MPU_MPU_RASR_B (1u << 16)
#define MPU_MPU_RASR_C (1u << 17)
#define MPU_MPU_RASR_S (1u << 18)
#define MPU_MPU_RASR_TEX_LSB   19
#define MPU_MPU_RASR_TEX_WIDTH 3
#define MPU_MPU_RASR_TEX_MASK  (0x380000u)
#define MPU_MPU_RASR_AP_LSB   24
#define MPU_MPU_RASR_AP_WIDTH 3
#define MPU_MPU_RASR_AP_MASK  (0x7000000u)
#define MPU_MPU_RASR_XN (1u << 28)

/* === STK ================================= */
typedef struct {
    volatile uint32_t CSR; /* 0x000 */
    volatile uint32_t RVR; /* 0x004 */
    volatile uint32_t CVR; /* 0x008 */
    volatile uint32_t CALIB; /* 0x00C */
} STK_Type;

#define STK_BASE 0xE000E010u
#define STK ((volatile STK_Type*)STK_BASE)

#define STK_CSR_ENABLE (1u << 0)
#define STK_CSR_TICKINT (1u << 1)
#define STK_CSR_CLKSOURCE (1u << 2)
#define STK_CSR_COUNTFLAG (1u << 16)
#define STK_RVR_RELOAD_LSB   0
#define STK_RVR_RELOAD_WIDTH 24
#define STK_RVR_RELOAD_MASK  (0xFFFFFFu)
#define STK_CVR_CURRENT_LSB   0
#define STK_CVR_CURRENT_WIDTH 24
#define STK_CVR_CURRENT_MASK  (0xFFFFFFu)
#define STK_CALIB_TENMS_LSB   0
#define STK_CALIB_TENMS_WIDTH 24
#define STK_CALIB_TENMS_MASK  (0xFFFFFFu)
#define STK_CALIB_SKEW (1u << 30)
#define STK_CALIB_NOREF (1u << 31)

/* === SCB ================================= */
typedef struct {
    volatile uint32_t CPUID; /* 0x000 */
    volatile uint32_t ICSR; /* 0x004 */
    volatile uint32_t VTOR; /* 0x008 */
    volatile uint32_t AIRCR; /* 0x00C */
    volatile uint32_t SCR; /* 0x010 */
    volatile uint32_t CCR; /* 0x014 */
    uint8_t _res_0018[4];
    volatile uint32_t SHPR2; /* 0x01C */
    volatile uint32_t SHPR3; /* 0x020 */
} SCB_Type;

#define SCB_BASE 0xE000ED00u
#define SCB ((volatile SCB_Type*)SCB_BASE)

#define SCB_CPUID_REVISION_LSB   0
#define SCB_CPUID_REVISION_WIDTH 4
#define SCB_CPUID_REVISION_MASK  (0xFu)
#define SCB_CPUID_PARTNO_LSB   4
#define SCB_CPUID_PARTNO_WIDTH 12
#define SCB_CPUID_PARTNO_MASK  (0xFFF0u)
#define SCB_CPUID_ARCHITECTURE_LSB   16
#define SCB_CPUID_ARCHITECTURE_WIDTH 4
#define SCB_CPUID_ARCHITECTURE_MASK  (0xF0000u)
#define SCB_CPUID_VARIANT_LSB   20
#define SCB_CPUID_VARIANT_WIDTH 4
#define SCB_CPUID_VARIANT_MASK  (0xF00000u)
#define SCB_CPUID_IMPLEMENTER_LSB   24
#define SCB_CPUID_IMPLEMENTER_WIDTH 8
#define SCB_CPUID_IMPLEMENTER_MASK  (0xFF000000u)
#define SCB_ICSR_VECTACTIVE_LSB   0
#define SCB_ICSR_VECTACTIVE_WIDTH 9
#define SCB_ICSR_VECTACTIVE_MASK  (0x1FFu)
#define SCB_ICSR_RETTOBASE (1u << 11)
#define SCB_ICSR_VECTPENDING_LSB   12
#define SCB_ICSR_VECTPENDING_WIDTH 7
#define SCB_ICSR_VECTPENDING_MASK  (0x7F000u)
#define SCB_ICSR_ISRPENDING (1u << 22)
#define SCB_ICSR_PENDSTCLR (1u << 25)
#define SCB_ICSR_PENDSTSET (1u << 26)
#define SCB_ICSR_PENDSVCLR (1u << 27)
#define SCB_ICSR_PENDSVSET (1u << 28)
#define SCB_ICSR_NMIPENDSET (1u << 31)
#define SCB_VTOR_TBLOFF_LSB   7
#define SCB_VTOR_TBLOFF_WIDTH 25
#define SCB_VTOR_TBLOFF_MASK  (0xFFFFFF80u)
#define SCB_AIRCR_VECTCLRACTIVE (1u << 1)
#define SCB_AIRCR_SYSRESETREQ (1u << 2)
#define SCB_AIRCR_ENDIANESS (1u << 15)
#define SCB_AIRCR_VECTKEYSTAT_LSB   16
#define SCB_AIRCR_VECTKEYSTAT_WIDTH 16
#define SCB_AIRCR_VECTKEYSTAT_MASK  (0xFFFF0000u)
#define SCB_SCR_SLEEPONEXIT (1u << 1)
#define SCB_SCR_SLEEPDEEP (1u << 2)
#define SCB_SCR_SEVEONPEND (1u << 4)
#define SCB_CCR_NONBASETHRDENA (1u << 0)
#define SCB_CCR_USERSETMPEND (1u << 1)
#define SCB_CCR_UNALIGN__TRP (1u << 3)
#define SCB_CCR_DIV_0_TRP (1u << 4)
#define SCB_CCR_BFHFNMIGN (1u << 8)
#define SCB_CCR_STKALIGN (1u << 9)
#define SCB_SHPR2_PRI_11_LSB   24
#define SCB_SHPR2_PRI_11_WIDTH 8
#define SCB_SHPR2_PRI_11_MASK  (0xFF000000u)
#define SCB_SHPR3_PRI_14_LSB   16
#define SCB_SHPR3_PRI_14_WIDTH 8
#define SCB_SHPR3_PRI_14_MASK  (0xFF0000u)
#define SCB_SHPR3_PRI_15_LSB   24
#define SCB_SHPR3_PRI_15_WIDTH 8
#define SCB_SHPR3_PRI_15_MASK  (0xFF000000u)

#endif /* STM32L0X1_PERIPHERALS_H_ */
